[
  {
    "id": 33079,
    "title": "Fly through Gaia’s 3D map of stellar nurseries",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Gaia/Fly_through_Gaia_s_3D_map_of_stellar_nurseries",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/gaia_sees_stellar_nurseries_animation_still/26863565-1-eng-GB/Gaia_sees_stellar_nurseries_animation_still_card_full.jpg",
    "news_site": "ESA",
    "summary": "Scientists created the most accurate three-dimensional map of star-formation regions in our Milky Way galaxy, based on data from the European Space Agency’s Gaia space telescope. This map will teach us more about these obscure cloudy areas, and the hot young stars that shape them.",
    "published_at": "2025-09-16T12:00:00Z",
    "updated_at": "2025-09-16T12:01:02.988174Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2044f8a1-4dad-4c8b-a3a9-5ecc7045c257",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots of the U.S. for next week. Visit CNN.com/Travel each week for a new gallery of snapshots. Visit www.dailymail.co.uk/travel for the latest."
  },
  {
    "id": 33080,
    "title": "Josef Aschbacher on geopolitics and Europe’s changing space debate",
    "authors": [
      {
        "name": "Mike Gruss",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/josef-aschbacher-on-geopolitics-and-europes-changing-space-debate/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Screenshot-2025-09-15-125701.png?fit=1024%2C429&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nPARIS – Josef Aschbacher, the head of the European Space Agency, said member states are quickly changing how they view space, from its role in geopolitics, to the need for sovereign capabilities to working more closely with their national security counterparts. During a Sept. 15 interview here at World Space Business Week, Aschbacher, the agency’s […]\nThe post Josef Aschbacher on geopolitics and Europe’s changing space debate appeared first on SpaceNews.",
    "published_at": "2025-09-16T11:59:19Z",
    "updated_at": "2025-09-16T12:00:29.345482Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33078,
    "title": "How SpaceX turned a Texas marsh into the world’s most watched spaceport",
    "authors": [
      {
        "name": "Christian Davenport",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/how-spacex-turned-a-texas-marsh-into-the-worlds-most-watched-spaceport/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/USA_-_Texas_-_Boca_Chica_-_Starbase_51286054441-scaled.jpg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nEDITOR’S NOTE: Starbase is SpaceX’s massive rocket development site and the home of Starship — the vehicle Elon Musk envisions as humanity’s path to Mars and that many in the U.S. civil space program see as a way back to the moon. But Starbase started as little more than an impossible stretch of empty land […]\nThe post How SpaceX turned a Texas marsh into the world’s most watched spaceport appeared first on SpaceNews.",
    "published_at": "2025-09-16T11:00:00Z",
    "updated_at": "2025-09-16T11:10:21.034034Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33076,
    "title": "Keys to the Moon: ESA hands over third European Service Module",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/Keys_to_the_Moon_ESA_hands_over_third_European_Service_Module",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/keys_to_the_moon_esa_hands_over_third_european_service_module/26870660-1-eng-GB/Keys_to_the_Moon_ESA_hands_over_third_European_Service_Module_card_full.jpg",
    "news_site": "ESA",
    "summary": "Teams from ESA, Airbus, NASA and Lockheed Martin stand before the service module for Artemis III at NASA's Kennedy Space Center.",
    "published_at": "2025-09-16T09:00:00Z",
    "updated_at": "2025-09-16T11:53:45.264548Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "8034d81b-af96-460c-a7b7-5c8e7f1a1d86",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The third European Service Module was integrated by Airbus in Bremen, Germany, with contributions from industry all over Europe. The module will power Orion on Artemis III, the mission set to return astronauts to the lunar surface for the first time in over 50 years. The handover took place on 10 September at NASA’s Kennedy Space Center."
  },
  {
    "id": 33077,
    "title": "A cell’s-eye view of altered gravity and ageing",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Space_Engineering_Technology/A_cell_s-eye_view_of_altered_gravity_and_ageing",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2019/11/endothelial_cells/21149929-1-eng-GB/Endothelial_cells_card_full.jpg",
    "news_site": "ESA",
    "summary": "Muscle weakening, bone density loss and an impaired immune system: the systemic health impacts of spaceflight bear many similarities to ageing. Sharon van Rijthoven, a student from Delft University of Technology and Vrije Universiteit Amsterdam, compared the effects of ageing and altered gravity from a cellular perspective during her internship at the European Space Agency (ESA).",
    "published_at": "2025-09-16T08:00:00Z",
    "updated_at": "2025-09-16T11:53:57.672204Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Sharon van Rijthoven, a student from Delft University of Technology and Vrije Universiteit Amsterdam, compared the effects of ageing and altered gravity from a cellular perspective. When astronauts visit the International Space Station (ISS), they experience a weightless environment. The lack of gravity means that the bones and muscles that support and move the body do not need to work as hard."
  },
  {
    "id": 33075,
    "title": "CNES Call Reveals Inaugural Callisto Flight Test Pushed to 2027",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/cnes-call-reveals-inaugural-callisto-flight-test-pushed-to-2027/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/CNES-Call-Reveals-Inaugural-Callisto-Flight-Test-Pushed-to-2027.webp",
    "news_site": "European Spaceflight",
    "summary": "A 12 September call for proposals published by the French space agency CNES has revealed that the inaugural flight of the Callisto reusable rocket demonstrator has slipped from 2026 to 2027. Conceived in 2015, the Cooperative Action Leading to Launcher Innovation in Stage Toss-back Operations (Callisto) project is a collaboration between CNES, DLR, and JAXA […]\nThe post CNES Call Reveals Inaugural Callisto Flight Test Pushed to 2027 appeared first on European Spaceflight.",
    "published_at": "2025-09-16T07:28:17Z",
    "updated_at": "2025-09-16T07:30:11.829311Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Callisto will stand 14 metres tall, with a width of 1.1 metres and a takeoff mass of 3,500 kilograms. It will include an integration phase followed by eight test flights and two demonstration flights, all to be completed over a period of eight months. Themis, Europe’s other, more capable reusable rocket demonstrator, is likely to conduct its initial hop tests from Esrange in Sweden."
  },
  {
    "id": 33074,
    "title": "SDA picks GMV to build next-generation space safety system",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/sda-picks-gmv-to-build-next-generation-space-safety-system/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/09/space-situational-awareness-ESA-scaled.jpg?fit=1024%2C533&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe Space Data Association has picked Spanish technology provider GMV to upgrade and operate its global space traffic coordination platform starting early next year, the non-profit group of satellite operators announced Sept. 16.\nThe post SDA picks GMV to build next-generation space safety system appeared first on SpaceNews.",
    "published_at": "2025-09-16T07:00:00Z",
    "updated_at": "2025-09-16T07:10:30.384349Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33073,
    "title": "Isar Aerospace prepares for second Spectrum launch",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/isar-aerospace-prepares-for-second-spectrum-launch/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/spectrum-1stlaunch-kenniston.jpeg?fit=1024%2C684&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA loss of attitude control and an open valve contributed to the loss of Isar Aerospace’s first Spectrum rocket in March as the company gears up for a second flight.\nThe post Isar Aerospace prepares for second Spectrum launch appeared first on SpaceNews.",
    "published_at": "2025-09-16T04:37:41Z",
    "updated_at": "2025-09-16T04:40:27.630757Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33072,
    "title": "NASA Sets Launch Coverage for Space Weather Missions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-sets-launch-coverage-for-space-weather-missions/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/imap-swfo-l1-carruthers-prelaunch-news-conference-key-art-r3-key-art-2-1-without-title.jpg",
    "news_site": "NASA",
    "summary": "NASA will provide live coverage of prelaunch and launch activities for an observatory designed to study space weather and explore and map the boundaries of our solar neighborhood. Launching with IMAP (Interstellar Mapping and Acceleration Probe) are two rideshare missions, NASA’s Carruthers Geocorona Observatory and the National Oceanic and Atmospheric Administration’s (NOAA) Space Weather Follow […]",
    "published_at": "2025-09-15T21:29:53Z",
    "updated_at": "2025-09-15T21:30:06.000602Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA will provide live coverage of prelaunch and launch activities for an observatory designed to study space weather. The IMAP spacecraft will study how the Sun’s energy and particles interact with the heliosphere. The Carruthers Geocorona Observatory is a small satellite that will observe the outermost atmospheric layer, the exosphere. Launch day coverage of the mission will be available on the agency’s website. Audio-only of the launch coverage will be carried on the NASA “V’ circuits. Members of the public can register to attend this launch virtually. Let people know you’re watching the mission on X, Facebook, and Instagram."
  },
  {
    "id": 33071,
    "title": "Launch Roundup: Starlink, NRO, and New Shepard missions scheduled",
    "authors": [
      {
        "name": "Haygen Warren",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/launch-roundup-091525/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/05/julia-streak-2.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "Another busy week of launches has arrived, with SpaceX dominating the launch manifest with four…\nThe post Launch Roundup: Starlink, NRO, and New Shepard missions scheduled appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-15T20:48:47Z",
    "updated_at": "2025-09-15T20:50:11.735416Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has four missions scheduled for the week. Three of these missions will see new batches of Starlink internet satellites launched into the company’s Starlink constellation. The fourth mission will launch a payload for the National Reconnaissance Office. Blue Origin will finally launch its uncrewed NS-35 mission on New Shepard on Thursday. Falcon 9 will launch 28 Starlink v2 Mini satellites into the constellation’s Group 10 shell, which is in a 53.16-degree inclination LEO. After liftoff and stage separation, B1088 will reenter Earth's atmosphere and land on SpaceX's droneship Of Course I Still Love You. B1092 will be flying for the seventh time, after supporting the NROL-69, CRS-32, GPS III SV08, USSF-36 and two Starlink missions (Groups 12-13 and 10-34) The NROL-48 mission for the National Reconnaissance Office is scheduled for Sunday, Sept. 21. Falcon 9 will fly the payload, a batch of Starshield satellites developed by SpaceX for government and military use, southeast out of Vandenberg into an orbit inclined 70 degrees. Falcon booster B1081 will fly for the 18th time on this mission after a 30-day turnaround."
  },
  {
    "id": 33070,
    "title": "Telesat pitches Lightspeed as stopgap to Europe’s IRIS²",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/telesat-pitches-lightspeed-as-stopgap-to-europes-iris%c2%b2/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Telesat-CEO-Dan-Goldberg-WSBW.jpg?fit=1024%2C575&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nCanada’s Telesat is pitching Lightspeed as a bridge to IRIS² as its LEO broadband constellation is set to come online in 2027, at least three years before Europe’s sovereign multi-orbit network is due to enter service.\nThe post Telesat pitches Lightspeed as stopgap to Europe’s IRIS² appeared first on SpaceNews.",
    "published_at": "2025-09-15T20:20:27Z",
    "updated_at": "2025-09-15T20:20:33.969624Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33069,
    "title": "NASA Awards Safety, Mission Assurance Services Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-safety-mission-assurance-services-contract-2/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
    "news_site": "NASA",
    "summary": "NASA has selected Bastion Technologies Inc. of Houston to provide safety and mission assurance services for the agency’s Marshall Space Flight Center in Huntsville, Alabama. The Safety and Mission Assurance II (SMAS II) award is a performance-based, indefinite-delivery/indefinite-quantity contract with a maximum potential value of $400 million. A phase-in period begins Monday, followed by a […]",
    "published_at": "2025-09-15T20:16:30Z",
    "updated_at": "2025-09-15T20:20:05.492834Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Bastion Technologies Inc. of Houston will provide safety and mission assurance services. The work will support various spaceflight and science missions. A phase-in period begins Monday, followed by a base ordering period of four years with options to extend services through March 2034."
  },
  {
    "id": 33068,
    "title": "NASA Analysis Shows Sun’s Activity Ramping Up",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/science-research/heliophysics/nasa-analysis-shows-suns-activity-ramping-up/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/1-pia26681-new-sun-image.jpg",
    "news_site": "NASA",
    "summary": "It looked like the Sun was heading toward a historic lull in activity. That trend flipped in 2008, according to new research. The Sun has become increasingly active since 2008, a new NASA study shows. Solar activity is known to fluctuate in cycles of 11 years, but there are longer-term variations that can last decades. […]",
    "published_at": "2025-09-15T17:51:38Z",
    "updated_at": "2025-09-15T18:00:09.324073Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Sun has become increasingly active since 2008, a new NASA study shows. Trend could lead to an uptick in space weather events, such as solar storms, flares, and coronal mass ejections. Space weather predictions are critical for supporting the spacecraft and astronauts of NASA’s Artemis campaign. Two primary sources — ACE (Advanced Composition Explorer) and the Wind mission — launched in the 1990s and have been providing data on solar activity. The spacecraft belong to a fleet of NASA Heliophysics Division missions designed to study the Sun’s influence on space, Earth, and other planets."
  },
  {
    "id": 33066,
    "title": "Connecting Educators with NASA Data: Learning Ecosystems Northeast in Action",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/connecting-educators-with-nasa-data-learning-ecosystems-northeast-in-action/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/LENE_CLE_Gathering_Aug_2025-Keri-Moskowitz.jpg",
    "news_site": "NASA",
    "summary": "One of the challenges many teachers face year after year is a sense of working alone. Despite the constant interaction with students many questions often linger: Did the lesson stick? Will students carry this knowledge with them? Will it shape how they see and engage with the world? What can be easy to overlook is […]",
    "published_at": "2025-09-15T16:59:39Z",
    "updated_at": "2025-09-15T17:10:13.510712Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Connected Learning Ecosystems (CLEs) exist wherever learning happens. CLEs are the collective of people who contribute to a young person’s growth and education. Nearly 70 educators from across the northeast came together for two amazingly energized days of connection, learning, and future planning. Connected Learning Ecosystems (LEE) is a network of peer communities for educators across the Northeast. LENE is supported by NASA under cooperative agreement award number NNX16AB94A and is part of NASA's Science Activation Portfolio. This year's LENE conference was held in Portland, Maine."
  },
  {
    "id": 33065,
    "title": "Inside ESA’s vision with Josef Aschbacher",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/inside-esas-vision-with-josef-aschbacher/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/aschbacher-esa-ceo-series-spaceminds-2000-1500-scaled.jpg?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIn this week’s special CEO Series edition of Space Minds, we're at the World Space Business Week in Paris. In today's episode, SpaceNews editor Mike Gruss talks with Josef Aschbacher, Director General of the European Space Agency.\nThe post Inside ESA’s vision with Josef Aschbacher appeared first on SpaceNews.",
    "published_at": "2025-09-15T16:59:20Z",
    "updated_at": "2025-09-15T17:00:32.105452Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33067,
    "title": "Curiosity Blog, Sols 4655-4660: Boxworks With a View",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4655-4660-boxworks-with-a-view/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/september/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04657_opgs_edr_ncam_NRB_810906228EDR_S1182538NCAM00594M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Sharon Wilson Purdy, Planetary Geologist at the Smithsonian National Air and Space Museum Earth planning date: Friday Sept. 12, 2025 Curiosity continues to image, analyze, and traverse through a landscape characterized by higher standing ridges separating low-lying depressions (hollows) — a surface known as the boxwork terrain on Mount Sharp. The science team […]",
    "published_at": "2025-09-15T16:15:32Z",
    "updated_at": "2025-09-15T17:10:13.542030Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Geologist Sharon Wilson Purdy served as the Geology theme group “Keeper of the Plan” for Sols 4656-4657. ChemCam used its LIBS instrument to analyze the chemistry of a bedrock ridge at the “Quechua” target. Mastcam and ChemCam included several mosaics to document walls of nearby hollow interiors."
  },
  {
    "id": 33064,
    "title": "York Space hits milestone with largest satellite delivery yet",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/york-space-hits-milestone-with-largest-satellite-delivery-yet/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/G0fSTN3aAAAJSe9-scaled.jpeg?fit=1024%2C682&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nCEO says years of scaling up production are paying off as Pentagon ramps constellation orders\nThe post York Space hits milestone with largest satellite delivery yet appeared first on SpaceNews.",
    "published_at": "2025-09-15T16:00:00Z",
    "updated_at": "2025-09-15T16:30:22.824403Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33063,
    "title": "Swissto12 clears PDR for debut small GEO D2D satellite",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/swissto12-clears-pdr-for-debut-small-geo-d2d-satellite/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/unnamed-scaled.jpg?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSwissto12 has completed the Preliminary Design Review for its first direct-to-device connectivity satellite, the Swiss small geostationary spacecraft manufacturer announced Sept. 15.\nThe post Swissto12 clears PDR for debut small GEO D2D satellite appeared first on SpaceNews.",
    "published_at": "2025-09-15T15:45:34Z",
    "updated_at": "2025-09-15T15:50:25.612212Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33062,
    "title": "Launch companies double down on increasing flight rates despite setbacks",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/launch-companies-double-down-on-increasing-flight-rates-despite-setbacks/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/01/NG1-Liftoff-Horizontal.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nLaunch companies are reiterating plans to sharply increase flight rates to meet growing government and commercial demand, even as some fall short of earlier projections.\nThe post Launch companies double down on increasing flight rates despite setbacks appeared first on SpaceNews.",
    "published_at": "2025-09-15T15:25:01Z",
    "updated_at": "2025-09-15T15:30:29.517660Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33061,
    "title": "EchoStar eyes satcom expansion after ‘forced pivot’ from spectrum sales",
    "authors": [
      {
        "name": "Debra Werner and Jason Rainbow",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/echostar-eyes-satcom-expansion-after-forced-pivot-from-spectrum-sales/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/03/OS_MTN_2270630913-1.jpg?fit=1024%2C650&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nEchoStar is looking for ways to expand its communications business as an “asset-light growth company,” CEO Hamid Akhavan said Sept. 15.\nThe post EchoStar eyes satcom expansion after ‘forced pivot’ from spectrum sales appeared first on SpaceNews.",
    "published_at": "2025-09-15T15:11:47Z",
    "updated_at": "2025-09-15T15:20:24.632308Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33060,
    "title": "Helicopter Training for Artemis Missions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/helicopter-training-for-artemis-missions/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/maf-20250826-haats-md28-3dfc99.jpg",
    "news_site": "NASA",
    "summary": "NASA astronauts Matthew Dominick (left) and Mark Vande Hei (right) prepare to fly out to a landing zone in the Rocky Mountains as part of the certification run for the NASA Artemis course on Aug. 26, 2025. The mountains in northern Colorado offer similar visual illusions and flight environments to the Moon. The newly certified […]",
    "published_at": "2025-09-15T14:30:19Z",
    "updated_at": "2025-09-15T14:40:05.126061Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Rocky Mountains offer similar visual illusions and flight environments to the Moon. The newly certified lander flight training course marks a key milestone in crew training for Artemis missions. Through Artemis, NASA will explore the lunar South Pole, paving the way for human exploration farther into the solar system, including Mars."
  },
  {
    "id": 33058,
    "title": "To lead in space, we must go all-in on our industrial base",
    "authors": [
      {
        "name": "Casey Anglada DeRaad",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/to-lead-in-space-we-must-go-all-in-on-our-industrial-base/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/53359913328_b82878da3e_h.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe United States space enterprise is undergoing a sweeping transformation: commercial innovation is progressing at an incredible pace, with profound implications for national defense, economic competitiveness and industrial resilience. The shift represents unprecedented urgency across all levels of government to drive greater commercial space integration. At our annual 2025 State of the Space Industrial Base […]\nThe post To lead in space, we must go all-in on our industrial base appeared first on SpaceNews.",
    "published_at": "2025-09-15T13:00:00Z",
    "updated_at": "2025-09-15T13:10:32.845195Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33057,
    "title": "Military spending and direct-to-device competition are reshaping the space economy",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/military-spending-and-direct-to-device-competition-are-reshaping-the-space-economy/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/sp.png?fit=1024%2C577&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nPARIS – Expanding defense budgets and the direct-to-device race are driving growth in the global space economy, Novaspace CEO Pacôme Révillon, said at the outset of the World Space Business Week conference here. At the same time, the space sector is experiencing significant consolidation, with an average of more than 50 annual mergers and acquisitions completed […]\nThe post Military spending and direct-to-device competition are reshaping the space economy appeared first on SpaceNews.",
    "published_at": "2025-09-15T12:50:44Z",
    "updated_at": "2025-09-15T13:00:26.050874Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33055,
    "title": "RISE: ESA’s mission extender in geostationary orbit",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/07/RISE_ESA_s_mission_extender_in_geostationary_orbit",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/07/rise_esa_s_mission_extender_in_geostationary_orbit/26796061-2-eng-GB/RISE_ESA_s_mission_extender_in_geostationary_orbit_card_full.jpg",
    "news_site": "ESA",
    "summary": "An essential part of ESA’s Space Safety programme is dedicated to getting and keeping Earth’s orbits clean from space debris. In the long run, the Agency aspires to stimulate a true circular economy in space, minimising the impact of spaceflight on Earth and its resources where possible. As part of ESA’s Zero Debris approach, new ESA missions will be designed for safe operations and disposal to stop the creation of new debris by 2030.  ",
    "published_at": "2025-09-15T12:00:00Z",
    "updated_at": "2025-09-15T12:20:13.334801Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "RISE is a commercial in-orbit servicing mission that will demonstrate that it can safely rendezvous and dock to a geostationary client satellite. After verifying that it meets all the performance standards in a first demonstration, prime contractor, operator and co-founder D-Orbit will start commercial life extension services."
  },
  {
    "id": 33054,
    "title": "Avatars for Astronaut Health to Fly on NASA’s Artemis II",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/avatars-for-astronaut-health-nasa-artemis-ii/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/bps/precision-health/tissue-chips/EMULATE_Emulate_Organ-Chip_blue_2.jpg",
    "news_site": "NASA",
    "summary": "NASA announced a trailblazing experiment that aims to take personalized medicine to new heights. The experiment is part of a strategic plan to gather valuable scientific data during the Artemis II mission, enabling NASA to “know before we go” back to the lunar surface and on to Mars. The AVATAR (A Virtual Astronaut Tissue Analog […]",
    "published_at": "2025-09-15T11:56:34Z",
    "updated_at": "2025-09-15T12:10:20.590830Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "AVATAR (A Virtual Astronaut Tissue Analog Response) investigation will use organ-on-a-chip devices, or organ chips, to study the effects of deep space radiation and microgravity on human health. The chips will contain cells from Artemis II astronauts and fly side-by-side with crew on their approximately 10-day journey around the Moon. Artemis II astronauts will donate platelets to a local healthcare system. The cells remaining from their samples will contain a small percentage of bone marrow-derived stem and progenitor cells. NASA-funded scientists at Emulate, Inc. will purify these cells with magnetic beads that bind specifically to them. The purified cells will then be placed in the bone marrow chips."
  },
  {
    "id": 33056,
    "title": "First view of aerosols from MetOp-SG’s 3MI instrument",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/First_view_of_aerosols_from_MetOp-SG_s_3MI_instrument",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/first_view_of_aerosols_from_metop-sg_s_3mi_instrument/26867621-1-eng-GB/First_view_of_aerosols_from_MetOp-SG_s_3MI_instrument_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-15T11:35:00Z",
    "updated_at": "2025-09-15T12:30:16.510299Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "MetOp Second Generation (MetOp-SG) was launched in August 2025. Two of its instruments have already returned first data. Now it's the turn of the Multiviewing multichannel multipolarisation imager – 3MI for short. This hi-tech instrument, built by Leonardo, provides data on aerosols in our atmosphere."
  },
  {
    "id": 33053,
    "title": "UK-Based Hyperspectral Data Analytics Startup Messium Raises £3.3M",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/uk-based-hyperspectral-data-analytics-startup-messium-raises-3-3m/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/UK-Based-Hyperspectral-Data-Analytics-Startup-Messium-Raises-3.3M-Updated.webp",
    "news_site": "European Spaceflight",
    "summary": "UK-based startup Messium has raised £3.3 million in seed funding to accelerate the rollout of its agricultural analytics platform, which uses AI to analyse hyperspectral satellite data to track nitrogen levels in crops. The analysis can then be used by farmers to more efficiently fertilise crops, minimising waste and maximising yield. On 10 September, the […]\nThe post UK-Based Hyperspectral Data Analytics Startup Messium Raises £3.3M appeared first on European Spaceflight.",
    "published_at": "2025-09-15T11:20:14Z",
    "updated_at": "2025-09-15T11:30:14.724725Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "UK-based startup Messium has raised £3.3 million in seed funding to accelerate the rollout of its agricultural analytics platform. The platform uses AI to analyse hyperspectral satellite data to track nitrogen levels in crops. The analysis can be used by farmers to more efficiently fertilise crops, minimising waste and maximising yield."
  },
  {
    "id": 33059,
    "title": "Weird Ways to Observe the Moon",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/solar-system/skywatching/night-sky-network/weird-ways-to-observe-the-moon/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/nightsky/articles/FunnelPhotos_896.original.jpg",
    "news_site": "NASA",
    "summary": "International Observe the Moon Night is on October 4, 2025, this year– but you can observe the Moon whenever it’s up, day or night! While binoculars and telescopes certainly reveal incredible details of our neighbor’s surface, bringing out dark seas, bright craters, and numerous odd fissures and cracks, these tools are not the only way to […]",
    "published_at": "2025-09-15T10:00:00Z",
    "updated_at": "2025-09-15T14:10:18.601907Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "International Observe the Moon Night is on October 4, 2025, this year. There are more ways to observe the Moon than you might expect, just using common household materials. Have you heard of a “Sun Funnel’? It’s a way to safely view the Sun by projecting the image from an eyepiece to fabric."
  },
  {
    "id": 33051,
    "title": "Falcon 9 launches upgraded Cygnus cargo spacecraft to ISS",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/falcon-9-launches-upgraded-cygnus-cargo-spacecraft-to-iss/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/f9-ng23.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA Falcon 9 launched an upgraded version of a Cygnus cargo spacecraft to the International Space Station Sept. 14.\nThe post Falcon 9 launches upgraded Cygnus cargo spacecraft to ISS appeared first on SpaceNews.",
    "published_at": "2025-09-15T04:39:55Z",
    "updated_at": "2025-09-15T04:50:21.083291Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33052,
    "title": "CSO Co., Ltd. — Redefining Earth Observation with Cutting-Edge Camera Systems for Small Satellites",
    "authors": [
      {
        "name": "CSO Co., Ltd.",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/cso-co-ltd-redefining-earth-observation-with-cutting-edge-camera-systems-for-small-satellites/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Screenshot-2025-09-12-at-7.38.56-AM.png?fit=1024%2C554&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nEarth observation is no longer just about capturing images from orbit — it is about delivering insights that shape how societies respond to global challenges. CSO Co., Ltd., a subsidiary […]\nThe post CSO Co., Ltd. — Redefining Earth Observation with Cutting-Edge Camera Systems for Small Satellites appeared first on SpaceNews.",
    "published_at": "2025-09-15T02:51:00Z",
    "updated_at": "2025-09-15T05:50:19.714768Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33050,
    "title": "Northrop Grumman’s 1st Cygnus XL spacecraft launches on cargo run to the space station",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/15/northrop-grummans-1st-cygnus-xl-spacecraft-launches-on-cargo-run-to-the-space-station/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/09/20250914_NG-23_liftoff_JP1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX launched the vehicle on a Falcon 9 rocket from Cape Canaveral Space Force Station on Sunday, Sept. 14, at 6:11 p.m. EDT (2211 UTC). It’s scheduled to be berthed to the ISS by NASA astronaut Jonny Kim on Wednesday, Sept. 17. ",
    "published_at": "2025-09-15T00:47:37Z",
    "updated_at": "2025-09-15T00:50:18.183849Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Northrop Grumman’s first Cygnus XL vehicle was jettisoned on its way to the International Space Station following a pre-sunset launch from Cape Canaveral Sunday evening. The cargo vehicle is scheduled to be berthed to the ISS by NASA astronaut Jonny Kim on Wednesday, Sept. 17. This was just the fourth flight for this booster with the tail number B1094. A follow up experiment will look at how to manage a zero boil off situation for propellant storage tanks in low Earth orbit. Bristol Myers Squibb will also be conducting a crystal growth experiment using Redwire Space’s Pharmaceutical In-space Laboratory. The launch of the NG-23 mission came months earlier than was originally scheduled. The Starlink 6-67 mission will fly on a south-easterly trajectory once it departs from pad 40 at Cape Canaveral Space Force Station. Liftoff is targeting 12:38 p.m. EDT (1638 UTC) on May 14. The three newest residents of the International Space Station sped into orbit Wednesday aboard a Soyuz launcher."
  },
  {
    "id": 33049,
    "title": "NASA Science, Cargo Launches Aboard Northrop Grumman CRS-23",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-science-cargo-launches-aboard-northrop-grumman-crs-23/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/northrop-grumman-crs-23-launch.png",
    "news_site": "NASA",
    "summary": "NASA is sending more science, technology demonstrations, and crew supplies to the International Space Station following the successful launch of the agency’s Northrop Grumman Commercial Resupply Services 23 mission, or Northrop Grumman CRS-23. The company’s Cygnus XL spacecraft, carrying more than 11,000 pounds of cargo to the orbiting laboratory, lifted off at 6:11 p.m. EDT […]",
    "published_at": "2025-09-14T23:59:51Z",
    "updated_at": "2025-09-15T00:00:11.639477Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Northrop Grumman Cygnus XL is scheduled to be captured at 6:35 a.m. on Wednesday, Sept. 17. The spacecraft will be installed to the Unity module’s Earth-facing port for cargo unloading. The resupply mission is carrying dozens of research experiments."
  },
  {
    "id": 33048,
    "title": "Mechele Elliott Safeguards Agency Information Systems at Johnson",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/mechele-elliott-safeguards-agency-information-systems-at-johnson/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/1000002963.jpg",
    "news_site": "NASA",
    "summary": "As an IT security administrator at NASA’s Johnson Space Center in Houston, Mechele Elliott protects the information systems that support astronaut health and mission readiness. The encouragement of a family friend set her on this path, leading to a rewarding and somewhat unexpected career in human spaceflight. “While I was caring for my son during […]",
    "published_at": "2025-09-14T21:00:00Z",
    "updated_at": "2025-09-14T21:10:12.586951Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Mechele Elliott is an IT security administrator at NASA’s Johnson Space Center in Houston. She protects the information systems that support astronaut health and mission readiness. Outside of work, Elliott enjoys several hobbies that help her relax and maintain balance. She began painting at a young age and continues to find calm through her art."
  },
  {
    "id": 33047,
    "title": "Vast backs new NASA commercial space station strategy",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/vast-backs-new-nasa-commercial-space-station-strategy/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/04/haven1-dragon.jpg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nWASHINGTON — The chief executive of commercial space station developer Vast says he supports NASA’s revised approach to supporting development of such stations, calling it the best way to avoid a gap in U.S. human presence in orbit. Speaking Sept. 11 at the Global Aerospace Summit, Max Haot endorsed NASA’s new strategy, announced more than […]\nThe post Vast backs new NASA commercial space station strategy appeared first on SpaceNews.",
    "published_at": "2025-09-14T20:30:39Z",
    "updated_at": "2025-09-14T20:40:22.787493Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33046,
    "title": "What’s Happening in Space Policy September 14-20, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-september-14-20-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/cygnus-xl-300x204.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of September 14-20, 2025 and any insight we can offer about them. The House and Senate are in session […]",
    "published_at": "2025-09-14T20:18:23Z",
    "updated_at": "2025-09-14T20:20:15.519031Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpacePolicyOnline.com's list of space policy events for the week of September 14-20, 2025. The week begins with the launch of Northrop Grumman’s next Cygnus cargo ship, NG-23, to the International Space Station at 6:11 pm ET. The House and Senate are in session this week. Nomination of Neil Jacobs to be NOAA Administrator sent back to committee. Senate Majority Leader John Thune concerned Democrats could object to the manner in which the vote was taken. Plans are underway to begin work on a Continuing Resolution to keep all of the government open when FY2026 begins on October 1."
  },
  {
    "id": 33045,
    "title": "Live coverage: SpaceX to launch new, improved Northrop Grumman Cygnus XL resupply ship to the space station",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/14/live-coverage-spacex-to-launch-new-improved-northrop-grumman-cygnus-xl-resupply-ship-to-the-space-station/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/09/20250913_Cygnus_XL_unboxing.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The new Cygnus XL spacecraft will deliver more than 11,000 pounds (4,990 kg) of food, science supplies and cargo to the International Space Station. Liftoff from pad 40 at Cape Canaveral Space Force Station is scheduled for 6:11 a.m. EDT (2211 UTC).",
    "published_at": "2025-09-14T13:00:19Z",
    "updated_at": "2025-09-14T13:53:34.159063Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "3bfed6d5-d65e-4133-b51a-b664bbd9d006",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The next cargo resupply mission to the International Space Station is launching Sunday and will feature a new iteration of the Cygnus spacecraft from Northrop Grumman. SpaceX is scheduled to launch the cargo craft atop a Falcon 9 rocket from pad 40 at Cape Canaveral Space Force Station at 6:11 a.m. EDT (2211 UTC) It will be the fourth flight of the Falcon 9 first stage booster, which entered service in April this year."
  },
  {
    "id": 33044,
    "title": "SpaceX set to launch Cygnus XL to ISS on CRS NG-23 mission",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/crs-ng-23/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/IMG_1665.png",
    "news_site": "NASASpaceflight",
    "summary": "Just days after the Progress MS-32 cargo ship launched to the International Space Station from…\r\nThe post SpaceX set to launch Cygnus XL to ISS on CRS NG-23 mission appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-14T12:37:37Z",
    "updated_at": "2025-09-14T13:53:28.889199Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "3bfed6d5-d65e-4133-b51a-b664bbd9d006",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The Cygnus XL cargo ship, named S.S. William C. “Willie” McCool after the pilot of Columbia on STS-107, is scheduled to launch atop a Falcon 9 on the NG-23 mission on Sunday, Sept. 14. Falcon 9 will liftoff from Space Launch Complex 40 (SLC-40) at the Cape Canaveral Space Force Station (CCSFS) in Florida. The launch window is instantaneous, as is typically the case with many flights to the International Space Station (ISS) The Cygnus XL cargo ship will rendezvous with the ISS on Wednesday, Sept. 17. The spacecraft will be berthed to the Station’s Unity node module nadir port. The berthing process differs from docking in that the spacecraft do not connect to the station under their own power. Once unberthed and released, the spacecraft will deorbit and perform a destructive reentry. NG-23 is the first Cygnus spacecraft to fly since the NG-21 mission in August 2024. The next cargo flight to the Station after NG-23 mission will be the first launch of Japan’s HTV-X cargo ship, which is currently scheduled for Oct. 21. The damaged NG-22 spacecraft will be manifested on a future mission."
  },
  {
    "id": 33043,
    "title": "NASA reestablishes contact with one of two TRACERS satellites",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-reestablishes-contact-with-one-of-two-tracers-satellites/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/07/tracers.jpg?fit=1024%2C732&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA has restored contact with one of a pair of space science satellites that ran into problems shortly after its July launch.\nThe post NASA reestablishes contact with one of two TRACERS satellites appeared first on SpaceNews.",
    "published_at": "2025-09-13T20:06:52Z",
    "updated_at": "2025-09-13T20:10:28.228053Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33042,
    "title": "Golden Dome’s cost: anywhere from billions to trillions, depending on design",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/golden-domes-cost-anywhere-from-billions-to-trillions-depending-on-design/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Screenshot-2025-06-04-at-1.34.59-PM.png?fit=1024%2C601&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA new report by Todd Harrison of the American Enterprise Institute estimates Golden Dome could cost from $252 billion to $3.6 trillion over 20 years, based on scope and capabilities\nThe post Golden Dome’s cost: anywhere from billions to trillions, depending on design appeared first on SpaceNews.",
    "published_at": "2025-09-13T15:14:37Z",
    "updated_at": "2025-09-13T15:20:24.500141Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33041,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/13/live-coverage-spacex-to-launch-24-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb-3/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small.jpg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX is targeting a liftoff from pad 4 East at 8:41 a.m. PDT (11:41 a.m. EDT / 1541 UTC). ",
    "published_at": "2025-09-13T13:06:12Z",
    "updated_at": "2025-09-13T13:10:18.877159Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Starlink 17-10 mission on Saturday will add another 24 broadband internet satellites to the low Earth orbit constellation. This will be SpaceX’s 42nd launch from California this year. The launch of another 60 Starlink internet spacecraft from Cape Canaveral Sunday thrust SpaceX past a major milestone in rocket reuse: the 10th successful flight of a Falcon 9 booster."
  },
  {
    "id": 33040,
    "title": "60 years after Gemini, newly processed images reveal incredible details",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/60-years-after-gemini-newly-processed-images-reveal-incredible-details/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/01-Aldrin-Selfie-Before-After_NASA_ASU_Andy-Saunders.jpg",
    "news_site": "Arstechnica",
    "summary": "\"It's that level of risk that they were taking. I think that's what really hit home.\"",
    "published_at": "2025-09-13T11:15:47Z",
    "updated_at": "2025-09-13T11:20:05.331388Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Gemini & Mercury Remastered is a collection of 300 photographs from NASA's Mercury and Gemini programs during the 1960s. Andy Saunders meticulously restored the images and then deeply researched their background to more fully tell the stories behind them. Saunders: \"It's really the photographs that will just forever symbolize and document at the beginning of our expansion out into the cosmos\" With Apollo, they took about 35,000 photographs, with Mercury and Gemini, there were about 5,000. I went through every frame of film that was captured from launch to splashdown on every mission. The final 300 that are in the book are those that are either aesthetically stunning, or they're a big transformation. Saunders has been working on the book since the middle of 2019, nonstop. There are only about 100 million photos from the Space Shuttle era. The process I used for this, on the low-quality 16 mm film, was to stack hundreds of frames. To see this level of detail, to me, it's just like a portrait of courage."
  },
  {
    "id": 33039,
    "title": "Maxar executive renews warning that budget cuts threaten commercial remote sensing industry",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/maxar-executive-renews-warning-that-budget-cuts-threaten-commercial-remote-sensing-industry/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/G0luXUBWsAA1-5q.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nMaxar executive Susanne Hake pressed the case that commercial firms can deliver faster and for less cost than bespoke government satellites, but need predictable funding and contracts to keep investing\nThe post Maxar executive renews warning that budget cuts threaten commercial remote sensing industry appeared first on SpaceNews.",
    "published_at": "2025-09-12T23:24:05Z",
    "updated_at": "2025-09-12T23:30:21.019812Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33038,
    "title": "Curiosity Blog, Sols 4649-4654: Ridges, Hollows and Nodules, Oh My",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4649-4654-ridges-hollows-and-nodules-oh-my/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/september/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04650_opgs_edr_ncam_NLB_810299729EDR_F1182304NCAM00354M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Lucy Thompson, Planetary Scientist and APXS Team Member, University of New Brunswick, Canada Earth planning date: Friday, Sept. 5, 2025 Curiosity is in the midst of the boxwork campaign, trying to decipher why we see such pronounced ridges and hollows in this area of Mount Sharp. When this terrain was first identified from […]",
    "published_at": "2025-09-12T22:57:37Z",
    "updated_at": "2025-09-12T23:10:07.654343Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Curiosity is in the midst of the boxwork campaign, trying to decipher why we see such pronounced ridges and hollows in this area of Mount Sharp. The focus of our activities this week was to document the transition from smoother bedrock atop a boxwork ridge to more nodular bedrock associated with the edge of a shallow hollow."
  },
  {
    "id": 33037,
    "title": "China completes second hot-fire test for new moon rocket, including engine restarts",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-completes-second-hot-fire-test-for-new-moon-rocket-including-engine-restarts/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/CZ10-short-tank-static-fire2-Wenchang-12sept2025-CASC.jpg?fit=1024%2C770&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nChina conducted a rocket stage hot fire test Friday in the latest step in the country’s plans to land astronauts on the moon.\nThe post China completes second hot-fire test for new moon rocket, including engine restarts appeared first on SpaceNews.",
    "published_at": "2025-09-12T22:06:07Z",
    "updated_at": "2025-09-12T22:10:20.509890Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33036,
    "title": "Flight 11 closing in as Booster 15 completes testing, Pad 1 awaits Ship 38",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/flight-11-booster-15-ship-38/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/Booster-15-Rolling-Back-After-its-Static-Fire-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "With Booster 15-2’s static fire out of the way and crews setting up Pad 1(A)…\nThe post Flight 11 closing in as Booster 15 completes testing, Pad 1 awaits Ship 38 appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-12T21:07:44Z",
    "updated_at": "2025-09-12T21:10:21.300434Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX appears poised to test Ship 38 rather than later. The last piece of testing before Flight 11 is Ship 38’s static fire on Pad 1(A) This will be the last time a booster receives one for flight. There is also confirmation on the flight plans for Flight 11 and at least 12 other flights. SpaceX executive Bill Gerstenmaier gave a talk and answered questions at the American Astronautical Society’s Glenn Space Technology Symposium in Cleveland. With this next flight, SpaceX aims to test measures to prevent burn-through similar to what was observed on Flight 10. For Flight 11, there are no regulatory holdups as long as SpaceX aligns with current suborbital flight. SpaceX confirms that Block 3 won’t fly until next year, which was expected, given the current state of all the components. Flight 11 will be suborbital as well as Flight 12 to test the new designs. If that goes well, they may proceed to orbit and attempt a catch as early as Flight 13."
  },
  {
    "id": 33035,
    "title": "NASA Awards Third Glenn Facility and Engineering Services Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-third-glenn-facility-and-engineering-services-contract/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
    "news_site": "NASA",
    "summary": "NASA has selected Troy Sierra JV, LLC of Huntsville, Alabama, to provide engineering, research, and scientific support at the agency’s Glenn Research Center in Cleveland.   The Test Facility Operations, Maintenance, and Engineering Services III contract is a cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract with a maximum potential value of approximately $388.3 million. The performance period begins Jan. […]",
    "published_at": "2025-09-12T20:20:42Z",
    "updated_at": "2025-09-12T20:30:06.564038Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA has selected Troy Sierra JV, LLC of Huntsville, Alabama, to provide engineering, research, and scientific support. The Test Facility Operations, Maintenance, and Engineering Services III contract is a maximum potential value of approximately $388.3 million. The performance period begins Jan. 1, 2026, with a three-year base period followed by a two-year option."
  },
  {
    "id": 33034,
    "title": "NASA’s X-59 Moves Toward First Flight at Speed of Safety",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasas-x-59-moves-toward-first-flight-at-speed-of-safety/",
    "image_url": "https://images-assets.nasa.gov/image/P25-056-02/P25-056-02~large.jpg",
    "news_site": "NASA",
    "summary": "As NASA’s one-of-a-kind X-59 quiet supersonic research aircraft approaches first flight, its team is mapping every step from taxi and takeoff to cruising and landing – and their decision-making is guided by safety. First flight will be a lower-altitude loop at about 240 mph to check system integration, kicking off a phase of flight testing […]",
    "published_at": "2025-09-12T18:37:32Z",
    "updated_at": "2025-09-12T18:40:15.136780Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "First flight will be a lower-altitude loop at about 240 mph to check system integration. During subsequent test flights, the X-59 will go higher and faster, eventually exceeding the speed of sound. The aircraft is designed to fly supersonic while generating a quiet thump rather than a loud sonic boom. The X-59's life support system is designed to deliver oxygen through the pilot’s mask to compensate for the decreased atmospheric pressure at 55,000 feet. In order to withstand high-altitude flight, Larson will also wear a counter-pressure garment, or g-suit, similar to what fighter pilots wear. All these systems form a network of safety, adding confidence to the pilot and engineers as they approach the next milestone – first flight."
  },
  {
    "id": 33033,
    "title": "NASA, War Department Partnership Tests Boundaries of Autonomous Drone Operations",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/ames/nasa-war-department-partnership-tests-boundaries-of-autonomous-drone-operations/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/acd25-0074-007.jpg",
    "news_site": "NASA",
    "summary": "Through an ongoing collaboration, NASA and the Department of War are working to advance the future of modern drones to support long distance cargo transportation that could increase efficiency, reduce human workload, and enhance safety.   Researchers from NASA’s Ames Research Center in California’s Silicon Valley recently participated in a live flight demonstration showcasing how […]",
    "published_at": "2025-09-12T18:22:46Z",
    "updated_at": "2025-09-12T18:30:09.845765Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and the Department of War are working to advance the future of modern drones. Drones could support long distance cargo transportation that could increase efficiency, reduce human workload, and enhance safety. Autonomous and semi-autonomous drones could potentially support a broad range of tasks for commercial, military, and private users."
  }
]