[
  {
    "id": 33407,
    "title": "HEO looks to expand satellite imaging beyond low Earth orbit",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/heo-looks-to-expand-satellite-imaging-beyond-low-earth-orbit/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/heo-tiangong.jpeg?fit=1024%2C649&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nAn Australian company that is a leader in taking images of spacecraft in low Earth orbit is seeking to widen its aperture to monitor higher orbits, and even beyond.\nThe post HEO looks to expand satellite imaging beyond low Earth orbit appeared first on SpaceNews.",
    "published_at": "2025-10-03T01:35:24Z",
    "updated_at": "2025-10-03T01:40:32.592644Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Australian company is a leader in taking images of spacecraft in low Earth orbit. It is seeking to widen its aperture to monitor higher orbits, and even beyond. HEO has conducted 4,000 “missions,” which is what the company calls a flyby by an imaging satellite. HEO estimates that at least 30 asteroids more than 19 meters across will pass ‘really close’ to the GEO belt. Such imagery could be used for scientific purposes or even resource extraction. “This is an opportunity that is too good to miss,” HEO says."
  },
  {
    "id": 33406,
    "title": "The spreadsheet behind the Golden Dome sticker shock",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/the-spreadsheet-behind-the-golden-dome-sticker-shock/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/Western-US.jpg.webp?fit=1024%2C476&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nTodd Harrison demonstrates the ‘Defense Futures Simulator’ that calculated eye-watering missile defense costs — and invites critics to prove him wrong with their own numbers.\nThe post The spreadsheet behind the Golden Dome sticker shock appeared first on SpaceNews.",
    "published_at": "2025-10-02T21:54:10Z",
    "updated_at": "2025-10-02T22:00:26.170583Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Trump in May said it would cost $175 billion over three years. Congressional Budget Office projected between $161 billion and $542 billion over two decades. Todd Harrison’s “robust all-threat defense’ scenario came in at $3.6 trillion. The cost of Golden Dome should not exceed a quarter of the U.S. defense budget. Harrison pinpointed the Trump administration’s focus on boost-phase intercept as a key reason costs balloon to such heights. If the goal shifted to midcourse defense, interceptors would have more time to fire and coast through space to reach their targets."
  },
  {
    "id": 33405,
    "title": "At IAC, global space cooperation meets American space dominance",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/at-iac-global-space-cooperation-meets-american-space-dominance/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/duffy-iac25.jpeg?fit=1024%2C669&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nAs the global space community gathered to discuss exploration and cooperation, one theme emerged: how countries are adapting to changes in policies, budgets and leadership at NASA.\nThe post At IAC, global space cooperation meets American space dominance appeared first on SpaceNews.",
    "published_at": "2025-10-02T21:31:54Z",
    "updated_at": "2025-10-02T21:40:19.650939Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The International Astronautical Congress was held in Sydney this week. It was the first opportunity for leaders of space agencies to meet with NASA's acting administrator. NASA and Sean Duffy emphasized U.S. leadership in space, almost aggressively. Many space agencies have been scrambling to adjust to changes at NASA. Australia signed a framework agreement with the United States to deepen cooperation in space and aeronautics. At the same time, the Australian government announced it would begin negotiations with ESA on a cooperative agreement. That could allow Australian companies and organizations to participate directly in ESA programs, giving Australia a status similar to Canada's within the agency."
  },
  {
    "id": 33404,
    "title": "Wide-field surveys versus precise infrared observations: how Rubin compares to JWST",
    "authors": [
      {
        "name": "Sean Yoder",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/10/rubin-vs-jwst/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/10/webb-rubin-lead.png",
    "news_site": "NASASpaceflight",
    "summary": "Earlier this year, the new Vera C. Rubin Observatory in Chile officially began scientific operations,…\nThe post Wide-field surveys versus precise infrared observations: how Rubin compares to JWST appeared first on NASASpaceFlight.com.",
    "published_at": "2025-10-02T20:35:05Z",
    "updated_at": "2025-10-02T20:40:14.397076Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Earlier this year, the new Vera C. Rubin Observatory in Chile officially began scientific operations, becoming the world’s largest and most advanced ground-based telescope. Meanwhile, situated at the L2 Lagrange point is the James Webb Space Telescope. Both telescopes represent different technological solutions to mapping and analyzing the cosmos. Together they are poised to reveal untold information about our universe. The Rubin Science Platform (RSP) provides cloud-based data access, eliminating the need for researchers to download massive datasets locally. Nightly operations generate approximately 20 terabytes of data, processed through automated systems. Real-time processing capabilities can generate up to 10 million alerts per night when changes to existing objects or the introduction of new objects are detected. The Rubin Observatory’s survey approach generates approximately 7.3 petabytes of data annually. JWST produces roughly 350 times less data than Rubin, but focuses on precision observations. Rubin functions as a wide-field reconnaissance system, systematically cataloging approximately 20 billion galaxies, 17 billion stars, and millions of asteroids across the southern sky. NASA's next round of space flights will take place between September 30, 2025 and April 11, 2025. The space agency's next series of flights will also take place in 2023, 2024 and 2025. NASA's next fleet of spaceflights will be the largest since the space shuttle program began in 1986."
  },
  {
    "id": 33403,
    "title": "Live coverage: SpaceX to launch 3rd consecutive Falcon 9 rocket from Vandenberg SFB, uninterrupted by a Cape mission",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/10/02/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/03/20240318-Starlink-Feature-Image.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 11-39 mission is scheduled to liftoff from pad 4E at Vandenberg Space Force Base at 6:21 a.m. PDT (9:21 a.m. EDT / 1321 UTC). The Falcon 9 rocket will fly on a south-easterly trajectory. ",
    "published_at": "2025-10-02T17:40:57Z",
    "updated_at": "2025-10-02T17:50:21.342045Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33402,
    "title": "DLR Prepares to Launch Small Reusable Space Transportation Demonstrator",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/dlr-prepares-to-launch-small-reusable-space-transportation-demonstrator/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/10/DLR-Prepares-to-Launch-Small-Reusable-Space-Transportation-Demonstrator.webp",
    "news_site": "European Spaceflight",
    "summary": "The German Aerospace Center (DLR) is preparing to launch its ATHEAt reusable space transportation demonstrator mission from Andøya Space in Norway. Initiated in January 2022, the Advanced Technologies for High Energetic Atmospheric Flight of Launcher Stages (ATHEAt) demonstrator programme is focused on testing key technologies for future reusable space vehicles, with a particular emphasis on […]\nThe post DLR Prepares to Launch Small Reusable Space Transportation Demonstrator appeared first on European Spaceflight.",
    "published_at": "2025-10-02T14:42:23Z",
    "updated_at": "2025-10-02T14:50:10.755898Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33401,
    "title": "Space security, threats and rapid innovation",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/space-security-threats-and-rapid-innovation/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/072525-space-minds-podcast-ISS-1920-1080-1.png?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIn this week’s episode of Space Minds, host David Aireosto speaks with Steve Kitay— former Deputy Assistant Secretary of Defense for Space Policy, former head of Microsoft’s space initiatives, and now Senior Vice President for Space Defense at True Anomaly.\nThe post Space security, threats and rapid innovation appeared first on SpaceNews.",
    "published_at": "2025-10-02T14:21:08Z",
    "updated_at": "2025-10-02T14:30:26.914473Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33399,
    "title": "China’s ‘near space’ legal warfare",
    "authors": [
      {
        "name": "Todd Pennington and Emmy Kanarowski",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/chinas-near-space-legal-warfare/",
    "image_url": "https://spacenews.com/wp-content/uploads/2025/10/G2ADD2LZBZFCTMIAZ4EVCJOE7Y.avif",
    "news_site": "SpaceNews",
    "summary": "\nIn February 2023, a United States Air Force fighter jet shot down a Chinese high-altitude balloon flying at about 60,000-65,000 feet (18-20 km) altitude in sovereign U.S. airspace. After the event, some commentary suggested that the incident raised questions about the supposedly ambiguous or unsettled legal status of high-altitude airspace, sometimes referred to as “near […]\nThe post China’s ‘near space’ legal warfare appeared first on SpaceNews.",
    "published_at": "2025-10-02T13:00:00Z",
    "updated_at": "2025-10-02T13:10:20.812152Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33398,
    "title": "Fly over Xanthe Terra with Mars Express",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/10/Fly_over_Xanthe_Terra_with_Mars_Express",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/10/fly_over_xanthe_terra_with_mars_express/26897957-1-eng-GB/Fly_over_Xanthe_Terra_with_Mars_Express_card_full.png",
    "news_site": "ESA",
    "summary": "ESA’s Mars Express takes us on another mesmerising flight over curving channels carved by water, islands that have resisted erosion, and a maze of hilly terrain.",
    "published_at": "2025-10-02T13:00:00Z",
    "updated_at": "2025-10-02T14:02:17.181402Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "db62cfa1-4d10-41d3-b25f-a58e138ce202",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33397,
    "title": "How America fell behind China in the lunar space race—and how it can catch back up",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/10/how-america-fell-behind-china-in-the-lunar-space-race-and-how-it-can-catch-back-up/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2020/09/46372736004_987b46af12_k.jpg",
    "news_site": "Arstechnica",
    "summary": "Thanks to some recent reporting, we've found a potential solution to the Artemis blues.",
    "published_at": "2025-10-02T11:30:59Z",
    "updated_at": "2025-10-02T11:40:04.502006Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's interim administrator, Sean Duffy, has been giving interviews and speeches around the world. Many people within the space industry, and even at NASA, acknowledge that the US space agency appears to be holding a losing hand. The purpose of this article is to articulate how NASA ended up falling behind China, and how the Western world could realistically retake the lead. NASA lost a decade, spending billions of dollars a year developing \"exploration\" systems for humans. The program's only achievement was to enrich the legacy space contractors. The new leader of NASA, Jim Bridenstine, managed to ditch the Journey to Mars and establish a lunar program. SpaceX's Starship program is not ready to land humans on the Moon. The company's goal is to send humans to Mars. The complexity of the mission will require multiple launches from Earth. Blue Origin's Mark 1 lander could be the answer, but it's not rated for humans. Blue Origin has a contract with NASA to develop the Mark 2 lander. The Mark 2 will not be ready until sometime in the 2030s. A modified version of the Mark 1 lander could be part of an architecture to land humans on the Moon this decade. It would involve \"multiple\" landers to carry crew down to the lunar surface."
  },
  {
    "id": 33396,
    "title": "Preparations on track for second New Glenn launch",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/preparations-on-track-for-second-new-glenn-launch/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/01/NG1-Liftoff-Horizontal.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nPreparations for the second launch of Blue Origin’s New Glenn rocket, carrying a NASA Mars mission, remain on track for liftoff in the next few weeks.\nThe post Preparations on track for second New Glenn launch appeared first on SpaceNews.",
    "published_at": "2025-10-02T11:12:34Z",
    "updated_at": "2025-10-02T11:20:16.733299Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The second launch of Blue Origin’s New Glenn rocket is on track for liftoff in the next few weeks. The rocket itself is also in advanced stages of preparation. The twin ESCAPADE spacecraft arrived in Florida in mid-September and will be fueled in the coming weeks. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By creating a SpaceNews.com account, you acknowledge that you have read our privacy policy and agree to our terms of terms and conditions. Select an option to continue:"
  },
  {
    "id": 33395,
    "title": "Will Pentagon procurement reforms really stick this time?",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/will-pentagon-procurement-reforms-really-stick-this-time/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/G0WRW6jbAAEIz4P-scaled.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA mix of executive orders, new contracting approaches and closer ties between defense leaders and investors has some experts believing this latest reform drive may be different from the past.\nThe post Will Pentagon procurement reforms really stick this time? appeared first on SpaceNews.",
    "published_at": "2025-10-02T11:00:00Z",
    "updated_at": "2025-10-02T11:10:18.523388Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "U.S. Space Force procurement chief tours Blue Origin and Vast Space. The outreach to the private sector comes as the Pentagon is scrambling to overhaul its procurement system. President Donald Trump signed an executive order pressing the department to expand its use of commercial technology. Congress is weighing companion legislation that would cut red tape for defense programs. The Space Force has a $40 billion fiscal 2026 request fueled by the Golden Dome missile-defense program. Instead of commissioning a handful of bespoke satellites, the Space Force plans to buy fleets of smaller spacecraft from multiple vendors. The logic is redundancy. If one satellite is disabled in orbit, dozens more can pick up the slack. Space station developer Vast believes commercial infrastructure could one day provide the backbone for a U.S. military presence in space. The Space Force’s plans for rapid innovation hinge on an industrial base that is both financially sound and broad enough to support those aspirations. The lower tiers of the supply chain remain fragile, Teague noted. The challenge will be sustaining momentum. If Congress waters down reform bills or if the Pentagon reverts to its cautious habits, the window could close. Purdy is pressing his officers to get out of the office, into factories and onto venture capital pitch decks. “The Space Force is creating massive opportunities for companies,” Teague says."
  },
  {
    "id": 33394,
    "title": "University of Western Australia unveils optical ground network",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/university-of-western-australia-unveils-optical-ground-network/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_across_australia_diagram_tn2_-_v30.jpg?fit=879%2C412&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – The University of Western Australia (UWA) announced the completion Oct. 2 of TeraNet, which it calls “the first operational optical ground station network in the Southern Hemisphere.” “TeraNet demonstrates the innovation and impact that results from investing in science and technology,” Enrico Palermo, Australian Space Agency head, said in a statement released […]\nThe post University of Western Australia unveils optical ground network appeared first on SpaceNews.",
    "published_at": "2025-10-02T07:02:13Z",
    "updated_at": "2025-10-02T07:10:21.416286Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "TeraNet is comprised of three interconnected optical ground stations. It is the first operational optical ground station network in the Southern Hemisphere. TeraNet will enhance Australia’s reputation as a trusted and capable partner in the global space sector. The network will enhance our ability to connect with spacecraft and future lunar missions."
  },
  {
    "id": 33393,
    "title": "The Exploration Company still studying Mission Possible reentry",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/the-exploration-company-still-studying-mission-possible-reentry/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/06/t14-upperstack.jpeg?fit=1024%2C649&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe Exploration Company is still studying what happened in the final phases of a test flight three months ago that resulted in the loss of the spacecraft.\nThe post The Exploration Company still studying Mission Possible reentry appeared first on SpaceNews.",
    "published_at": "2025-10-02T03:46:03Z",
    "updated_at": "2025-10-02T03:50:27.912997Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Exploration Company launched Mission Possible, a test of a reentry capsule. The 1,600-kilogram spacecraft survived reentry, but contact was lost. The company is moving ahead with its full-scale Nyx cargo vehicle. Nyx is slated for a demonstration mission to the International Space Station in 2028. Get unlimited access to SpaceNews.com for as low as $5 per week. You’ll also receive our weekly SpaceNews This Week newsletter every Friday. Opt-out at any time. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options."
  },
  {
    "id": 33392,
    "title": "China and U.S. take initial steps toward space-traffic coordination",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-and-u-s-take-initial-steps-toward-space-traffic-coordination/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/03/CZ8-Qianfan-group6-HICAL-11march2025-CASC.jpg?fit=1024%2C653&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – Yesterday, the China National Space Agency (CNSA) contacted NASA about a potential on-orbit collision. The CNSA message read, “We would like to recommend you hold still and we’ll do the maneuver,” Alvin Drew, NASA Space Sustainability director and former astronaut, said Oct. 2 at a panel on space sustainability at the International […]\nThe post China and U.S. take initial steps toward space-traffic coordination appeared first on SpaceNews.",
    "published_at": "2025-10-02T03:38:47Z",
    "updated_at": "2025-10-02T03:40:21.484356Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "After decades of operating satellites alongside one another with very little communication, China is beginning to share information with western space powers. Messages also are starting to be shared between Chinese and western commercial satellite operators. Growing number of megaconstellations destined for low-Earth orbit will require “real-time information sharing across all of our agencies,” NASA says. Use the weekly Newsquiz to test your knowledge of stories you saw on SpaceNews.com. Use the Daily Discussion to help students understand today's featured news stories. The Daily Discussion also offers the chance to win a $200 gift card. Use this week's Newsquizz to testyour knowledge of events you saw in the news. Back to the Mail Online home."
  },
  {
    "id": 33391,
    "title": "Meet the Arc spacecraft: it aims to deliver cargo anywhere in the world in an hour",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/10/meet-the-arc-spacecraft-it-aims-to-deliver-cargo-anywhere-in-the-world-in-an-hour/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/Arc-On-Orbit-1.jpg",
    "news_site": "Arstechnica",
    "summary": "\"The key discriminator is, does this make a difference in the moment it's needed?\"",
    "published_at": "2025-10-02T02:00:27Z",
    "updated_at": "2025-10-02T02:10:06.346300Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Inversion, a Los Angeles-based spacecraft company, unveiled its new \"on demand\" delivery vehicle Wednesday. The company said it is building the Arc spacecraft to provide a capability to the US military to deliver as much as 500 pounds (225 kg) of supplies almost anywhere in the world, almost instantaneously. Inversion was founded in early 2021 by two former students of Boston University. Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information. You don’t need to know everything, only what’s important."
  },
  {
    "id": 33390,
    "title": "ExLabs wins Space Force contract for reconfigurable space platform",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/exlabs-wins-space-force-contract-for-reconfigurable-space-platform/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_pressrelease-notext.png?fit=879%2C502&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – The U.S. Space Force has awarded a $1.9 million contract to Southern California startups ExLabs for development of its reconfigurable spacecraft platform. Under the Direct-to-Phase 2 Small Business Innovation Research contract from the Space Force Space Systems Command, ExLabs will develop SERVSAM, “a heavy-class, reconfigurable spacecraft designed for flexible mission profiles in […]\nThe post ExLabs wins Space Force contract for reconfigurable space platform appeared first on SpaceNews.",
    "published_at": "2025-10-01T23:48:07Z",
    "updated_at": "2025-10-01T23:50:18.426176Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33389,
    "title": "States have an obligation to warn satellite operators of cyber threats — IAC paper",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/states-have-an-obligation-to-warn-satellite-operators-of-cyber-threats-iac-paper/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_maxar_imagery_showed_an_armored_convoy_approaching_kyiv_in_february_2022_.jpg?fit=879%2C476&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – States have a responsibility to inform citizens, including commercial spacecraft operators, of cyber threats, Diane Howard, former commercial space policy director for the White House National Space Council, said at the International Astronautical Congress here. “States do have a duty to warn, to share credible threat intelligence proactively and to take all […]\nThe post States have an obligation to warn satellite operators of cyber threats — IAC paper appeared first on SpaceNews.",
    "published_at": "2025-10-01T23:08:26Z",
    "updated_at": "2025-10-01T23:10:19.336323Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Diane Howard is former commercial space policy director for the White House National Space Council. Howard: States have a responsibility to inform citizens, including commercial spacecraft operators, of cyber threats. Howard’s research stemmed from her experience working in the U.S. government during the 2022 Russian invasion of Ukraine. SpaceNews.com is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Sign in by entering the code we sent to , or clicking the magic link in the email. You acknowledge that you have read our privacy policy and agree to our terms and conditions."
  },
  {
    "id": 33388,
    "title": "Starlink-compatible radios sought for Golden Dome interceptor satellite demo",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/starlink-compatible-radios-sought-for-golden-dome-interceptor-satellite-demo/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/Screenshot-2025-10-01-at-4.51.30-PM.png?fit=1024%2C306&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe planned demonstration would use radio-frequency communications terminals to establish satellite-to-satellite links between a Starlink payload and a mock space-based interceptor \nThe post Starlink-compatible radios sought for Golden Dome interceptor satellite demo appeared first on SpaceNews.",
    "published_at": "2025-10-01T22:20:50Z",
    "updated_at": "2025-10-01T22:30:28.434738Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The project is in support of Golden Dome, a missile defense shield directed by President Trump. The planned demonstration would use radio-frequency communications terminals to establish satellite-to-satellite links. The radios must operate in the L- and S-band spectrum and use Link-182, a proprietary waveform. Get unlimited access to SpaceNews.com now. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent to your email. Enter your password. Sign in to an existing account."
  },
  {
    "id": 33387,
    "title": "Private mission study a step toward offering Orion as a service",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/private-mission-study-a-step-toward-offering-orion-as-a-service/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/07/jsc2025e016291large.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nAn agreement to study a private astronaut mission using an Orion spacecraft is a step by Lockheed Martin in efforts to offer the spacecraft as a service.\nThe post Private mission study a step toward offering Orion as a service appeared first on SpaceNews.",
    "published_at": "2025-10-01T21:51:51Z",
    "updated_at": "2025-10-01T22:00:27.047419Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Lockheed Martin is studying flying a mission in Orion beyond Earth orbit to perform biomedical research. The Twin Astra mission would be modeled on NASA’s Twins Study from a decade ago. The mission concept is still in its earliest phases. Lockheed announced in July that it is studying how to offer Orion as a commercial service. The Orion service module is provided by the European Space Agency under a barter agreement with NASA. Lockheed has been talking with both ESA and Airbus Defence and Space about how they could work together under a services approach. Lockheed is also examining alternatives to the Space Launch System for flying Orion."
  },
  {
    "id": 33386,
    "title": "ViaSat-3 F2 satellite arrives in Florida ahead of late October launch",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/10/01/viasat3-f2-satellite-arrives-in-florida-ahead-of-late-october-launch/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/10/20251001_ViaSat-3_F2.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The spacecraft will launch onboard a United Launch Alliance Atlas 5 551 rocket from Cape Canaveral Space Force Station. It’s built on Boeing’s 702MP+ satellite bus. ",
    "published_at": "2025-10-01T18:44:46Z",
    "updated_at": "2025-10-01T18:50:19.759536Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The ViaSat-3 Flight 2 spacecraft arrived in Florida in the early morning hours of Tuesday. This six-ton (more than 13,000 lbs) satellite is the second in a three-vehicle series. Its planned launch in late October onboard a United Launch Alliance Atlas 5 551 rocket. Viasat said this second Ka-band satellite will more than double the bandwidth capacity. Viasat has not publicly announced which rocket will carry its ViaSat-3 F3 satellite. The spacecraft, which will serve the Asia-Pacific region, was originally scheduled to launch on an Ariane 6 rocket. Viasat recorded a reduction to the carrying value of the satellites of approximately $1.67 billion in fiscal year 2024."
  },
  {
    "id": 33385,
    "title": "What Germany’s $41B investment in space could mean for Europe",
    "authors": [
      {
        "name": "Tereza Pultarova",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/what-germanys-41b-investment-in-space-could-mean-for-europe/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/pistorius.jpg?fit=1024%2C398&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nGermany will invest 35 billion euros ($41.1 billion) into defense space technologies within the next five years — an unprecedented amount for any European country. The decision, made in response to rising tensions with Russia, has been hailed a “watershed moment” for the German and European space sector, and experts say could spur a new […]\nThe post What Germany’s $41B investment in space could mean for Europe appeared first on SpaceNews.",
    "published_at": "2025-10-01T16:50:13Z",
    "updated_at": "2025-10-01T16:50:20.932348Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Germany will invest 35 billion euros ($41.1 billion) into defense space technologies within the next five years. The decision, made in response to rising tensions with Russia, has been hailed a “watershed moment” for the German and European space sector. Experts say could spur a new era in European space cooperation. The European Union, which is not directly linked to ESA, also has its own space budget. The EU’s lengthy procurement cycle and preference for established prime contractors has been criticized by the European space small- and medium-sized enterprises and start-ups. Meyer-Brunswick said that the new German space defense budget will finally allow the newcomers their chance to grow and shine. Tereza Pultarova is a London-based science and technology journalist and video producer. She covers European space developments for SpaceNews.com. Register now to get 2 more free articles every month. You’ll also receive our weekly SpaceNews This Week newsletter every Friday."
  },
  {
    "id": 33384,
    "title": "Romanian Research Institute Qualifies Space Rider Drop Test Prototype",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/romanian-research-institute-qualifies-space-rider-drop-test-prototype/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/10/Romanian-Research-Institute-Qualifies-Space-Rider-Drop-Test-Prototype.webp",
    "news_site": "European Spaceflight",
    "summary": "Romania’s National Institute for Aerospace Research ‘Elie Carafoli’ (INCAS) has completed qualification testing of the Space Rider Descent and Landing Test Model (DLRM), marking a key milestone for the programme. In December 2021, Thales Alenia Space awarded a contract to the Italian Aerospace Research Centre (CIRA) to conduct a series of drop tests aimed at […]\nThe post Romanian Research Institute Qualifies Space Rider Drop Test Prototype appeared first on European Spaceflight.",
    "published_at": "2025-10-01T14:56:29Z",
    "updated_at": "2025-10-01T15:00:16.442147Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Romania’s National Institute for Aerospace Research ‘Elie Carafoli’ (INCAS) has completed qualification testing of the Space Rider Descent and Landing Test Model (DLRM) In December 2021, Thales Alenia Space awarded a contract to the Italian Aerospace Research Centre (CIRA) to conduct a series of drop tests aimed at validating the recovery system."
  },
  {
    "id": 33374,
    "title": "European Space Agency and Korea AeroSpace Administration embark on new cooperation",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Corporate_news/European_Space_Agency_and_Korea_AeroSpace_Administration_embark_on_new_cooperation",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/esa_and_kasa_sign_memorandum_of_understanding/26893962-1-eng-GB/ESA_and_KASA_sign_Memorandum_of_Understanding_card_full.jpg",
    "news_site": "ESA",
    "summary": "The European Space Agency and the Korea AeroSpace Administration (KASA) have announced they will work together on peaceful uses of space, starting with space weather monitoring and sharing space communications facilities.",
    "published_at": "2025-10-01T14:50:00Z",
    "updated_at": "2025-10-01T09:40:12.157660Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33382,
    "title": "How time series data is fueling the final frontier",
    "authors": [
      {
        "name": "Evan Kaplan",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/how-time-series-data-is-fueling-the-final-frontier/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/08/ingenuity.png?fit=1024%2C579&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nWhen we think of space exploration, we picture towering rockets, satellites orbiting Earth and astronaut footprints on the moon. However, behind these grand achievements lies an unsung hero: time series data. Today, as physical AI (or AI that interacts with and learns from the physical world) plays a growing role in space missions, the ability […]\nThe post How time series data is fueling the final frontier appeared first on SpaceNews.",
    "published_at": "2025-10-01T13:00:00Z",
    "updated_at": "2025-10-01T13:10:30.280544Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Time series is a record of how things change over time. In aerospace, that means temperatures, voltages, pressure, positioning and thousands of other readings streaming from sensors every second. Time series powers everything from trajectory tracking and fuel monitoring to successful docking operations. Earth observation, deep-space navigation and even unlocking discoveries on Mars all depend on physical AI that’s making decisions. Every major leap in space exploration relies on time series data. Time series has long been the quiet workhorse of aerospace. Now, with the rise of physical AI, it’s moving to the forefront. The future of space exploration depends on how well we harness it. Get unlimited access to SpaceNews.com now. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent to your email. Enter your password. Sign in to an existing account."
  },
  {
    "id": 33381,
    "title": "Advancing Europe’s quantum secure communications from space",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Connectivity_and_Secure_Communications/Advancing_Europe_s_quantum_secure_communications_from_space",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/saga_signature_1_09_2025/26895079-1-eng-GB/SAGA_signature_1_09_2025_card_full.jpg",
    "news_site": "ESA",
    "summary": "\nThe European Space Agency (ESA) has signed a €50 million contract with aerospace company Thales Alenia Space to begin the preliminary design phase of the Security And cryptoGrAphic (SAGA) mission. This agreement enables SAGA to continue to its preliminary design review, marking a relevant step towards establishing secure, space-based communications using quantum technologies.",
    "published_at": "2025-10-01T12:00:00Z",
    "updated_at": "2025-10-01T12:30:15.744838Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "ESA has signed a €50 million contract with aerospace company Thales Alenia Space to begin the preliminary design phase of the Security And cryptoGrAphic (SAGA) mission. SAGA, developed by ESA, aims to demonstrate quantum key distribution (QKD) via satellites."
  },
  {
    "id": 33379,
    "title": "Maxar retires its name, rebrands as Vantor and Lanteris",
    "authors": [
      {
        "name": "Sandra Erwin and Jason Rainbow",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/maxar-retires-its-name-rebrands-as-vantor-and-lanteris/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Forge-Real-Time-Fusion.png?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe Maxar name is disappearing from the space industry as two successor companies emerge with distinct identities: Maxar Intelligence will now operate as Vantor, and Maxar Space Systems will go by Lanteris\nThe post Maxar retires its name, rebrands as Vantor and Lanteris appeared first on SpaceNews.",
    "published_at": "2025-10-01T12:00:00Z",
    "updated_at": "2025-10-01T12:00:36.337753Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Maxar’s satellite manufacturing arm was hit hard by a global slump in commercial GEO communications satellites. Order volumes fell as operators faced excess capacity, shifting customer demands and the rise of low Earth orbit (LEO) constellations. The company shifted its focus toward government work and smaller satellites."
  },
  {
    "id": 33380,
    "title": "Sea-level monitoring satellite unboxed",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-6/Sea-level_monitoring_satellite_unboxed",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/10/sentinel-6b_ready_to_start_its_launch_campaign/26895126-1-eng-GB/Sentinel-6B_ready_to_start_its_launch_campaign_card_full.jpg",
    "news_site": "ESA",
    "summary": "Following its arrival in California a few weeks ago, the time has come for spacecraft engineers to ready the next sea-level monitoring satellite, Copernicus Sentinel-6B, for launch, which is slated for November.",
    "published_at": "2025-10-01T11:54:00Z",
    "updated_at": "2025-10-01T12:20:13.915217Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Copernicus Sentinel-6B satellite is set to launch in November. It will carry forward the legacy of the first satellite, launched in November 2020. The satellite will undergo various functional tests, solar array checks and will be fuelled for its life in orbit. The exact launch date is to be announced in the coming weeks."
  },
  {
    "id": 33383,
    "title": "ESA at IAC 2025 - highlights from Day 3",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Exhibitions/ESA_at_IAC_2025_-_highlights_from_Day_3",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/iac_2025_plenary_on_humanity_s_return_to_the_moon/26894457-1-eng-GB/IAC_2025_plenary_on_humanity_s_return_to_the_Moon_card_full.jpg",
    "news_site": "ESA",
    "summary": "The third day of the 76th International Astronautical Congress was again full of interactions between the European Space Agency and international partners.",
    "published_at": "2025-10-01T11:43:00Z",
    "updated_at": "2025-10-01T13:20:09.637913Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "New areas of cooperation between ESA and South Korea confirmed. Memorandum of Understanding underpins the broad cooperation. Canada-ESA programme provides Canadian organisations with access to European markets and fosters collaboration in science. All ESA Member States – and Canada as the only Cooperating State – will make their commitments for the coming three years during the ESA Ministerial Council in Bremen."
  },
  {
    "id": 33377,
    "title": "In their own words: The Artemis II crew on the frenetic first hours of their flight",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/10/in-their-own-words-the-artemis-ii-crew-on-the-frenetic-first-hours-of-their-flight/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/KSC-20250731-PH-RNS01_0008large.jpg",
    "news_site": "Arstechnica",
    "summary": "\"Then you go do like, the most energetic thing you've ever done in your life.\"",
    "published_at": "2025-10-01T11:30:24Z",
    "updated_at": "2025-10-01T11:40:03.853143Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33378,
    "title": "From inner to outer space",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/10/From_inner_to_outer_space",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/10/from_inner_to_outer_space/26894504-1-eng-GB/From_inner_to_outer_space_card_full.png",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-10-01T11:27:00Z",
    "updated_at": "2025-10-01T11:50:12.535603Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33376,
    "title": "Maldives plots $50 million fund for sovereign space capabilities",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/maldives-plots-50-million-fund-for-sovereign-space-capabilities/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/Maldives-launch.jpg?fit=1024%2C830&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe Maldives is looking to raise $50 million for a space agency fund that aims to be the first of its kind for an island nation, targeting sovereign infrastructure and support for other developing states facing climate and security challenges.\nThe post Maldives plots $50 million fund for sovereign space capabilities appeared first on SpaceNews.",
    "published_at": "2025-10-01T11:00:00Z",
    "updated_at": "2025-10-01T11:10:17.661379Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33375,
    "title": "What’s next for direct-to-device after SpaceX’s blockbuster spectrum deal",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/whats-next-for-direct-to-device-after-spacexs-blockbuster-spectrum-deal/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/Starlink_Satellites_Overhead-scaled.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe direct-to-device (D2D) connectivity market has been completely transformed in the space of six weeks. On Aug. 1, U.S.-based EchoStar ordered 100 satellites from Canada’s MDA Space for a planned $5 billion low Earth orbit (LEO) constellation. But that constellation was scrapped just over a month later on Sept. 8 after EchoStar sold spectrum underpinning […]\nThe post What’s next for direct-to-device after SpaceX’s blockbuster spectrum deal appeared first on SpaceNews.",
    "published_at": "2025-10-01T11:00:00Z",
    "updated_at": "2025-10-01T11:10:17.633805Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33373,
    "title": "Cassini proves complex chemistry in Enceladus ocean",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Cassini-Huygens/Cassini_proves_complex_chemistry_in_Enceladus_ocean",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2018/06/enceladus_jets_and_shadows/17568049-1-eng-GB/Enceladus_jets_and_shadows_card_full.jpg",
    "news_site": "ESA",
    "summary": "Scientists digging through data collected by the Cassini spacecraft have found new complex organic molecules spewing from Saturn’s moon Enceladus. This is a clear sign that complex chemical reactions are taking place within its underground ocean. Some of these reactions could be part of chains that lead to even more complex, potentially biologically relevant molecules.",
    "published_at": "2025-10-01T08:00:00Z",
    "updated_at": "2025-10-01T09:10:12.466033Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Scientists have found new complex organic molecules spewing from Saturn’s moon Enceladus. This is a clear sign that complex chemical reactions are taking place within its underground ocean. Some of these reactions could be part of chains that lead to even more complex, potentially biologically relevant molecules. This discovery further strengthens the case for a dedicated European Space Agency (ESA) mission to orbit and land on the moon. Discoveries from Cassini are valuable for planning a future ESA mission dedicated to Enceladus. The plan is to fly through the jets and even land on the moon's south polar terrain to collect samples. A mission that takes measurements directly from the moon’s surface, seeking out signs of life, would offer Europe a front seat in Solar System science."
  },
  {
    "id": 33372,
    "title": "Synspective purchases 10 additional Electron launches",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/synspective-purchases-10-additional-electron-launches/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/synspective-rklb-iac25.jpeg?fit=1024%2C771&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSynspective, a Japanese company developing a constellation of radar imaging satellites, has signed a deal with Rocket Lab for an additional 10 Electron launches.\nThe post Synspective purchases 10 additional Electron launches appeared first on SpaceNews.",
    "published_at": "2025-10-01T05:16:38Z",
    "updated_at": "2025-10-01T05:20:18.095526Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33371,
    "title": "Australia and UK extend Space Bridge partnership",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/australia-and-uk-extend-space-bridge-partnership/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_img_7799.jpg?fit=879%2C566&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – Australia and the United Kingdom renewed their commitment to space-related cooperation in an agreement signed Oct. 1 at the International Astronautical Congress here. Enrico Palermo, Australian Space Agency head, and Paul Bate, UK Space Agency chief executive, re-signed the Space Bridge Framework Arrangement. Space Bridge was established in 2021 to expand investment, […]\nThe post Australia and UK extend Space Bridge partnership appeared first on SpaceNews.",
    "published_at": "2025-10-01T04:32:15Z",
    "updated_at": "2025-10-01T04:40:17.921494Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33370,
    "title": "Flexell Space and NPC Spacemind Partner at IAC 2025 on Next-Generation Solar Array Development",
    "authors": [
      {
        "name": "Flexell Space",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/flexell-space-and-npc-spacemind-partner-at-iac-2025-on-next-generation-solar-array-development/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/LOGO_FLEXELLBlack.png?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSydney, Australia — September 29, 2025 – Flexell Space (CEO Taehun Ahn) announced the signing of a Memorandum of Understanding (MOU) with Italian satellite solutions company NPC Spacemind at the […]\nThe post Flexell Space and NPC Spacemind Partner at IAC 2025 on Next-Generation Solar Array Development appeared first on SpaceNews.",
    "published_at": "2025-10-01T04:00:00Z",
    "updated_at": "2025-10-01T04:10:17.067564Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33369,
    "title": "October’s Night Sky Notes: Let’s Go, LIGO!",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/solar-system/skywatching/night-sky-network/octobers-night-sky-notes-lets-go-ligo/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/ns-gw-art.webp",
    "news_site": "NASA",
    "summary": "by Kat Troche of the Astronomical Society of the Pacific September 2025 marks ten years since the first direct detection of gravitational waves as predicted by Albert Einstein’s 1916 theory of General Relativity. These invisible ripples in space were first directly detected by the Laser Interferometer Gravitational-Wave Observatory (LIGO). Traveling at the speed of light […]",
    "published_at": "2025-10-01T02:22:25Z",
    "updated_at": "2025-10-01T03:10:12.296564Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33368,
    "title": "Senate Rejects Efforts to Keep Government Open After Midnight",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/senate-rejects-efforts-to-keep-government-open-after-midnight/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/Thune-CR-Sept-30-25-300x193.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "The Senate defeated Republican and Democratic bills this evening that would have kept the government fully operating after midnight when FY2025 ends. The Democratic bill was defeated on party lines. […]",
    "published_at": "2025-10-01T02:01:06Z",
    "updated_at": "2025-10-01T02:10:14.159593Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33367,
    "title": "Australian and Japanese organizations join forces on optical communications",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/australian-and-japanese-organizations-join-forces-on-optical-communications/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_op.png?fit=879%2C570&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – The University of South Australia announced an agreement Sept. 29 with Australian start-up RapidBeam and Japanese startup Warpspace to develop laser communication systems. Under the agreement, announced at the International Astronautical Congress here, Warpspace’s optical modem will be integrated with the Australasian Optical Ground Station Network (AOGSN) and demonstrated in space-to-space and […]\nThe post Australian and Japanese organizations join forces on optical communications appeared first on SpaceNews.",
    "published_at": "2025-10-01T01:25:24Z",
    "updated_at": "2025-10-01T01:30:22.967823Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33366,
    "title": "Report argues NASA is illegally using President’s Budget Request to circumvent Congress’ budgeting process",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/10/01/report-nasa-is-illegally-using-presidents-budget-request-to-circumvent-congress-budgeting-process/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/05/20250502_NASA_Headquarters_small-678x509.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The claims outlined in the report stem from whistleblower information and documents from NASA to its workforce. The report was published less than 48 hours before the end of the 2025 fiscal year. ",
    "published_at": "2025-10-01T00:11:59Z",
    "updated_at": "2025-10-01T00:20:19.256014Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33365,
    "title": "ESA and Avio Unveil Plans for Reusable Upper Stage Rocket, Echoing SpaceX’s Starship Design",
    "authors": [
      {
        "name": "Ryan Caton and Chris Bergin",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/esa-avio-echoing-starship/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/NSF-2025-09-30-23-24-17-886.jpg",
    "news_site": "NASASpaceflight",
    "summary": "The European Space Agency (ESA) and Italian aerospace company Avio have signed a €40 million…\nThe post ESA and Avio Unveil Plans for Reusable Upper Stage Rocket, Echoing SpaceX’s Starship Design appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-30T22:49:10Z",
    "updated_at": "2025-09-30T22:50:20.573049Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33364,
    "title": "Varda Space and Southern Launch agree to more capsule landings in Australia",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/varda-space-and-southern-launch-agree-to-more-capsule-landings-in-australia/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/varda-southernlaunch-iac.jpeg?fit=1024%2C687&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nMicrogravity research company Varda Space Industries has signed an agreement with spaceport operator Southern Launch that will allow up to 20 capsule reentries in South Australia through 2028.\nThe post Varda Space and Southern Launch agree to more capsule landings in Australia appeared first on SpaceNews.",
    "published_at": "2025-09-30T22:17:11Z",
    "updated_at": "2025-09-30T22:20:16.632428Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33363,
    "title": "NASA, Blue Origin Invite Media to Attend Mars Mission Launch",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-blue-origin-invite-media-to-attend-mars-mission-launch/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/escapade1.jpg",
    "news_site": "NASA",
    "summary": "NASA and Blue Origin are reopening media accreditation for the launch of the agency’s ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers) mission. The twin ESCAPADE spacecraft will study the solar wind’s interaction with Mars, providing insight into the planet’s real-time response to space weather and how solar activity drives atmospheric escape. This will be […]",
    "published_at": "2025-09-30T22:00:25Z",
    "updated_at": "2025-09-30T22:02:10.212479Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33362,
    "title": "NASA, International Partners Deepen Commitment to Artemis Accords",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-international-partners-deepen-commitment-to-artemis-accords/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/iac3.jpg",
    "news_site": "NASA",
    "summary": "NASA, along with leaders from global space agencies and government representatives worldwide, convened on Monday to further the implementation of the Artemis Accords — practical principles designed to guide the responsible exploration of the Moon, Mars, and beyond. The meeting was held during the 76th International Astronautical Congress (IAC) taking place in Sydney. In opening […]",
    "published_at": "2025-09-30T21:23:31Z",
    "updated_at": "2025-09-30T21:30:21.915613Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33361,
    "title": "Satellite operators seek help from ITU to improve coordination for space safety",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/satellite-operators-seek-help-from-itu-to-improve-coordination-for-space-safety/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/53985124970_594954825a_k.jpg?fit=1024%2C519&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSatellite operators are asking an international regulator to help maintain lines of communication among them to deal with potential conjunctions and other space safety issues.\nThe post Satellite operators seek help from ITU to improve coordination for space safety appeared first on SpaceNews.",
    "published_at": "2025-09-30T21:09:44Z",
    "updated_at": "2025-09-30T21:10:28.570130Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33360,
    "title": "What’s Up: October 2025 Skywatching Tips from NASA",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/solar-system/whats-up-october-2025-skywatching-tips-from-nasa/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/psd/solar-system/skywatching/2025/october/Supermoon%20infographic.png",
    "news_site": "NASA",
    "summary": "A supermoon, and meteor showers from the Draconids and Orionids A supermoon takes over the sky, the Draconid meteor shower peeks through, and the Orionid meteor shower shines bright. Skywatching Highlights Transcript What’s Up for October? A Supermoon takes over, the Draconid meteor shower peeks through, and the Orionid meteors sparkle across the night sky. […]",
    "published_at": "2025-09-30T20:58:13Z",
    "updated_at": "2025-09-30T21:10:14.580479Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33359,
    "title": "OQ Technology expands satellite IoT services to Australia",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/oq-technology-expands-satellite-iot-services-to-australia/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/OQ-Australia-scaled.jpg?fit=1024%2C682&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nOQ Technology has expanded its satellite connectivity services for remote Internet of Things devices to Australia, the Luxembourg-based LEO operator announced Sept. 30.\nThe post OQ Technology expands satellite IoT services to Australia appeared first on SpaceNews.",
    "published_at": "2025-09-30T20:54:36Z",
    "updated_at": "2025-09-30T21:00:41.613031Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  }
]