[
  {
    "id": 33210,
    "title": "Firefly looks to resume Alpha launches soon",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/firefly-looks-to-resume-alpha-launches-soon/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/alpha7and8.jpeg?fit=1024%2C643&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nFirefly Aerospace expects to resume Alpha launches in the “coming weeks,” with two flights planned before the end of the year.\nThe post Firefly looks to resume Alpha launches soon appeared first on SpaceNews.",
    "published_at": "2025-09-23T11:53:30Z",
    "updated_at": "2025-09-23T12:00:26.889446Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33209,
    "title": "ESA selects WIVERN as 11th Earth Explorer mission",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/FutureEO/ESA_selects_WIVERN_as_11th_Earth_Explorer_mission",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/11/earth_explorer_11_candidate_mission_wivern/25202841-1-eng-GB/Earth_Explorer_11_candidate_mission_Wivern_card_full.jpg",
    "news_site": "ESA",
    "summary": "After meticulous preparation and rigorous evaluation, ESA’s Member States have selected WIVERN to become the 11th Earth Explorer mission to be implemented through the agency’s prestigious FutureEO programme.",
    "published_at": "2025-09-23T11:00:00Z",
    "updated_at": "2025-09-23T11:10:13.107079Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33208,
    "title": "Terran Orbital Completes Delivery of Satellite Bus Platforms to Lockheed Martin for the Tranche 1 Transport Layer",
    "authors": [
      {
        "name": "Terran Orbital",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/terran-orbital-completes-delivery-of-satellite-bus-platforms-to-lockheed-martin-for-the-tranche-1-transport-layer/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/terran-orbital-square.png?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIRVINE, CA – September 23, 2025 – Terran Orbital Corporation, a leading manufacturer of small satellites primarily serving the aerospace and defense industries, today announced the successful delivery of all […]\nThe post Terran Orbital Completes Delivery of Satellite Bus Platforms to Lockheed Martin for the Tranche 1 Transport Layer appeared first on SpaceNews.",
    "published_at": "2025-09-23T11:00:00Z",
    "updated_at": "2025-09-23T11:00:38.947920Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33207,
    "title": "Scaling up IRIS² to meet evolving demands",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/scaling-up-iris%c2%b2-to-meet-evolving-demands/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_iris_test.png?fit=879%2C433&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSAN FRANCISCO – European civil space leaders suggested expanding their flagship campaign to develop a secure communications constellation. Since the Infrastructure for Resilience, Interconnectivity and Security by Satellite (IRIS²) constellation of about 290 satellites was proposed, critics have attacked the program for being “too late and too small,” Nicolas Guillermin, European Commission team leader for […]\nThe post Scaling up IRIS² to meet evolving demands appeared first on SpaceNews.",
    "published_at": "2025-09-23T02:43:30Z",
    "updated_at": "2025-09-23T02:50:21.786706Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33206,
    "title": "A geologist, a former SpaceX launch director and a commercial astronaut; meet NASA’s 10 new astronaut candidates",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/22/a-geologist-a-former-spacex-launch-director-and-a-commercial-astronaut-meet-nasas-10-new-astronaut-candidates/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/09/20250922_NASA_ASCANs.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The cohort of ten women and men will train for the next two years to become eligible for mission assignments to low Earth orbit and beyond. This is the first astronaut candidate class to consist of more women than men. ",
    "published_at": "2025-09-22T23:10:43Z",
    "updated_at": "2025-09-22T23:20:22.156960Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The collection of ten women and men from across the United States were selected from more than 8,000 applications submitted. They represent the 24th astronaut candidate (ASCAN) class picked by NASA. Among the six women in this group is Anna Menon, the first astronaut candidate in history who has flown in orbital space prior to being selected as a NASA astronaut. NASA has added extra safeguards to the agency’s standard pre-launch quarantine protocol to protect astronauts Bob Behnken and Doug Hurley from the coronavirus and other contagions. Ground controllers have lost contact with two briefcase-sized CubeSats beyond Mars, NASA said Tuesday."
  },
  {
    "id": 33205,
    "title": "Lockheed Martin delivers 21 satellites for next launch of U.S. military ‘Transport Layer’",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/lockheed-martin-delivers-21-satellites-for-next-launch-of-u-s-military-transport-layer/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/T1TL-Row.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe company’s Tranche 1 Transport Layer satellites were built with buses provided by Terran Orbital, a Lockheed Martin subsidiary \nThe post Lockheed Martin delivers 21 satellites for next launch of U.S. military ‘Transport Layer’ appeared first on SpaceNews.",
    "published_at": "2025-09-22T22:44:04Z",
    "updated_at": "2025-09-22T22:50:29.015499Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Space Development Agency (SDA) is gearing up for its second launch of satellites. 21 satellites built by Lockheed Martin are on track to launch in October. SDA is building out a low Earth orbit (LEO) mesh network for military communications. The Transport Layer satellites will provide beyond line-of-sight connectivity. Enter the code we sent to , or clicking the magic link in the email. By creating a SpaceNews.com account, you acknowledge that you have read our privacy policy and agree to our terms and conditions. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
  },
  {
    "id": 33204,
    "title": "Launch Roundup: Kuiper, Starlink, IMAP headline launch manifest",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/launch-roundup-092225/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/05/julia-streak-1.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "A busy slate of launches is planned for the last full week of September, including…\nThe post Launch Roundup: Kuiper, Starlink, IMAP headline launch manifest appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-22T21:04:34Z",
    "updated_at": "2025-09-22T21:10:13.544339Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A busy slate of launches is planned for the last full week of September, including flights for two major low-Earth orbit broadband constellations. China and Rocket Lab are also planning flights, with Electron set to fly two suborbital hypersonic research missions from Wallops Island, Virginia. The United Launch Alliance (ULA) is planning to fly an Atlas V 551 on the KA-03 mission for the Amazon Kuiper constellation, while SpaceX is preparing to fly four Falcon 9 Starlink missions. The Jielong 3 rocket is capable of flying up to 1,600 kg to a 500 km altitude. The rocket will carry the Jili (Geely) Constellation 06 satellites A through K. The Geely communications satellite constellation is designed to offer coverage for the Internet of Things. The IMAP spacecraft will study the boundary between the heliosphere and interstellar space. The United Launch Alliance has scheduled its third Atlas V flight of the year for Thursday, Sept. 25. Amazon is racing to launch as many Kuiper satellites as possible before a July 2026 deadline. China is planning to fly a Chang Zheng 2D (CZ-2D) on Friday, September 26, at 17:20 UTC. The third Starlink launch of this week is scheduled for Sunday, Sept. 28 at 3:30 AM EDT (07:30 UTC) from SLC-40 at the CCSFS. The rocket will take a northeast trajectory and will fly a batch of Starlink v2 Mini satellites to low-Earth orbit inclined 53.16 degrees to the Equator. This is the ninth CZ-6 series launch of 2025."
  },
  {
    "id": 33201,
    "title": "NASA Chooses 10 New Astronaut Candidates",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/nasa-chooses-10-new-astronaut-candidates/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/NASA-ASCANs-Sept-22-2025-300x200.webp",
    "news_site": "SpacePolicyOnline.com",
    "summary": "NASA introduced its 24th class of astronauts today, six women and four men. It is the first astronaut class with more women than men and the first with anyone who […]",
    "published_at": "2025-09-22T20:45:59Z",
    "updated_at": "2025-09-22T20:50:14.173639Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA introduced its 24th class of astronauts today, six women and four men. It is the first astronaut class with more women than men and the first with anyone who already has made an orbital spaceflight. The 10 astronaut candidates will train for two years before becoming eligible for NASA missions to Earth orbit, the Moon and beyond. The other ASCANs are equally impressive as detailed in NASA’s press release. Ben Bailey is a U.S. Naval Test Pilot School graduate with more than 2,000 flight hours in more than 30 different rotary and fixed-wing aircraft. His first spaceflight is scheduled for next year on Soyuz MS-29. Anna Menon, 39, is from Houston and earned her bachelor’s degree from Texas Christian University. Imelda Muller, 34, considers Copake Falls, New York, her hometown. Erin Overcash is a former Marine Corps AH-1 attack helicopter pilot and experimental test pilot."
  },
  {
    "id": 33202,
    "title": "Air Force Secretary warns of ‘Sputnik moment’ as U.S. faces China’s rapid military advances",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/air-force-secretary-warns-of-sputnik-moment-as-u-s-faces-chinas-rapid-military-advances/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/250922-F-JJ904-4038.jpg?fit=1024%2C704&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe Department of the Air Force’s top civilian overseeing both the Air Force and the Space Force said he is increasingly worried about the services’ pace of innovation. \nThe post Air Force Secretary warns of ‘Sputnik moment’ as U.S. faces China’s rapid military advances appeared first on SpaceNews.",
    "published_at": "2025-09-22T20:45:56Z",
    "updated_at": "2025-09-22T20:50:19.230489Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Air Force Secretary Troy Meink likens today's threats to the Sputnik shock of 1957. He warns that the United States risks falling behind adversaries, particularly China. Meink says he is increasingly worried about the services' pace of innovation. He stressed that the U.S. continues to field “the best trained force in the world” Enter the code we sent to your email. Use the magic link in the email to sign in. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent toyour email."
  },
  {
    "id": 33203,
    "title": "NASA selects new astronaut class",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-selects-new-astronaut-class/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/54794976900_9e0ca8169c_k.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA announced its newest class of astronauts Sept. 22 as agency leaders and lawmakers emphasized their intent to return humans to the moon before China.\nThe post NASA selects new astronaut class appeared first on SpaceNews.",
    "published_at": "2025-09-22T20:42:29Z",
    "updated_at": "2025-09-22T20:50:19.249857Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA announced its newest class of astronauts Sept. 22. The six women and four men represent NASA’s first astronaut class with more women than men. The class includes scientists, engineers and pilots, with experience ranging from flying military aircraft in combat to working on the Curiosity Mars rover. NASA’s Aerospace Safety Advisory Panel raised similar concerns at a Sept. 19 meeting. “I’ll be damned if the Chinese beat NASA, or beat America, back to the moon. We’re going to win,” Sean Duffy said. Duffy did not directly address recent criticism of Artemis."
  },
  {
    "id": 33200,
    "title": "Falcon 9 launch pushes NRO satellite fleet past 200 in orbit",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/falcon-9-launch-pushes-nro-satellite-fleet-past-200-in-orbit/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Screenshot-2025-09-22-at-3.47.06-PM.png?fit=1024%2C469&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe launch of NROL-48 marked the eleventh launch in the NRO’s growing proliferated architecture\nThe post Falcon 9 launch pushes NRO satellite fleet past 200 in orbit appeared first on SpaceNews.",
    "published_at": "2025-09-22T19:56:03Z",
    "updated_at": "2025-09-22T20:01:08.793642Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX launches a batch of small spy satellites for the National Reconnaissance Office. The rocket lifted off from Vandenberg Space Force Base in California at 1:38 p.m. Eastern. The flight marked the eleventh launch in the NRO’s growing “ proliferated architecture."
  },
  {
    "id": 33199,
    "title": "Lettuce Find Healthy Space Food! Citizen Scientists Study Space Salads",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/biological-physical-sciences/lettuce-find-healthy-space-food-citizen-scientists-study-space-salads/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/citizen-science/highlights/2025/lettuce-find-healthy-space-food.png",
    "news_site": "NASA",
    "summary": "Lettuce Find Healthy Space Food! Citizen Scientists Study Space Salads Missions to the Moon and Mars pose nutritional challenges for astronauts. Now, a new paper on space-grown food is telling us it’s time to turn over a new leaf.  Volunteers from NASA’s Open Science Data Repository Analysis Working Groups (OSDR-AWG)  work together to analyze data […]",
    "published_at": "2025-09-22T18:47:14Z",
    "updated_at": "2025-09-22T19:10:13.906573Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Missions to the Moon and Mars pose nutritional challenges for astronauts. Volunteers from NASA’s Open Science Data Repository Analysis Working Groups (OSDR-AWG) are working together to analyze data on astronaut health. The AWGs examine biomedical data from NASA missions and space experiments collected in the NASA Open Science data Repository."
  },
  {
    "id": 33198,
    "title": "IC Stars",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/ic-stars/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/54735841713-aa9781d42e-o.jpg",
    "news_site": "NASA",
    "summary": "Data from NASA’s Chandra X-ray Observatory and NASA’s James Webb Space Telescope combine to reveal an otherworldly view of the star-forming region IC 348. In this image released on July 23, 2025, X-rays from Chandra are red, green, and blue, while infrared data from Webb are pink, orange, and purple. The wispy structures that dominate […]",
    "published_at": "2025-09-22T17:27:16Z",
    "updated_at": "2025-09-22T17:30:06.106376Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33197,
    "title": "NASA Selects All-American 2025 Class of Astronaut Candidates",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-selects-all-american-2025-class-of-astronaut-candidates/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/ascans-2-003.jpg",
    "news_site": "NASA",
    "summary": "Lee este comunicado de prensa en español aquí. NASA’s 10 new astronaut candidates were introduced Monday following a competitive selection process of more than 8,000 applicants from across the United States. The class now will complete nearly two years of training before becoming eligible for flight assignments supporting future science and exploration missions to low Earth […]",
    "published_at": "2025-09-22T16:45:29Z",
    "updated_at": "2025-09-22T16:50:07.925647Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33195,
    "title": "Solar and Space Weather Missions Ready for Launch",
    "authors": [
      {
        "name": "Emily B",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/09/6861/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/09/KSC-20250916-PH-KLS01_0132large.jpg",
    "news_site": "Space Scout",
    "summary": "NASA's IMAP mission is set to launch on September 23, 2025, aboard a SpaceX Falcon 9 rocket. This launch brings 3 separate missions to the Earth-Sun L1 Lagrange point: IMAP, the Carruthers Geocorona Observatory, and NOAA’s SWFO-L1.",
    "published_at": "2025-09-22T15:43:10Z",
    "updated_at": "2025-09-22T15:50:29.315829Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33194,
    "title": "Moog Breaks Ground on New Propulsion Clean Room to Support Satellite and Missile Growth",
    "authors": [
      {
        "name": "Moog Inc.",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/moog-breaks-ground-on-new-propulsion-clean-room-to-support-satellite-and-missile-growth/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/12/Moog_logo_maroon.png?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nEast Aurora, NY – Moog Inc. (NYSE: MOG.A and MOG.B), a worldwide designer, manufacturer and systems integrator of high-performance precision motion and fluid controls and control systems announces the groundbreaking […]\nThe post Moog Breaks Ground on New Propulsion Clean Room to Support Satellite and Missile Growth appeared first on SpaceNews.",
    "published_at": "2025-09-22T15:09:43Z",
    "updated_at": "2025-09-22T15:10:28.864218Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33193,
    "title": "Europe’s future space transport ecosystem",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/09/Europe_s_future_space_transport_ecosystem",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/09/europe_s_future_space_transport_ecosystem/26879822-2-eng-GB/Europe_s_future_space_transport_ecosystem_card_full.png",
    "news_site": "ESA",
    "summary": "ESA’s future launcher preparatory programme is crafting a space transportation ecosystem, guiding the companies and engineers of today to develop and test the technologies required to meet future needs.",
    "published_at": "2025-09-22T14:00:00Z",
    "updated_at": "2025-09-22T13:10:14.652211Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33192,
    "title": "A double standard about contamination is keeping us from verifying signs of Martian life",
    "authors": [
      {
        "name": "Chad Pozarycki",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/a-double-standard-about-contamination-is-keeping-us-from-verifying-signs-of-martian-life/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/percy-cheyava.jpeg?fit=1024%2C727&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA has announced that the properties of a rock in Jezero Crater qualify as a potential biosignature. The NASA Astrobiology Roadmap defines a biosignature as “an object, substance, and/or pattern whose origin specifically requires a biological agent.” By that standard, a confirmed biosignature would be as close as we can get to proof of alien […]\nThe post A double standard about contamination is keeping us from verifying signs of Martian life  appeared first on SpaceNews.",
    "published_at": "2025-09-22T13:00:00Z",
    "updated_at": "2025-09-22T13:00:29.689745Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33191,
    "title": "Quantum Space acquires Phase Four propulsion assets",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/quantum-space-acquires-phase-four-propulsion-assets/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/06/quantum-ranger.jpeg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nQuantum Space is acquiring propulsion technologies and facilities from Phase Four to support development of its Ranger maneuverable spacecraft.\nThe post Quantum Space acquires Phase Four propulsion assets appeared first on SpaceNews.",
    "published_at": "2025-09-22T10:52:29Z",
    "updated_at": "2025-09-22T11:00:37.061155Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33190,
    "title": "Live coverage: NRO, SpaceX to launch reconnaissance satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/22/live-coverage-nro-spacex-to-launch-reconnaissance-satellites-on-falcon-9-rocket-from-vandenberg-sfb/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/03/20250320_NROL_57_Vertical_small.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The NROL-48 mission will be the fifth mission this year supporting the National Reconnaissance Office’s expansive low Earth orbit statellite constellation it calls the proliferated architecture. Liftoff from pad 4E is scheduled for 10:38 a.m. PDT (1:38 p.m. EDT / 1738 UTC).",
    "published_at": "2025-09-22T10:25:49Z",
    "updated_at": "2025-09-22T11:14:40.814620Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "86d62815-9266-481b-951e-e53670d27341",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33189,
    "title": "Mars’s atmospheric mille-feuille",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/Mars_s_atmospheric_mille-feuille",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/mars_s_atmospheric_mille-feuille/26874563-1-eng-GB/Mars_s_atmospheric_mille-feuille_card_full.png",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-22T04:00:00Z",
    "updated_at": "2025-09-22T09:54:45.476733Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "0b675aa8-0a78-4ed6-bbca-6916c8a7206b",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33188,
    "title": "NASA Safety Panel Estimates Significant Delays for Starship HLS",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/nasa-safety-panel-estimates-significant-delays-for-starship-hls/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2024/05/Paul-Hill-225x300.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "NASA’s Aerospace Safety Advisory panel is warning that SpaceX’s Starship Human Landing System (HLS) could be “years late” for the Artemis III mission that is supposed to take place in […]",
    "published_at": "2025-09-22T03:52:13Z",
    "updated_at": "2025-09-22T04:00:18.992703Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA’s Aerospace Safety Advisory Panel is warning that SpaceX's Starship Human Landing System (HLS) could be “years late” for the Artemis III mission that is supposed to take place in mid-2027. The assessment comes after three ASAP members visited SpaceX's Starbase facility in Boca Chica, TX and met with top SpaceX officials. While they were quite impressed with SpaceX's manufacturing and operations tempo, they nonetheless found the schedule for HLS is “significantly challenged.  ASAP has been recommending since 2023 that NASA reevaluate the “high number of individual risks and mission firsts” associated with Artemis III. ASAP was created by Congress in 1968 following the 1967 Apollo 1 tragedy that killed NASA astronauts Virgil “Gus” Grissom, Ed White, and Roger Chaffee."
  },
  {
    "id": 33187,
    "title": "XRISM observes windy neutron star, Chandra studies a luminous quasar",
    "authors": [
      {
        "name": "Martijn Luinstra",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/gx131-racs-j03200-35/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/xrism_chandra_lead_image.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Using the joint Japan Aerospace Exploration Agency (JAXA), European Space Agency (ESA), and NASA X-Ray…\nThe post XRISM observes windy neutron star, Chandra studies a luminous quasar appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-21T22:52:24Z",
    "updated_at": "2025-09-21T23:00:19.023599Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Using the joint Japan Aerospace Exploration Agency (JAXA), European Space Agency (ESA), and NASA X-Ray Imaging and Spectroscopy Mission (XRISM), scientists uncovered a dense but surprisingly slow wind coming from a neutron star. Another team used NASA’s Chandra X-ray Observatory to study an ancient supermassive black hole growing at extreme rates. When the neutron star lit up, it exceeded its so-called Eddington limit. As matter falls into the object, it releases energy, and with more matter falling in, the amount of energy released increases as well. This energy pushes back on the material falling in and capping the rate at which matter can fall in. The intense radiation at the EdDington limit blows away the material surrounding the neutronstar, creating a cosmic wind. This phenomenon is also observed around supermassive black holes. RACS J0320−35 might hint at the nature of recently discovered “little red dots” found scattered throughout the early universe. These dots first showed up in 2022, in some of the first observations from the James Webb Space Telescope (JWST) Astronomers have since been looking for an explanation."
  },
  {
    "id": 33186,
    "title": "What’s Happening in Space Policy September 21-27, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-september-21-27-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2024/01/Artemis-II-crew-NASA-300x196.webp",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of September 21-27, 2025 and any insight we can offer about them. The House and Senate are in recess […]",
    "published_at": "2025-09-21T16:19:08Z",
    "updated_at": "2025-09-21T16:20:16.177846Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The House and Senate are in recess this week except for pro forma sessions. NASA begins a three-day human spaceflight extravaganza at Johnson Space Center. Washington Post reporter Christian Davenport will talk about his new book at two events in D.C. this week. On Friday, the House passed a Republican version of a Continuing Resolution (CR) that would keep the government open through November 21. All but one Democrat opposed it, and all but two Republicans supported it. The Senate then defeated that bill as well as a Democratic alternative (through October 31) that insists on including a provision extending Affordable Health Care premium subsidies. Both votes were on largely partisan lines."
  },
  {
    "id": 33185,
    "title": "Shutdown Showdown September 2025: The State of Play 10 Days Out",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/shutdown-showdown-september-2025-the-state-of-play-10-days-out/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/cr-1-300x91.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Unless Congress and the President can reach agreement in the next 10 days, there will be a government shutdown on October 1. Both sides say they do not want that […]",
    "published_at": "2025-09-21T16:09:14Z",
    "updated_at": "2025-09-21T16:10:16.427413Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Congress has not passed the FY2026 appropriations bills needed to fund the government when the new fiscal year begins on October 1. A Continuing Resolution is needed to keep the government open until the 12 regular appropriations bills are signed into law. Agencies typically are kept at their current funding levels under a CR and new programs cannot begin nor existing programs terminated. CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel each week for a new gallery of snapshots. Visit http://www.dailymail.co.uk/travel/features/tourists-tourist-tours-takes-pictures.shtml."
  },
  {
    "id": 33184,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/20/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-12/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/02/20250211_Starlink_12-18_prelaunch.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-27 mission will be the 280th orbital launch for SpaceX from Cape Canaveral Space Force Station. Liftoff from Space Launch Complex 40 is scheduled for 6:53 a.m. EDT (1053 UTC). ",
    "published_at": "2025-09-20T23:19:41Z",
    "updated_at": "2025-09-20T23:20:18.104216Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for a near sunrise Falcon 9 launch from Cape Canaveral on Sunday. The Starlink 10-27 mission will send 28 Starlink V2 Mini satellites into low Earth orbit. The rocket will head away from Florida’s Space Coast on a north-easterly trajectory. Spaceflight Now will have live coverage beginning about an hour prior to liftoff."
  },
  {
    "id": 33183,
    "title": "NASA safety panel warns Starship lunar lander could be delayed by years",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-safety-panel-warns-starship-lunar-lander-could-be-delayed-by-years/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/06/starshiphls.jpg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA safety advisers say they doubt the lunar lander version of SpaceX’s Starship will be ready to support the Artemis 3 mission as planned in 2027.\nThe post NASA safety panel warns Starship lunar lander could be delayed by years appeared first on SpaceNews.",
    "published_at": "2025-09-20T19:13:55Z",
    "updated_at": "2025-09-20T19:20:19.140654Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA safety advisers say they doubt the lunar lander version of SpaceX’s Starship will be ready to support the Artemis 3 mission as planned in 2027. Members of the Aerospace Safety Advisory Panel said they believed the Human Landing System, or HLS, version of Starship could be “years late” Get unlimited access to SpaceNews.com now. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent to your email. Enter your password. Sign in to an existing account."
  },
  {
    "id": 33182,
    "title": "Ship 38 on Pad 1 for Static Fire testing as Masseys rebuild continues",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/ship-38-pad-1-static-fire-masseys-rebuild/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/Starbase-Texas-from-the-air-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "As SpaceX presses on with attempts to complete static fire testing with Ship 38 ahead…\r\nThe post Ship 38 on Pad 1 for Static Fire testing as Masseys rebuild continues appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-20T18:32:08Z",
    "updated_at": "2025-09-20T18:59:29.771232Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "41068e09-4097-448f-ac7c-421c19b6aab9",
        "provider": "Launch Library 2"
      }
    ],
    "events": [
      {
        "event_id": 1289,
        "provider": "Launch Library 2"
      }
    ],
    "detailed_news": "Following the anomaly with Ship 36, SpaceX has made significant progress in rebuilding the test stand. Crews have nearly rebuilt the entire Methane tank farm, upgrading storage capacity with the addition of a new horizontal tank. SpaceX is also using its own valve skids for both the Liquid Oxygen (LOX) and Liquid Methane (LCH4) sides of the tank farm. SpaceX has rolled test tank B18.3 out to Masseys. This test tank is designed to evaluate the hot stage truss, new grid fin cavities, and the rest of the forward section of the Block 3 booster. Gigabay construction has made significant progress, with crews completing seven concrete pours so far. Ship 38 has had two aborted attempts at a static fire. SpaceX needs permission to build on the wetlands, tidal flats, and uplands that they own south of the current launch site. To fly Block 3 and later from that location, SpaceX must upgrade the pad to the newer design. SpaceX is expected to have the required land swap credits by early 2026."
  },
  {
    "id": 33181,
    "title": "CNES Pushes FROG-H Reusable Rocket Demonstrator Debut to 2026",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/cnes-pushes-frog-h-reusable-rocket-demonstrator-debut-to-2026/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/CNES-Push-Frog-H-Reusable-Rocket-Demonstrator-Debut-to-2026.webp",
    "news_site": "European Spaceflight",
    "summary": "The French space agency CNES has confirmed to European Spaceflight that the debut of its upgraded FROG reusable rocket demonstrator has been pushed to 2026. The FROG-H vehicle had been expected to complete initial test flights in early 2025. The Rocket for GNC Demonstration (FROG) initiative was launched by the CNES Launch Vehicles Directorate in […]\nThe post CNES Pushes FROG-H Reusable Rocket Demonstrator Debut to 2026 appeared first on European Spaceflight.",
    "published_at": "2025-09-20T15:32:51Z",
    "updated_at": "2025-09-20T15:40:10.028945Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "French space agency CNES has confirmed that the debut of its upgraded FROG reusable rocket demonstrator has been pushed to 2026. The FROG-H vehicle had been expected to complete initial test flights in early 2025. In addition to FROG, CNES is also working on the Callisto reusable rocket programme."
  },
  {
    "id": 33180,
    "title": "NASA revives VIPER lunar rover mission with Blue Origin lander award",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-revives-viper-lunar-rover-mission-with-blue-origin-lander-award/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/viper-bluemoon.jpeg?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "NASA has revived a robotic lunar rover mission by selecting Blue Origin to deliver it to the moon’s south pole in 2027.\r\nThe post NASA revives VIPER lunar rover mission with Blue Origin lander award appeared first on SpaceNews.",
    "published_at": "2025-09-20T06:07:43Z",
    "updated_at": "2025-09-20T06:57:06.355196Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "c5ebc8b1-ae7f-4e8d-8619-99bbe0d8025a",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "NASA has revived a robotic lunar rover mission by selecting Blue Origin. Blue Origin will deliver it to the moon’s south pole in 2027. VIPER will search for water ice at the lunar south pole, including in permanently shadowed craters. In July 2024, NASA said it would cancel VIPER , citing cost overruns. Get unlimited access to SpaceNews.com for as low as $5 per week. You’ll also receive our weekly SpaceNews This Week newsletter every Friday. Opt-out at any time. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options."
  },
  {
    "id": 33179,
    "title": "The Ancient Mars Variety Show",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/the-ancient-mars-variety-show/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/mars2020/2025/perseverance-rover-updates/Mars_Perseverance_SIF_1620_0810758550_902EBY_N0790198SRLC02501_0000LMJ.png",
    "news_site": "NASA",
    "summary": "Written by Melissa Rice, Professor of Planetary Science at Western Washington University Perseverance accomplished something unusual this week: abrading two dramatically different rocks within the span of a few days. While exploring the Vernodden area along Jezero crater’s rim, the rover has been studying what might be “megablocks,” a variety of ancient crustal materials with […]",
    "published_at": "2025-09-19T23:09:16Z",
    "updated_at": "2025-09-20T00:10:15.156071Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Mars Perseverance rover abraded two dramatically different rocks within the span of a few days. While exploring the Vernodden area along Jezero crater's rim, the rover has been studying what might be \"megablocks\" The ancient fragments can help the Science Team reconstruct the complex geological processes that shaped early Mars billions of years ago."
  },
  {
    "id": 33178,
    "title": "VIPER Might Have A New Ride to the Moon on Blue Origin",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/viper-might-have-a-new-ride-to-the-moon-on-blue-origin/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/Blue-Moon-with-VIPER-BO-300x225.webp",
    "news_site": "SpacePolicyOnline.com",
    "summary": "NASA’s much-anticipated but imperiled VIPER lunar rover got some good news today. More than a year after NASA announced it was terminating the mission even though the rover is completely […]",
    "published_at": "2025-09-19T22:42:18Z",
    "updated_at": "2025-09-19T22:50:24.052849Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA awarded a contract to Blue Origin to take initial steps that, if successful, could lead to VIPER flying on Blue Origin’s Blue Moon MK1 lander. VIPER is an option and NASA won’t decide whether to exercise that option until step one is completed. Astrobotic had been awarded a fixed price contract of $323 million to deliver VIPER to the lunar surface through CLPS. The lunar science community and Congress reacted negatively to the decision and NASA decided to issue a call for expressions of interest by organizations that might want to take over the project. Astrobotic said in an emailed statement today they had decided not to submit a bid."
  },
  {
    "id": 33177,
    "title": "Amid budget uncertainty, NASA gets some good news: Use House funding levels",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/amid-budget-uncertainty-nasa-gets-some-good-news-use-house-funding-levels/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1133641758-1.jpg",
    "news_site": "Arstechnica",
    "summary": "The House budget still cuts science at NASA, but not as deeply as the White House sought.",
    "published_at": "2025-09-19T22:38:10Z",
    "updated_at": "2025-09-19T22:50:14.026277Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Congress has not passed a final budget for fiscal year 2026, which begins on October 1. The White House proposed significant cuts to NASA's budget. The House budget proposes to keep funding levels nearly identical to the current fiscal year. This does not support full funding for NASA's science portfolio, but is far more beneficial than the cuts sought by the White House."
  },
  {
    "id": 33176,
    "title": "After a very slow start, Europe’s reusable rocket program shows signs of life",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/after-a-very-slow-start-europes-reusable-rocket-program-shows-signs-of-life/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/G1Mh6O7WAAApPeJ.jpg",
    "news_site": "Arstechnica",
    "summary": "Although Themis is making progress, the program is several years behind schedule.",
    "published_at": "2025-09-19T22:06:43Z",
    "updated_at": "2025-09-19T22:20:04.701236Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Themis is a prototype rocket that will test various landing technologies. Low-altitude hop tests, a precursor for developing a rocket's first stage that can vertically land after an orbital launch, could start late this year or early next. Although Themis is making progress, the program is several years behind schedule."
  },
  {
    "id": 33175,
    "title": "China promotes direct-to-device satellite services with new guidelines and licensing",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-promotes-direct-to-device-satellite-services-with-new-guidelines-and-licensing/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/Guowang-group10-CZ8A-HCSLC-25aug2025-ourspace1.jpg?fit=1024%2C589&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nChina has moved to promote direct-to-device (D2D) services through issuing guidelines and licensing a telecommunications firm, signaling a strategic push into a globally competitive arena.\nThe post China promotes direct-to-device satellite services with new guidelines and licensing appeared first on SpaceNews.",
    "published_at": "2025-09-19T21:10:47Z",
    "updated_at": "2025-09-19T21:20:22.816571Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33174,
    "title": "NASA Selects Blue Origin to Deliver VIPER Rover to Moon’s South Pole",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-selects-blue-origin-to-deliver-viper-rover-to-moons-south-pole/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/mk1-viper-render100.jpg",
    "news_site": "NASA",
    "summary": "As part of the agency’s Artemis campaign, NASA has awarded Blue Origin of Kent, Washington, a CLPS (Commercial Lunar Payload Services) task order with an option to deliver a rover to the Moon’s South Pole region. NASA’s VIPER (Volatiles Investigating Polar Exploration Rover) will search for volatile resources, such as ice, on the lunar surface […]",
    "published_at": "2025-09-19T20:24:02Z",
    "updated_at": "2025-09-19T20:30:04.928275Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA has awarded Blue Origin of Kent, Washington, a CLPS task order with an option to deliver a rover to the Moon’s South Pole region. VIPER (Volatiles Investigating Polar Exploration Rover) will search for volatile resources, such as ice, on the lunar surface. The VIPER rover will study the distribution and origin of volatiles across the solar system. It will also help us better understand the processes that have shaped our space environment. Through CLPS, American companies continue to demonstrate leadership in commercial space advancing capabilities and accomplishing NASA’s goal for a commercial lunar economy."
  },
  {
    "id": 33173,
    "title": "ArianeGroup Completes Themis Integration Ahead of Combined Tests",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/arianegroup-completes-themis-integration-ahead-of-combined-tests/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/ArianeGroup-Completes-Themis-Integration-Ahead-of-Combined-Tests.webp",
    "news_site": "European Spaceflight",
    "summary": "ArianeGroup has announced that the first Themis reusable rocket demonstrator has been fully integrated and is on its own four legs on a launch pad in Sweden. The demonstrator will now be put through a combined test campaign before an initial low-altitude hop test is performed. ESA Member States adopted the Themis programme in November […]\nThe post ArianeGroup Completes Themis Integration Ahead of Combined Tests appeared first on European Spaceflight.",
    "published_at": "2025-09-19T18:44:39Z",
    "updated_at": "2025-09-19T18:50:11.965487Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "ArianeGroup has completed the integration of the first Themis reusable rocket demonstrator. The demonstrator will now be put through a combined test campaign before an initial low-altitude hop test is performed. Themis programme is being funded by the European Space Agency and the European Union."
  },
  {
    "id": 33172,
    "title": "Live Event: The Space Investment Horizon",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/live-event-the-space-investment-horizon/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Space-Investment-Horizon-2000x1500-Webinar.png?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nFor more than six decades, the United States has pursued the promise of nuclear power in space — a technology capable of delivering energy where sunlight can’t reach and enabling missions beyond the limits of chemical propulsion. Yet since a brief reactor flight in 1965, no fission reactor has operated in orbit.\nThe post Live Event: The Space Investment Horizon appeared first on SpaceNews.",
    "published_at": "2025-09-19T18:33:33Z",
    "updated_at": "2025-09-19T18:40:26.416629Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33171,
    "title": "NASA’s Orion Spacecraft Secures Critical Abort System Hardware for Artemis II",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-orion-spacecraft-secures-critical-abort-system-hardware-for-artemis-ii/",
    "image_url": "https://images-assets.nasa.gov/image/KSC-20250917-PH-FMX01_0037/KSC-20250917-PH-FMX01_0037~large.jpg",
    "news_site": "NASA",
    "summary": "All the pieces are stacking up – literally – for NASA’s first crewed mission of the Artemis program coming in 2026. Teams are finishing integration of the Orion spacecraft for the Artemis II test flight with its launch abort system on Sept. 17 inside the Launch Abort System Facility at NASA’s Kennedy Space Center in […]",
    "published_at": "2025-09-19T17:56:44Z",
    "updated_at": "2025-09-19T18:00:11.024080Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33170,
    "title": "Shaping the new era of space",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/shaping-the-new-era-of-space/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/revillon-novaspace-ceo-series-spaceminds-2000-1500-scaled.jpg?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIn this week’s special CEO Series edition of Space Minds, we're at the World Space Business Week in Paris. In today's episode, SpaceNews editor Mike Gruss talks with Pacome Revillon, CEO of Novaspace. \nThe post Shaping the new era of space appeared first on SpaceNews.",
    "published_at": "2025-09-19T15:53:42Z",
    "updated_at": "2025-09-19T16:00:25.696699Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33169,
    "title": "Novaspace Recognizes 2025 Excellence Award Winners in Satellite Connectivity, Earth Observation, and Startup Challenge at World Space Business Week",
    "authors": [
      {
        "name": "Novaspace",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/novaspace-recognizes-2025-excellence-award-winners-in-satellite-connectivity-earth-observation-and-startup-challenge-at-world-space-business-week/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/04/novaspace-square-1-scaled.png?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nParis, September 19, 2025 – Novaspace proudly recognized the 2025 winners of its Annual Excellence Awards and the WSBW Startup Challenge during the 28th edition of the World Space Business […]\nThe post Novaspace Recognizes 2025 Excellence Award Winners in Satellite Connectivity, Earth Observation, and Startup Challenge at World Space Business Week appeared first on SpaceNews.",
    "published_at": "2025-09-19T14:54:51Z",
    "updated_at": "2025-09-19T15:00:31.830246Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33168,
    "title": "A Beacon to Space",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/a-beacon-to-space/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/1-pia26662-dsc4667-enhanced-nr-f100bb.jpg",
    "news_site": "NASA",
    "summary": "In this infrared photograph taken on June 2, 2025, the Optical Communications Telescope Laboratory at NASA’s Jet Propulsion Laboratory’s Table Mountain Facility near Wrightwood, California, beams its eight-laser beacon to the Deep Space Optical Communications (DSOC) flight laser transceiver aboard NASA’s Psyche spacecraft. At the time, when Psyche was about 143 million miles (230 million […]",
    "published_at": "2025-09-19T14:32:42Z",
    "updated_at": "2025-09-19T14:40:05.364376Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33167,
    "title": "Building Saudi Arabia’s space champion",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/building-saudi-arabias-space-champion/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/NSG_WSBW0003-scaled.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNeo Space Group CEO Martijn Blanken explains how the Saudi-backed space services company is balancing sovereign demand with global ambitions.\nThe post Building Saudi Arabia’s space champion appeared first on SpaceNews.",
    "published_at": "2025-09-19T13:38:07Z",
    "updated_at": "2025-09-19T13:40:19.540310Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33166,
    "title": "Week in images: 15-19 September 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_15-19_September_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/earth_from_space_komodo_island_indonesia/26875244-1-eng-GB/Earth_from_Space_Komodo_Island_Indonesia_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 15-19 September 2025",
    "published_at": "2025-09-19T13:10:00Z",
    "updated_at": "2025-09-19T13:30:19.015344Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33165,
    "title": "American leadership at Apophis",
    "authors": [
      {
        "name": "Alexander MacDonald, Jim Bell and Dani Mendoza DellaGiustina",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/american-leadership-at-apophis/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/apophis-illus.jpeg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "We are fewer than four years away from what may be the most significant near-Earth asteroid event of the 21st century. On April 13, 2029, the asteroid Apophis — named for the Egyptian god of chaos — will pass so close to Earth that it will be visible to the naked eye across much of […]\r\nThe post American leadership at Apophis appeared first on SpaceNews.",
    "published_at": "2025-09-19T13:00:00Z",
    "updated_at": "2025-09-19T15:01:03.417349Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33162,
    "title": "Rocket Report: European rocket reuse test delayed; NASA tweaks SLS for Artemis II",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/rocket-report-european-rocket-reuse-test-delayed-nasa-tweaks-sls-for-artemis-ii/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/LOW-RES_Spectrum-Lift-off-c-Isar-Aerospace-Brady-Kenniston-NASASpaceflight.com-2.jpg",
    "news_site": "Arstechnica",
    "summary": "\"There’s a lot of interest because of the fear that there’s just not a lot of capacity.\"",
    "published_at": "2025-09-19T11:00:51Z",
    "updated_at": "2025-09-19T11:10:04.610266Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Rocket Lab plans to raise up to $750 million by selling common shares. Astra targets mid-2026 for the first flight of its Rocket 4 vehicle. Avio's board of directors approves a 400 million euro ($471 million) capital increase. It is still subject to a shareholder vote, scheduled for October 23. Isar Aerospace executives discuss the outcome of the investigation into the March 30 launch of the Spectrum rocket. Despite the failure to get to orbit, Isar considers the first Spectrum launch a successful test flight. The company is working toward a second flight of Spectrum, which will take place \"as soon as possible\" Northrop Grumman inked a contract with SpaceX for three Falcon 9 launches. Launch companies are reiterating plans to sharply increase flight rates. United Launch Alliance projected 20 launches in 2025 between the Atlas 5 and Vulcan Centaur. Arianespace projected five Ariane 6 launches this year, including the debut of the more powerful Ariane 64, with four solid-rocket boosters. Ars is a trusted source in a sea of information. You don’t need to know everything, only what’s important. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, we can help you understand the world around you."
  },
  {
    "id": 33163,
    "title": "Hubble Images Celestial Cigar’s Smoldering Heart",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-images-celestial-cigars-smoldering-heart/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/spiral/Hubble_M82_potw2537a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image reveals new details in Messier 82 (M82), home to brilliant stars whose light is shaded by sculptural clouds made of clumps and streaks of dust and gas. This image features the star-powered heart of the galaxy, located just 12 million light-years away in the constellation Ursa Major (the Great […]",
    "published_at": "2025-09-19T11:00:00Z",
    "updated_at": "2025-09-19T11:10:05.622826Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Messier 82 (M82) is 12 million light-years away in the constellation Ursa Major (the Great Bear) The galaxy forms stars 10 times faster than the Milky Way. The intense starbirth period that grips this galaxy gave rise to super star clusters in the galaxy’s heart."
  },
  {
    "id": 33161,
    "title": "Taiwanese aerospace firm partners with Maxar on GPS-alternative drone navigation",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/taiwanese-aerospace-firm-partners-with-maxar-on-gps-alternative-drone-navigation/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Raptor_Guide_Sweden_Testing.png?fit=1024%2C587&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe satellite imagery company’s Raptor software uses terrain mapping to guide UAVs when satellite signals are jammed or unavailable\nThe post Taiwanese aerospace firm partners with Maxar on GPS-alternative drone navigation appeared first on SpaceNews.",
    "published_at": "2025-09-19T10:00:00Z",
    "updated_at": "2025-09-19T10:10:18.437826Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Maxar Intelligence announced a deal with one of Taiwan’s largest aerospace and defense contractors. Maxar Raptor is a vision-based software suite that enables autonomous drones to navigate. It provides a terrain-based positioning system for drones in GPS-denied environments. The partnership comes as military and civilian aircraft operators worldwide grapple with GPS jamming. Enter the code we sent to , or clicking the magic link in the email. By creating a SpaceNews.com account, you acknowledge that you have read our privacy policy and agree to our terms and conditions. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
  }
]