[
  {
    "id": 33342,
    "title": "Canadian Space Agency offers funding for dual-use technologies",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/canadian-space-agency-offers-funding-for-dual-use-technologies/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2014/11/Radarsat2_CSA4X3-e1496755641644.jpg?fit=1024%2C762&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – Canada’s recently announced defense industrial strategy provides funding for space technologies with civil and military applications, Canadian Space Agency President Lisa Campbell said at the International Astronautical Congress here. “Satellite servicing, refueling, sustainable access to orbit, advanced robotics, artificial intelligence applications, critical deep space systems and cybersecurity have applications for defense but […]\nThe post Canadian Space Agency offers funding for dual-use technologies appeared first on SpaceNews.",
    "published_at": "2025-09-30T11:40:21Z",
    "updated_at": "2025-09-30T11:50:19.634207Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Canada’s recently announced defense industrial strategy provides funding for space technologies with civil and military applications. More than 13 million Canadian dollars will be awarded to 17 Canadian companies developing space technology with dual-use applications. The Canadian Space Agency will spend $5 million on projects that expand the use of satellite imagery and data."
  },
  {
    "id": 33341,
    "title": "Kayhan Space releases free software to speed up satellite visualization",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/kayhan-space-releases-free-software-to-speed-up-satellite-visualization/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/kayhan_1-scaled.jpg?fit=1024%2C535&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nOrbital traffic software firm Kayhan Space released a free online tool Sept. 30 that it says will help researchers and developers visualize massive satellite catalogs, without the sluggish performance that often slows them down.\nThe post Kayhan Space releases free software to speed up satellite visualization appeared first on SpaceNews.",
    "published_at": "2025-09-30T11:02:59Z",
    "updated_at": "2025-09-30T11:10:20.728798Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Oriental traffic software firm Kayhan Space released a free online tool Sept. 30. The company says it will help researchers and developers visualize massive satellite catalogs. The browser-based sgp4.gl software library enables users to explore thousands of satellites in real-time. Select an option to continue:. Select a date and time, then select a location. Select an item and a date. Then, select a time and a location, and select an item to continue. Finally, choose a location and a time, and then choose a time."
  },
  {
    "id": 33340,
    "title": "Axiom Space taps Portuguese physiologist as first ‘Project Astronaut’",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/30/axiom-space-taps-portuguese-physiologist-as-first-project-astronaut/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/09/20250929_COM_ProjectAstronaut.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "Emiliano Ventura will not only help develop a new astronaut training “pilot program,” but also may be assigned to a future commercial astronaut mission. ",
    "published_at": "2025-09-30T08:39:18Z",
    "updated_at": "2025-09-30T08:40:22.577826Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Emiliano Ventura, a Portuguese physiologist and director of the Motor & Sport Institute (MSI) Bio Performance Center, will be spearheading a new training program for Axiom Space. This pilot program is designed to test out a six-month astronaut training protocol, stemming from his background in physiology and sports science."
  },
  {
    "id": 33338,
    "title": "Government investment remains key to creating a circular space economy",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/government-investment-remains-key-to-creating-a-circular-space-economy/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/04/haven1-dragon.jpg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – Government demand continues to spur investment in commercial space stations, satellite servicing and space logistics, paving the way for more space asset reuse and repurposing, speakers said at the International Astronautical Congress here. “We see a steady increase in interest, primarily from defense, around the capabilities that we can provide but also […]\nThe post Government investment remains key to creating a circular space economy appeared first on SpaceNews.",
    "published_at": "2025-09-30T08:09:37Z",
    "updated_at": "2025-09-30T08:10:32.630714Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Government demand continues to spur investment in commercial space stations, satellite servicing. Atmos Space Cargo changed its business model in response to demand for microgravity research. Vast Space executives are less focused on creating demand than on cutting costs. every month. Get unlimited access to SpaceNews.com now. As low as $5 per week * Cancel anytime. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By creating a SpaceNews.com account, you acknowledge that you have read our privacy policy and agree to our terms of terms and conditions. Select an option to continue:"
  },
  {
    "id": 33339,
    "title": "Firefly Alpha booster destroyed in ground test",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/firefly-alpha-booster-destroyed-in-ground-test/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/alpha7and8.jpeg?fit=1024%2C643&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe booster that was to launch the return-to-flight mission of Firefly Aerospace’s Alpha rocket was destroyed in testing Sept. 29, dealing another setback to the vehicle program.\nThe post Firefly Alpha booster destroyed in ground test appeared first on SpaceNews.",
    "published_at": "2025-09-30T08:08:09Z",
    "updated_at": "2025-09-30T08:10:32.681736Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Firefly Aerospace's Alpha rocket booster destroyed in testing Sept. 29. Company says all personnel involved in the incident were safe. Third-party video showed an explosion on the test stand followed by a second explosion. Firefly had planned the launch for some time in the fourth quarter but had not disclosed a date. SpaceNews.com is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Sign in by entering the code we sent to , or clicking the magic link in the email. You acknowledge that you have read our privacy policy and agree to our terms and conditions."
  },
  {
    "id": 33337,
    "title": "China sends experimental Shiyan-30 satellites into orbit as launch cadence intensifies",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-sends-experimental-shiyan-30-satellites-into-orbit-as-launch-cadence-intensifies/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Shiyan30-01-02-CZ2D-XSLC-29sept2025-CASC.jpg?fit=1024%2C681&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA Long March 2D rocket sent a new set of experimental satellites into orbit late Sunday, capping an intense month of Chinese launch activities.\nThe post China sends experimental Shiyan-30 satellites into orbit as launch cadence intensifies appeared first on SpaceNews.",
    "published_at": "2025-09-30T05:20:26Z",
    "updated_at": "2025-09-30T05:30:56.565903Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A Long March 2D rocket sent a new set of experimental satellites into orbit late Sunday. The satellites are primarily used for testing and verifying Earth observation technology. The launch was China’s 10th launch of September, marking one of the most active calendar months for Chinese spaceflight. Andrew Jones has written for National Geographic, New Scientist, Smithsonian Magazine, Sky... More by Andrew Jones all dispatches. Register now to get 2 more free articles every month. You’ll also receive our weekly SpaceNews This Week newsletter every Friday. Sign in to an existing account Get unlimited access to SpaceNews.com now."
  },
  {
    "id": 33336,
    "title": "No Deal Yet To Avert Shutdown Tomorrow Night",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/no-deal-yet-to-avert-shutdown-tomorrow-night/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/Cantwell-rpt-cover-280x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "President Trump and congressional leaders left their meeting at the White House this afternoon with no deal to avert a government shutdown at midnight tomorrow night. If nothing changes, agencies […]",
    "published_at": "2025-09-30T03:09:15Z",
    "updated_at": "2025-09-30T03:10:21.074142Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Trump and congressional leaders left their meeting at the White House this afternoon with no deal to avert a government shutdown at midnight tomorrow night. If nothing changes, agencies like NASA will have to pause all non-essential operations at 12:01 am Wednesday after FY2025 ends with no appropriations for FY2026. House Republicans passed a “clean” Continuing Resolution (CR) on September 19 to keep the government operating at full strength through November 21. The House can pass legislation with a simple majority, but the Senate needs 60 votes to pass this type of bill. Shutdowns are caused by a lapse in appropriations and impact activities funded in the 12 appropriations bills. During a shutdown, essential operations including those to protect life and property continue, although workers are not paid until the shutdown ends. At NASA, operations of the International Space Station, for example, will not be affected."
  },
  {
    "id": 33335,
    "title": "Report claims NASA taking illegal steps to implement budget proposal",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/report-claims-nasa-taking-illegal-steps-to-implement-budget-proposal/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/07/nasaprotest-20250630.jpeg?fit=1024%2C671&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nAs the federal government nears a potential shutdown, a report by Senate Democrats alleges that NASA is already taking steps in to carry out the administration’s proposed budget.\nThe post Report claims NASA taking illegal steps to implement budget proposal appeared first on SpaceNews.",
    "published_at": "2025-09-30T01:47:32Z",
    "updated_at": "2025-09-30T01:50:20.160924Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Senate Democrats say NASA is taking steps in to carry out the administration's proposed budget. The budget proposal sought a nearly 25% cut in NASA’s overall budget in 2026. Appropriations bills pending in the House and Senate largely reject that cut. The report comes as NASA and the rest of the federal government faces a potential shutdown. Jeff Foust has a Ph.D. in planetary sciences from the Massachusetts Institute of Technology. He also has a bachelor’s degree with honors in geophysics and planetary science... More by Jeff Foust all dispatches >> all jobs >> Back to top Register now to get 2 more free articles every month."
  },
  {
    "id": 33334,
    "title": "Curiosity Blog, Sols 4668-4674: Winding Our Way Along",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4668-4674-winding-our-way-along/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/september/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04671_opgs_edr_ncam_NLB_812159242EDR_F1190486NCAM00293M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Alex Innanen, Atmospheric Scientist at York University Earth planning date: Friday, Sept. 26, 2025 We are continuing through the boxwork region, taking a twisty-turny path along the ridges (many of which are conveniently Curiosity-sized). One thing we’re keeping an eye out for is our next drill location in one of the hollows. Our […]",
    "published_at": "2025-09-30T00:13:24Z",
    "updated_at": "2025-09-30T01:10:08.999774Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "We are continuing through the boxwork region, taking a twisty-turny path along the ridges. One thing we’re keeping an eye out for is our next drill location in one of the hollows. The end of the cloudy season does bring about the start of the dusty season."
  },
  {
    "id": 33333,
    "title": "Ground testing anomaly destroys Firefly Aerospace’s Alpha booster intended for next flight",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/30/ground-testing-anomaly-destroys-firefly-aerospaces-alpha-booster-intended-for-next-flight/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/09/20250929_Firefly_Alpha_explosion.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The anomaly came about a month after the FAA issued a Return to Flight determination for Firefly’s Alpha rockets following an anomaly experienced during Alpha Flight 6 in April. ",
    "published_at": "2025-09-30T00:02:49Z",
    "updated_at": "2025-09-30T00:10:25.253400Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The booster designated for Alpha Flight 7 “experienced an event that resulted in a loss of the stage,” the company said in a statement. A week before the incident, CEO Jason Kim said he expected Firefly to resume launches in the “coming weeks” Firefly Aerospace launched its Alpha rocket Friday after a launch attempt on Wednesday was scrubbed by bad weather. During Flight 4, also known as “Fly the Lightning,” Firefly saw a guidance, navigation and control (GNC) issue on the rocket’s second stage that prevented it from achieving its planned orbit."
  },
  {
    "id": 33332,
    "title": "Launch Roundup: Falcon 9 launches Starlink and Kuiper satellites",
    "authors": [
      {
        "name": "Martin Smith",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/launch-roundup-092925/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2023/11/Nov.-3-2023-Falcon-9-Starlink-6-26-Streak-Shot.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX is scheduled to launch up to three times this week, with each mission planned…\nThe post Launch Roundup: Falcon 9 launches Starlink and Kuiper satellites appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-29T21:04:33Z",
    "updated_at": "2025-09-29T21:10:12.520766Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is scheduled to launch up to three times this week, with each mission planned to deploy internet communications satellites into low-Earth orbit. China kicked off the week’s launch manifest, for those in UTC, with the launch of its 100th Chang Zheng 2D rocket in the early hours of Monday morning. SpaceX will launch its third and final batch of satellites for Amazon’s Project Kuiper constellation. The mission is currently set to liftoff on Friday, Oct. 3, at 11:43 PM EDT (06:30 UTC on October 4), in the middle of a short 27-minute launch window. Onboard will be 28 more Starlink v2 Mini satellites, bound for an orbit at an altitude of 595 km, inclined at 53 degrees. Booster B1097 will make its second flight, having debuted only weeks ago at the start of September, launching a mission for Starlink's Group 17 shell.  NASASpaceflight.com will be taking part in the 25th anniversary of the first space shuttle mission in September 2025. The space shuttle program will take part in a series of missions over the course of 15 years. The first mission will take place on September 22, 2025, with the second and final mission scheduled for September 23, 2025."
  },
  {
    "id": 33330,
    "title": "New File Download Process for PSI Large Requests",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/uncategorized/new-file-download-process-for-large-requestspsi-new-file-download-process/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/bps/bps-general/bps-data_osdr_psi/PSI_NewFileDownload_pic1.jpg",
    "news_site": "NASA",
    "summary": "A recent update to the PSI database improves how large dataset downloads are handled, resulting in more efficient processing for users. Download requests larger than 1GB are now delivered via email, rather than downloading directly from the website. This allows the system to prepare your files in the background so you can continue working without […]",
    "published_at": "2025-09-29T18:22:13Z",
    "updated_at": "2025-09-29T19:10:08.040500Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A recent update to the PSI database improves how large dataset downloads are handled. Download requests larger than 1GB are now delivered via email, rather than downloading directly from the website. This allows the system to prepare your files in the background so you can continue working without delays."
  },
  {
    "id": 33331,
    "title": "Joe A. Adam Presents Ring Sheared Drop (RSD) Research at 2025 ISSRDC",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/uncategorized/rsd-presented-at-issrdc/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/bps/bps-general/bps-data_osdr_psi/RSD_Image_PSIarticle.tif",
    "news_site": "NASA",
    "summary": "At the virtual 2025 ISS Research and Development Conference (ISSDRC), Joe A. Adam of Rensselaer Polytechnic Institute, presented the topic titled “Surface Science in Microgravity – Fluid Geometry in the Ring-Sheared Drop,” presented to a broad audience from academia and the scientific community during the Physical Sciences and Materials Development session. Dr. Adam provided a […]",
    "published_at": "2025-09-29T18:09:11Z",
    "updated_at": "2025-09-29T19:10:08.133862Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Ring Sheared Drop (RSD) enables researchers to isolate shear-induced aggregation processes relevant to neurodegenerative diseases such as Alzheimer's and Parkinson's. The RSD's custom camera configuration has enabled a novel fluid characterization technique known as Particle Tracking Velocimetry (PTV)"
  },
  {
    "id": 33326,
    "title": "Hubble Surveys Cloudy Cluster",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/hubble-surveys-cloudy-cluster/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/hubble-lmc-n44c-potw2536a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image released on Sept. 12, 2025, features a cloudy starscape from an impressive star cluster. This scene is in the Large Magellanic Cloud, a dwarf galaxy situated about 160,000 light-years away in the constellations Dorado and Mensa. With a mass equal to 10–20% of the mass of the Milky Way, the Large […]",
    "published_at": "2025-09-29T16:00:00Z",
    "updated_at": "2025-09-29T16:00:09.140198Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Large Magellanic Cloud is a dwarf galaxy situated about 160,000 light-years away. It is home to several massive stellar nurseries where gas clouds coalesce into new stars. This image marries observations made roughly 20 years apart, a testament to Hubble’s longevity."
  },
  {
    "id": 33325,
    "title": "Astronaut Candidates Get to Work at Johnson Space Center",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/astronaut-candidates-get-to-work-at-johnson-space-center/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/jsc2023e006587.jpg",
    "news_site": "NASA",
    "summary": "NASA announced its newest class of astronaut candidates on Sept. 22, 2025, at the agency’s Johnson Space Center in Houston. After the welcome ceremony, the 10 highly qualified individuals rolled up their sleeves and prepared for the next step in their journey to the stars: nearly two years of training to become flight-eligible for missions […]",
    "published_at": "2025-09-29T15:08:41Z",
    "updated_at": "2025-09-29T15:10:06.506932Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA announced its newest class of astronaut candidates on Sept. 22, 2025. They will undergo nearly two years of training to become flight-eligible for missions to low Earth orbit, the Moon, and ultimately, Mars. Each candidate will receive flight training, learning to pilot or improving their current piloting skills through the T-38 supersonic jet. Many members of NASA’s active astronaut corps emphasize that the learning does not stop when astronaut candidate training ends. As NASA astronaut Frank Rubio, class mentor, told the group, “You’ll become part of a legacy of those who trained before you, continuing the adventure they started”"
  },
  {
    "id": 33323,
    "title": "NASA’s Webb Telescope Studies Moon-Forming Disk Around Massive Planet",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/centers-and-facilities/goddard/nasas-webb-telescope-studies-moon-forming-disk-around-massive-planet/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/09/STScI-01K6196E18EPYF8RDEAQVA01Y3.png",
    "news_site": "NASA",
    "summary": "NASA’s James Webb Space Telescope has provided the first direct measurements of the chemical and physical properties of a potential moon-forming disk encircling a large exoplanet. The carbon-rich disk surrounding the world called CT Cha b, which is located 625 light-years away from Earth, is a possible construction yard for moons, although no moons are […]",
    "published_at": "2025-09-29T14:00:00Z",
    "updated_at": "2025-09-29T14:26:02.676951Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "d0fa4bb2-80ea-4808-af08-7785dde53bf6",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "NASA's James Webb Space Telescope has provided the first direct measurements of the chemical and physical properties of a potential moon-forming disk encircling a large exoplanet. The carbon-rich disk surrounding the world called CT Cha b, which is located 625 light-years away from Earth, is a possible construction yard for moons. Webb is an international program led by NASA with its partners, ESA (European Space Agency) and CSA (Canadian Space Agency). Webb is solving mysteries in our solar system, looking beyond to distant worlds around other stars. To learn more about Webb, visit: https://science.nasa.gov/webb"
  },
  {
    "id": 33328,
    "title": "NASA’s Webb Telescope Studies Moon-Forming Disk Around Massive Planet",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/webb/nasas-webb-telescope-studies-moon-forming-disk-around-massive-planet/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/09/STScI-01K6196E18EPYF8RDEAQVA01Y3.png",
    "news_site": "NASA",
    "summary": "NASA’s James Webb Space Telescope has provided the first direct measurements of the chemical and physical properties of a potential moon-forming disk encircling a large exoplanet. The carbon-rich disk surrounding the world called CT Cha b, which is located 625 light-years away from Earth, is a possible construction yard for moons, although no moons are […]",
    "published_at": "2025-09-29T14:00:00Z",
    "updated_at": "2025-09-29T17:10:07.957600Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's James Webb Space Telescope has provided the first direct measurements of the chemical and physical properties of a potential moon-forming disk encircling a large exoplanet. The carbon-rich disk surrounding the world called CT Cha b, which is located 625 light-years away from Earth, is a possible construction yard for moons. Webb is an international program led by NASA with its partners, ESA (European Space Agency) and CSA (Canadian Space Agency). Webb is solving mysteries in our solar system, looking beyond to distant worlds around other stars. To learn more about Webb, visit: https://science.nasa.gov/webb"
  },
  {
    "id": 33327,
    "title": "Startup’s radiation shield tech could bring high-performance AI chips to space",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/startups-radiation-shield-tech-could-bring-high-performance-ai-chips-to-space/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/1751485765797-e1759077973557.jpeg?fit=1014%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nUnder a $4 million ‘TACFI’ contract, Cosmic Shielding will develop a tool to predict the performance in orbit of radiation-shielded AI computing chips and other electronics\nThe post Startup’s radiation shield tech could bring high-performance AI chips to space appeared first on SpaceNews.",
    "published_at": "2025-09-29T14:00:00Z",
    "updated_at": "2025-09-29T16:40:20.474666Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A startup named Cosmic Shielding says it has found a way to close the technology gap that limits how much computing power satellites can carry into orbit. The Atlanta-based company developed a lightweight nanocomposite, branded Plasteel. Radiation is one of the main reasons satellites still rely on radiation-hardened chips that are often five to 10 generations behind the latest commercial designs. Cosmic Shielding is currently based in Atlanta but plans to relocate to Huntsville, Alabama. The startup has drawn high-profile advisors: former Pentagon officials Lisa Porter and Michael Griffin have joined its board. “We now have about seven active systems in space. We have about 10 scheduled for the next 12 months,” Barghouty said."
  },
  {
    "id": 33324,
    "title": "Webb studies moon-forming disc around massive planet",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_studies_moon-forming_disc_around_massive_planet",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/illustration_of_moon-forming_disc/26889846-1-eng-GB/Illustration_of_moon-forming_disc_card_full.jpg",
    "news_site": "ESA",
    "summary": "The NASA/ESA/CSA James Webb Space Telescope has provided the first direct measurements of the chemical and physical properties of a potential moon-forming disc encircling a large exoplanet. The carbon-rich disc surrounding the world called CT Cha B, which is located 625 light years away from Earth, is a possible construction yard for moons, although no moons are detected in the Webb data. The disc offers insight into how the moons of Solar System gas giants like Jupiter might have formed.",
    "published_at": "2025-09-29T14:00:00Z",
    "updated_at": "2025-09-29T14:25:52.895763Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "d0fa4bb2-80ea-4808-af08-7785dde53bf6",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The carbon-rich disc surrounding the world called CT Cha B, which is located 625 light years away from Earth, is a possible construction yard for moons. The disc offers insight into how the moons of Solar System gas giants like Jupiter might have formed. Our Solar System contains eight major planets, and more than 400 known moons orbiting six of these planets. In the coming year, the team will use Webb to perform a comprehensive survey of similar objects to better understand the diversity of physical and chemical properties in the discs around young planets. The insights could be useful as our Jupiter Icy Moons Explorer ( Juice ) makes its way to Jupiter, and as we prepare a future mission to orbit and land on Saturn's moon Enceladus."
  },
  {
    "id": 33321,
    "title": "A perspective on space: Preparing for 2075",
    "authors": [
      {
        "name": "Martin Sweeting",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/a-perspective-on-space-preparing-for-2075/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Torus_Interior_AC75-2621_5718-scaled.jpg?fit=1024%2C810&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nRecognizing that space is now an integral component of present-day society, the Royal Society (the U.K. academy of sciences) has recently completed a report that explores the potential implications of space activities by 2075, aiming to stimulate discussion without predicting specific outcomes. It highlights the transformative impact of space exploration on industry, society and culture, […]\nThe post A perspective on space: Preparing for 2075 appeared first on SpaceNews.",
    "published_at": "2025-09-29T13:00:00Z",
    "updated_at": "2025-09-29T13:10:18.698866Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The next decades will see increased exploration beyond near-Earth orbit, potentially establishing long-term bases on the moon and Mars. Advances in large reusable rockets, single-stage-to-orbit spaceplanes, and green propellants will both dramatically lower costs and increase access to orbit. Robotic and autonomous systems will continue to lead space exploration. Near-Earth and cis-lunar space is already a geopolitical arena, with military satellites and anti-satellite weapons signalling increasing potential for space-based conflict. Robust protocols, starting as guidelines like the Astra Carta, are essential to ensure equitable resource access, reliable communication and conflict prevention. Martin Sweeting has pioneered academic techniques and commercial applications of small satellites since the 1980s. He chaired the... More by Martin Sweeting all dispatches >> all jobs >> Back to top Register now to get 2 more free articles every month. You’ll also receive our weekly SpaceNews This Week newsletter every Friday."
  },
  {
    "id": 33322,
    "title": "IAC 2025 - One-to-one with ESA Director General Josef Aschbacher",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/09/IAC_2025_-_One-to-one_with_ESA_Director_General_Josef_Aschbacher",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/09/iac_2025_-_one-to-one_with_esa_director_general_josef_aschbacher/26890197-1-eng-GB/IAC_2025_-_One-to-One_with_ESA_Director_General_Josef_Aschbacher_card_full.png",
    "news_site": "ESA",
    "summary": "Watch the one-to-one interview with Josef Aschbacher, Director General of the European Space Agency (ESA), extracted from Plenary 1 of the 76th International Astronautical Congress (IAC 2025). In this session, he shares his insights into ESA's strategic vision.",
    "published_at": "2025-09-29T12:20:00Z",
    "updated_at": "2025-09-29T13:50:13.935967Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "One-to-one interview with Josef Aschbacher, Director General of the European Space Agency. In this session, he shares his insights into ESA's strategic vision. Watch the interview from Plenary 1 of the 76th International Astronautical Congress (IAC 2025)"
  },
  {
    "id": 33320,
    "title": "China’s Geovis Insighter Technology to launch SSA constellation",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/chinas-geovis-insighter-technology-to-launch-ssa-constellation/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_1screenshot_2025-09-29_at_124641-pm.png?fit=879%2C457&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – A Chinese company plans to establish a constellation of 144 space situational awareness (SSA) satellites in low-Earth orbit. Two experimental satellites will be launched in April, followed […]\nThe post China’s Geovis Insighter Technology to launch SSA constellation appeared first on SpaceNews.",
    "published_at": "2025-09-29T12:18:10Z",
    "updated_at": "2025-09-29T12:20:19.232548Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Chinese company plans to establish a constellation of 144 space situational awareness (SSA) satellites. Two experimental satellites will be launched in April, followed by 12 more SSA satellites by the end of 2026. Geovis Insighter Technology Co. will provide data to serve commercial companies."
  },
  {
    "id": 33319,
    "title": "Moog Completes High-Velocity Propulsion Systems, Begins Next Phase of Spacecraft Integration",
    "authors": [
      {
        "name": "Moog Inc.",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/moog-completes-high-velocity-propulsion-systems-begins-next-phase-of-spacecraft-integration/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/12/Moog_logo_maroon.png?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nEast Aurora, NY – Moog Inc. (NYSE: MOG.A and MOG.B), a worldwide designer, manufacturer and systems integrator of high-performance precision motion and fluid controls and control systems announces the completion […]\nThe post Moog Completes High-Velocity Propulsion Systems, Begins Next Phase of Spacecraft Integration appeared first on SpaceNews.",
    "published_at": "2025-09-29T12:00:00Z",
    "updated_at": "2025-09-29T12:00:29.328048Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33318,
    "title": "ESA and Avio to study reusable upper stage",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/esa-and-avio-to-study-reusable-upper-stage/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/esa-avio-iac25.jpeg?fit=1024%2C702&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe European Space Agency and Avio have signed a contract to begin design work on a reusable upper stage for future Vega or other European rockets.\nThe post ESA and Avio to study reusable upper stage appeared first on SpaceNews.",
    "published_at": "2025-09-29T10:56:08Z",
    "updated_at": "2025-09-29T11:00:22.737151Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency and Avio have signed a contract to begin design work on a reusable upper stage. The two-year contract is worth 40 million euros ($47 million) The stage could potentially be used on a future version of Vega but also on other European rockets. ArianeGroup unveiled a concept called the Smart Upper Stage for Innovative Exploration. Select an option to continue:. Select a date and time, then select a location. Select an item and a date. Then, select a time and a location, and select an item to continue. Finally, choose a location and a time, and then choose a time."
  },
  {
    "id": 33317,
    "title": "Avio Wins €40M ESA Contract to Design Reusable Upper Stage Demo",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/avio-wins-e40m-esa-contract-to-design-reusable-upper-stage-demo/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/Avio-Wins-ESA-Contract-to-Develop-Reusable-Rocket-Upper-Stage.webp",
    "news_site": "European Spaceflight",
    "summary": "The European Space Agency has awarded Italian rocket builder Avio a €40 million contract to design a reusable rocket stage demonstrator. ESA first published a call for the Phase 1 development of a reusable rocket upper stage in March 2024. This initial phase focused on the “identification of the technology-maturation needs for the reusable upper […]\nThe post Avio Wins €40M ESA Contract to Design Reusable Upper Stage Demo appeared first on European Spaceflight.",
    "published_at": "2025-09-29T10:54:28Z",
    "updated_at": "2025-09-29T11:00:14.914319Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency has awarded a €40 million contract to Avio to design a reusable rocket stage demonstrator. Avio will complete the demonstrator mission’s “system requirements and technological solutions, ending with a preliminary design for both the flight and ground segments”"
  },
  {
    "id": 33316,
    "title": "ESA and Avio sign contract for a reuseable upper stage demonstration mission",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Space_Transportation/ESA_and_Avio_sign_contract_for_a_reuseable_upper_stage_demonstration_mission",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/esa_and_avio_signature_for_a_reuseable_upper_stage_demonstration_mission/26889300-2-eng-GB/ESA_and_Avio_signature_for_a_reuseable_upper_stage_demonstration_mission_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-29T07:17:00Z",
    "updated_at": "2025-09-29T07:40:11.727485Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Space transportation is moving towards frequent reusable launchers supporting an industrial ecosystem around Earth. In the coming decades, the European Space Agency (ESA) foresees transportation hubs in orbit around our planet providing logistic services much like airports or train stations on Earth. Frequent flights to space would benefit from completely reusable rockets."
  },
  {
    "id": 33315,
    "title": "Italy’s crossroads: build its own satellites or lean on Starlink while waiting for IRIS²",
    "authors": [
      {
        "name": "Emma Gatti",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/italys-crossroads-build-its-own-satellites-or-lean-on-starlink-while-waiting-for-iris%c2%b2/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_iris_test.png?fit=879%2C433&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nMILAN – A report from Italy’s space policy office questioned whether the country is underrepresented in the IRIS² program, the European Union’s planned public-private communication constellation for low and medium earth orbit, while acknowledging SpaceX has offered to provide Starlink services for the country. Combined, the two points raised new questions about Italy’s position on Starlink. Those […]\nThe post Italy’s crossroads: build its own satellites or lean on Starlink while waiting for IRIS² appeared first on SpaceNews.",
    "published_at": "2025-09-29T03:00:00Z",
    "updated_at": "2025-09-29T03:02:06.584231Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A report from Italy’s space policy office questioned whether the country is underrepresented in the IRIS² program. It also acknowledged SpaceX has offered to provide Starlink services for the country. The two points raised new questions about Italy's position on Starlink. Italy must decide whether to push ahead with a national low-Earth orbit dual-use telecommunications constellation. Italy doesn’t view Starlink as an alternative to IRIS² but rather as a temporary integrative solution until Europe’s system becomes operative. A decision on whether to pursue a national constellation or rely on Starlink is expected later this year. The leaked report closes with a broader reflection on the strategic balance between Europe and the U.S."
  },
  {
    "id": 33314,
    "title": "Hubble observes dead star devouring Pluto-like object",
    "authors": [
      {
        "name": "Haygen Warren",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/hubble-white-dwarf-pluto/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/STScI-01K4FHRVYTEF017J1HWGE8TPSF-e1759095392588.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "With help from NASA’s Hubble Space Telescope in low-Earth orbit, scientists recently observed a Pluto-like…\nThe post Hubble observes dead star devouring Pluto-like object appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-28T22:34:31Z",
    "updated_at": "2025-09-28T22:40:15.631130Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "With help from NASA’s Hubble Space Telescope in low-Earth orbit, scientists recently observed a Pluto-like object being “eaten” by its host star. The hungry star is a white dwarf — the dense, stellar core left behind after a low-mass star dies and blows away its outer layers. The white dwarf observed by Hubble is about the size of Earth but much heavier, at around half the mass of our Sun. The white dwarf was likely once a Sun-like star that hosted a suite of planets and circumstellar disks similar to the Kuiper Belt. As the fragments fall onto the white dwarf, the star accretes them, emitting primarily ultraviolet light and very little visible light. The team is planning to continue their observations of hungry white dwarfs in the infrared with the James Webb Space Telescope. NASA/Tim Pyle (NASA/JPL-Caltech)    ©2005-2025 - NASASpaceflight.com September 22, 2025 to September 15, 2025 September 11, 2025September 8, 2025, 2025 August 26, 2025 and September 3, 2025. September 21, 2025 May 18, 2024 December 3, 2023 April 26,2023 March 28, 2024 August 20, 2025 June 28, 2025 April 28, 2024 April 11, 2024 September 7, 2025"
  },
  {
    "id": 33313,
    "title": "Pentagon awards new contracts to boost solid rocket motor output",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/pentagon-awards-new-contracts-to-boost-solid-rocket-motor-output/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/04/rsz_15772118-1.jpg?fit=879%2C456&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nX-Bow wins $191 million contract as U.S. seeks to diversify supply chain; Americarb, General Dynamics get Defense Production Act funding for nozzle materials\nThe post Pentagon awards new contracts to boost solid rocket motor output appeared first on SpaceNews.",
    "published_at": "2025-09-28T22:08:56Z",
    "updated_at": "2025-09-28T22:10:26.063912Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Pentagon on Sept. 26 announced three contracts aimed at beefing up U.S. production of solid rocket motors. One award, a four-year, $191.3 million contract, went to X-Bow Launch Systems of Albuquerque. Solid rocket motors are self-contained propulsion units used for tactical missiles, hypersonic weapons. Select an option to continue:. Select a date and time, then select a location. Select an item and a date. Then, select a time and a location, and select an item to continue. Finally, choose a location and a time, and then choose a time."
  },
  {
    "id": 33311,
    "title": "Eartheye to offer tasking of satellites looking up and down",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/eartheye-to-offer-tasking-of-satellites-looking-up-and-down/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_3capabillity_announcement__1.png?fit=879%2C621&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia — Eartheye Space will begin offering self-service tasking of satellites looking into space in addition to sensors focused on Earth, the startup based in Singapore and Australia announced Sept. 29 at the International Astronautical Congress here. “Customers on a single platform in a single workflow can decide to look down or look up,” […]\nThe post Eartheye to offer tasking of satellites looking up and down appeared first on SpaceNews.",
    "published_at": "2025-09-28T22:00:00Z",
    "updated_at": "2025-09-28T22:00:30.693320Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33312,
    "title": "Solstar wins NASA contract to develop lunar Wi-Fi systems",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/solstar-wins-nasa-contract-to-develop-lunar-wi-fi-systems/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_solstar_wifi-tr_rover_render_05_one_wifi_final.jpg?fit=879%2C494&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia — Solstar Space announced a NASA contract Sept. 29 to develop commercial Wi-Fi access points for the space agency’s Artemis and Commercial Lunar Payload Services (CLPS) programs. Under the $150,000 Small Business Innovation Research award, Solstar will spend six months creating preliminary designs for Wi-Fi access points for human landing systems, lunar rovers, […]\nThe post Solstar wins NASA contract to develop lunar Wi-Fi systems appeared first on SpaceNews.",
    "published_at": "2025-09-28T22:00:00Z",
    "updated_at": "2025-09-28T22:00:30.805493Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Solstar Space announced a NASA contract Sept. 29 to develop commercial Wi-Fi access points. Solstar will spend six months creating preliminary designs for human landing systems. Lunar communications systems will have to withstand the moon’s thermal extremes. “Receiving this SBIR award is a milestone for Solstar and for space-based connectivity”"
  },
  {
    "id": 33310,
    "title": "What’s Happening in Space Policy September 28-October 4, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-september-28-october-4-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2024/11/John-Thune-240x300.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of September 28-October 4, 2025 and any insight we can offer about them. The congressional schedule is in flux. […]",
    "published_at": "2025-09-28T19:52:40Z",
    "updated_at": "2025-09-28T20:00:18.656943Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Congress has until midnight on Tuesday to reach a deal or there will be a partial government shutdown. President Trump agreed to meet tomorrow with congressional leaders of both parties. House Speaker Mike Johnson decided to keep the House out of session until at least October 1, forcing the Senate to either agree to his bill or cause a shutdown. NASA astronaut Chris Williams is getting ready to launch to the ISS on Soyuz MS-28 next month. Williams will be at Johnson Space Center and participate in a news conference to discuss what he’ll do during his eight-month assignment. Wednesday not only is the beginning of FY2026, but the 67th anniversary of when NASA opened its doors."
  },
  {
    "id": 33308,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/28/live-coverage-spacex-to-launch-24-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb-5/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small-678x452.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 11-20 mission will see SpaceX’s Falcon 9 rocket fly on a south-easterly trajectory upon departure from Vandenberg Space Force Base. Liftoff from pad 4E is scheduled for 4:32 p.m. PDT (7:32 p.m. EDT / 2332 UTC).",
    "published_at": "2025-09-28T17:28:20Z",
    "updated_at": "2025-09-28T17:59:22.071383Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "ee1f78af-5240-4909-a6f1-54f03de8dd93",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The Starlink 11-20 mission is SpaceX’s 88th mission supporting its megaconstellation this year. The satellites were manufactured by Northrop Grumman and will provide both commercial broadband connectivity and military satellite communications in the northern polar region. If successful, this will be the 154th touch down for this vessel and the 513th booster landing to date."
  },
  {
    "id": 33309,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/28/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb-5/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small-678x452.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 11-20 mission will see SpaceX’s Falcon 9 rocket fly on a south-easterly trajectory upon departure from Vandenberg Space Force Base. Liftoff from pad 4E is scheduled for 4:32 p.m. PDT (7:32 p.m. EDT / 2332 UTC). ",
    "published_at": "2025-09-28T17:28:20Z",
    "updated_at": "2025-09-28T18:00:33.844854Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for its final, scheduled launch of September. The Starlink 11-20 mission will see 28 of SpaceX’s broadband internet satellites head into low Earth orbit. The Falcon 9 rocket will fly on a south-easterly trajectory upon liftoff. If successful, this will be the 154th touch down for this vessel and the 513th booster landing."
  },
  {
    "id": 33307,
    "title": "Galactic Energy secures $336 million, nears debut of new reusable and solid rockets",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/galactic-energy-secures-336-million-nears-debut-of-new-reusable-and-solid-rockets/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Pallas1-2nd-stage-static-fire-prep-Anhui-Sept2025-GalacticEnergy.jpg?fit=1024%2C713&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nBeijing-based Galactic Energy has raised what appears China’s largest disclosed round for a launch startup as it nears orbital test flights of new rockets.\nThe post Galactic Energy secures $336 million, nears debut of new reusable and solid rockets appeared first on SpaceNews.",
    "published_at": "2025-09-28T15:35:17Z",
    "updated_at": "2025-09-28T15:40:29.487608Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Beijing-based Galactic Energy has raised what appears China’s largest disclosed round for a launch startup. The company announced Series D financing of 2.4 billion yuan ($336 million) in a statement Sept. 28. The funding will be used for the Pallas series of reusable liquid propellant launchers and the Ceres-2 solid rocket. The rocket is an upgraded version of the Ceres-1. Launch will now take place “at an appropriate time” in the near future. The rocket was earlier slated for a test flight in the first half of the year. The Ceres-2 will have a payload capacity of 1,600 kg to 500-km LEO, and 1,300 kg to500-km SSO."
  },
  {
    "id": 33306,
    "title": "IAI’s Game-Changing Communication Satellites: Revolutionizing Global Connectivity",
    "authors": [
      {
        "name": "Tsuri Shemer – IAI Space Marketing & Business Development",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/iais-game-changing-communication-satellites-revolutionizing-global-connectivity/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/09/Communications-Satellite-Family-2.jpg?fit=1024%2C724&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nUnmatched Performance and Security: How IAI’s Compact Communication Satellites are Reshaping Global Connectivity In our ever-connected world, communication satellites play a vital role in bridging distances, empowering global communication, and […]\nThe post IAI’s Game-Changing Communication Satellites: Revolutionizing Global Connectivity appeared first on SpaceNews.",
    "published_at": "2025-09-28T12:17:51Z",
    "updated_at": "2025-09-28T12:20:31.481635Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Israel Aerospace Industries (IAI) has emerged as a trailblazer, pushing the boundaries of satellite technology and transforming the way we communicate. IAI’s compact communication satellites provide unprecedented coverage, ensuring connectivity even in the most remote and underserved areas. These satellites are designed to be resilient against space debris and solar radiation, ensuring uninterrupted operations and longevity. IAI is redefining the future of space. IAI delivers turnkey, space-proven solutions tailored to mission success. Come meet IAI’s satellite experts at IAC 2025 – Booth #599, or contact us at iai-mth-sms@iai.co.il."
  },
  {
    "id": 33305,
    "title": "Blue Origin to increase New Shepard flight rate and consider new spaceports",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/blue-origin-to-increase-new-shepard-flight-rate-and-consider-new-spaceports/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/05/ns32-liftoff.jpeg?fit=1024%2C723&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nBlue Origin plans to significantly increase the launch rate of its New Shepard suborbital vehicle and is weighing the addition of new spaceports.\nThe post Blue Origin to increase New Shepard flight rate and consider new spaceports appeared first on SpaceNews.",
    "published_at": "2025-09-28T07:41:01Z",
    "updated_at": "2025-09-28T07:50:19.492943Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Blue Origin plans to significantly increase the launch rate of its New Shepard suborbital vehicle. The company is now launching nearly monthly, with seven New Shepard flights completed this year. Blue Origin’s goal is to scale up to “approximately weekly’ launches, enabled by three new New Shepard vehicles. SpaceNews.com is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Sign in by entering the code we sent to , or clicking the magic link in the email. You acknowledge that you have read our privacy policy and agree to our terms and conditions."
  },
  {
    "id": 33304,
    "title": "Purdue University to fly dedicated suborbital research mission with Virgin Galactic",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/purdue-university-to-fly-dedicated-suborbital-research-mission-with-virgin-galactic/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/purdue1.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nPurdue University will conduct a dedicated suborbital research flight with Virgin Galactic in 2027 carrying a professor, student and alumni.\nThe post Purdue University to fly dedicated suborbital research mission with Virgin Galactic appeared first on SpaceNews.",
    "published_at": "2025-09-28T01:57:45Z",
    "updated_at": "2025-09-28T02:00:22.151697Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Purdue University will conduct a dedicated suborbital research flight with Virgin Galactic in 2027. The flight, carrying five people, will be the first dedicated crewed sub Orbital research mission by a university. It will be led by Steven Collicott, a professor of aerospace engineering at Purdue. “I think the science leading the way in science is going to be pretty intensely exciting, and things happen pretty quick,” Collicott said. “That’s the only chance I’ll get to look out the windows. I look forward to that.”"
  },
  {
    "id": 33303,
    "title": "NASA Marshall director steps down",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-marshall-director-steps-down/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/NHQ202402280014-large.jpg?fit=1024%2C839&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe director of NASA’s Marshall Space Flight Center has abruptly stepped down, becoming the third NASA center director to leave in recent months.\nThe post NASA Marshall director steps down appeared first on SpaceNews.",
    "published_at": "2025-09-27T20:37:12Z",
    "updated_at": "2025-09-27T20:40:21.839856Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Joseph Pelfrey announced he would no longer serve as director of the Alabama center. He did not give a specific reason for his departure but suggested he was leaving to allow NASA leadership to select its own choice. He is the third NASA center director to leave in recent months."
  },
  {
    "id": 33302,
    "title": "China boosts broadband, IoT and weather satellite fleets with flurry of launches",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-boosts-broadband-iot-and-weather-satellite-fleets-with-flurry-of-launches/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Fengyun3H-CZ4C-YZ1S-JSLC-26sept2025-OS1.jpg?fit=1024%2C657&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA flurry of launch activity has seen China add to an Internet of Things constellation, loft new broadband satellites and boost its weather satellite fleet.\nThe post China boosts broadband, IoT and weather satellite fleets with flurry of launches appeared first on SpaceNews.",
    "published_at": "2025-09-27T15:38:43Z",
    "updated_at": "2025-09-27T15:40:22.639452Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A Long March 6A lifted off at 8:40 a.m. Eastern (1240 UTC) Sept. 27 from Taiyuan Satellite Launch Center in north China. The mission payloads are believed to be the 11th batch of Guowang broadband megaconstellation project. The launch came less than a day after China added to its Fengyun series of meteorological satellites. China is closing in on a new national record for launches in a calendar year ( currently 68, set in 2024 ). Of the launches, 56 have been successful, with the only failure coming in August. The next launch out of China is expected to be a Long March 2D rocket launching from Jiuquan early Sept. 29 UTC."
  },
  {
    "id": 33301,
    "title": "ArianeGroup Awards Contract for Components of 27 Ariane 6 Rockets",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/arianegroup-awards-contract-for-components-of-27-ariane-6-rockets/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/ArianeGroup-Awards-Contract-for-Components-of-27-Ariane-6-Rockets.webp",
    "news_site": "European Spaceflight",
    "summary": "ArianeGroup has contracted MT Aerospace to deliver key components for 27 Ariane 6 rockets, covering flights 16 through 42. Germany’s MT Aerospace is one of the Ariane 6 programme’s largest contractors, providing around 10% of the entire launch vehicle. The company supplies components for the cryogenic storage tanks and metallic structures of both the upper […]\nThe post ArianeGroup Awards Contract for Components of 27 Ariane 6 Rockets appeared first on European Spaceflight.",
    "published_at": "2025-09-27T06:22:59Z",
    "updated_at": "2025-09-27T06:30:13.116472Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "MT Aerospace is one of the Ariane 6 programme’s largest contractors, providing around 10% of the entire launch vehicle. The company supplies components for the cryogenic storage tanks and metallic structures of both the upper and core stages. MT Aerospace is responsible for producing the carbon-fibre-reinforced plastic tanks that will store liquid hydrogen and liquid oxygen."
  },
  {
    "id": 33300,
    "title": "‘Left of launch’ becomes central focus in next-generation missile defense",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/left-of-launch-becomes-central-focus-in-next-generation-missile-defense/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Screenshot-2025-09-26-at-5.42.47-PM.png?fit=1024%2C583&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nGen. Stephen Whiting: ‘Our missile defenses have done a good job during the most recent conflicts, but most of those are focused on terminal engagement, and we want to be able to push that engagement to the left and eventually left of launch.’\nThe post ‘Left of launch’ becomes central focus in next-generation missile defense appeared first on SpaceNews.",
    "published_at": "2025-09-26T22:05:47Z",
    "updated_at": "2025-09-26T22:10:23.547770Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "“Left of launch” refers to measures aimed at preventing or delaying missile launches. “We are seeing both the capacity and the capability of the threat missiles we’re now facing rapidly increase,” Gen. Stephen Whiting says. Whiting has been a proponent of closer “space-cyber-SOF” collaboration. The Air Force and the Space Force are studying options to field a new layer of AMTI satellites. “We want to be able to do a better job of helping to track those threats from space,” said Whiting. The discussions are taking place as the Pentagon embarks on an ambitious defense initiative. Companies will be challenged to design prototype SBI systems capable of intercepting missiles both within the atmosphere and after they enter space. “Like everyone in the industry, we’re following this,” Mitrevski said. � “We’m ready to provide solutions.”"
  },
  {
    "id": 33299,
    "title": "From City Lights to Moonlight: NASA Training Shows How Urban Parks Can Connect Communities with Space Science",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/learning-resources/for-professionals/courses-curriculums/from-city-lights-to-moonlight-nasa-training-shows-how-urban-parks-can-connect-communities-with-space-science/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/2025-0805-RiversofStarsandStories-30-moonactivity-sm-Brandi_Stewart.jpg",
    "news_site": "NASA",
    "summary": "When you think about national park and public land astronomy programs, you might picture remote locations far from city lights. But a recent NASA Earth to Sky training, funded by NASA’s Science Activation Program, challenges that assumption, demonstrating how urban parks, wildlife refuges, museums, and green spaces can be incredible venues for connecting communities with […]",
    "published_at": "2025-09-26T20:44:26Z",
    "updated_at": "2025-09-26T21:10:06.197393Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA Earth to Sky partnered with the National Park Service and U.S. Fish and Wildlife Service to deliver an innovative astronomy training program. The training empowered participants by affirming that everyone is an effective stargazer and night sky storyteller. The course also created a lasting community connection to NASA. Earth to Sky works with park interpreters and nonformal educators to share NASA space science. Learn more about how Science Activation connects NASA science experts, real content, and experiences with community leaders to do science in ways that activate minds and promote deeper understanding of our world and beyond."
  },
  {
    "id": 33298,
    "title": "NASA Awards Custodial, Landscaping Services Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-custodial-landscaping-services-contract/",
    "image_url": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2023/01/nasa-logo-web-rgb.png",
    "news_site": "NASA",
    "summary": "NASA has selected Melwood Horticultural Training Center Inc. of Upper Marlboro, Maryland, to provide custodial, janitorial, landscaping, and recycling services for the agency’s Goddard Space Flight Center in Greenbelt, Maryland. The Facilities Custodial and Landscaping award is a firm-fixed-price hybrid completion and indefinite-delivery/indefinite-quantity contract. The contract includes one 12-month base period and up to four […]",
    "published_at": "2025-09-26T20:00:00Z",
    "updated_at": "2025-09-26T20:10:06.963891Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Melwood Horticultural Training Center Inc. of Upper Marlboro, Maryland, will provide custodial, janitorial, landscaping, and recycling services for the agency's Goddard Space Flight Center. The contract includes one 12-month base period and up to four 12- months options with a potential contract value of approximately $36 million."
  },
  {
    "id": 33297,
    "title": "Beyond Gravity to supply robotic arm thrusters for Swissto12 small GEOs",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/beyond-gravity-to-supply-robotic-arm-thrusters-for-swissto12-small-geos/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/03/HummingSat-scaled.jpg?fit=1024%2C654&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nBeyond Gravity has secured a contract to deliver robotic arm thruster pointing mechanisms for the small satellites Swissto12 is building for geostationary orbit.\nThe post Beyond Gravity to supply robotic arm thrusters for Swissto12 small GEOs appeared first on SpaceNews.",
    "published_at": "2025-09-26T18:36:24Z",
    "updated_at": "2025-09-26T18:40:21.386788Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Swissto12 is building small satellites for geostationary orbit. Beyond Gravity has secured a contract to deliver robotic arm thruster pointing mechanisms. Multi-axis Appmax 3 arms will be longer than earlier models. Deliveries are slated between 2026 and 2027."
  },
  {
    "id": 33296,
    "title": "Preparation for East Coast Starship debut in 2026 continue to make progress",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/starship-cape-progress/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/SpaceXs-Robert-Road-Facility-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "As SpaceX prepares for Starship’s Flight 11 in October from Texas, significant progress is being…\nThe post Preparation for East Coast Starship debut in 2026 continue to make progress appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-26T18:24:55Z",
    "updated_at": "2025-09-26T18:30:21.182007Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The first of four M900F tower cranes that will be used to build the Starship Florida Giga bay has risen. Crews have nearly caught up in the construction timeline and have even diverted from it. SpaceX is rapidly expanding its Starship program, with teams working in parallel to conduct test flights. The launch mount for the LC-39A Starship Pad is not at that stage of construction. SpaceX may be taking a different approach, as it is expected to roll out in October with an LR13000 crane to be used for lifting it. There is still a lot of work to be completed on this pad, and it will likely not be operational until at least mid-2026.  NASASpaceflight.com is a nonprofit organization based in San Francisco, California. NASAS Spaceflight is dedicated to the advancement of space flight. The NASAS spaceflight program is funded by the National Aeronautics and Space Administration (NASAS) NASASSpaceflight is a 501(c)3 non-profit organization."
  },
  {
    "id": 33295,
    "title": "NASA Helps Connect Astronomers and Community Colleges Across the Nation",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/learning-resources/for-colleges-universities/nasa-helps-connect-astronomers-and-community-colleges-across-the-nation/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/Shapley_Images-Simon_Steel.jpg",
    "news_site": "NASA",
    "summary": "The NASA Community College Network (NCCN) and the American Astronomical Society (AAS) have teamed up to provide an exciting and impactful program that brings top astronomy researchers into the classrooms of community colleges around the United States. The Harlow Shapley Visiting Lectureship Program, named for astronomer Harlow Shapley (1885-1972), has a history dating back to […]",
    "published_at": "2025-09-26T17:18:17Z",
    "updated_at": "2025-09-26T18:10:04.392943Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA Community College Network (NCCN) and the American Astronomical Society (AAS) have teamed up to provide an exciting and impactful program that brings top astronomy researchers into the classrooms of community colleges. The Harlow Shapley Visiting Lectureship Program has a history dating back to the 1950s, when it provided support for a scientist to give a series of astronomy-themed lectures. NASA's Parker Solar Probe became the first spacecraft to fly through the corona of the Sun. NASA’s Juno spacecraft entered orbit around Jupiter in 2016, the first explorer to peer below the planet's dense clouds. Webb is the premier observatory of the next decade, serving thousands of astronomers worldwide."
  },
  {
    "id": 33293,
    "title": "Lunar Challenge Winner Tests Technology in NASA Thermal Vacuum Chamber",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/prizes-challenges-crowdsourcing-program/centennial-challenges/lunar-challenge-winner-tests-technology-in-nasa-thermal-vacuum-chamber/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/msfc-starpath-07-30-2025-joek-3-c28d90.jpg",
    "news_site": "NASA",
    "summary": "By Savannah Bullard One year after winning second place in NASA’s Break the Ice Lunar Challenge, members of the small business Starpath visited NASA’s Marshall Space Flight Center in Huntsville, Alabama, as part of their prize opportunity to test their upgraded lunar regolith excavation and transportation rover in the center’s 20-foot thermal vacuum chamber. The […]",
    "published_at": "2025-09-26T16:38:40Z",
    "updated_at": "2025-09-26T16:40:07.871475Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Small business Starpath won second place in NASA’s Break the Ice Lunar Challenge. The company built a four-wheeled rover capable of excavating, collecting, and hauling material under extremely harsh environmental conditions that simulate the lunar South Pole. Starpath staff spent about three days at NASA Marshall in August, testing their robot with excavation and mobility trials while collecting data."
  }
]