[
  {
    "id": 32675,
    "title": "Aurora Australis over Concordia station",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/Aurora_Australis_over_Concordia_station",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/aurora_australis_over_concordia_station/26843757-1-eng-GB/Aurora_Australis_over_Concordia_station_card_full.jpg",
    "news_site": "ESA",
    "summary": "The Aurora Australis, photographed over Concordia station in July 2025, during the ongoing solar activity maximum, the peak of the Sun's 11-year cycle. ",
    "published_at": "2025-08-27T08:00:00Z",
    "updated_at": "2025-08-20T08:50:11.122359Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Aurora Australis appears when charged particles from the Sun are guided by Earth’s magnetic field towards the polar regions. Concordia station, perched high on Antarctica’‘Dome C plateau, is one of the most remote research outposts on Earth. Each year, ESA sponsors a medical doctor to live and work at Concordia."
  },
  {
    "id": 32780,
    "title": "Live coverage: SpaceX to launch Falcon 9 rocket on rideshare mission from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/26/live-coverage-spacex-to-launch-falcon-9-rocket-on-rideshare-mission-from-vandenberg-sfb/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The mission features OHB Italia’s NAOS satellite along with seven other secondary satellites. SpaceX is targeting liftoff from pad 4E at Vandenberg Space Force Base at 11:53 a.m. PDT (2:53 p.m. EDT / 1853 UTC). ",
    "published_at": "2025-08-26T16:36:51Z",
    "updated_at": "2025-08-26T16:40:34.080511Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for its 37th Falcon 9 rocket launch from Vandenberg. The orbital flight features an Italian defense satellite along with nine other rideshare payloads. The mission featuring OHB Italia’s NAOS (National Advanced Optical System) spacecraft will fly on a southerly trajectory after taking off from Space Launch Complex 4 East. SpaceX’s Falcon 9 rocket disintegrated shortly after launch from Cape Canaveral on Sunday. This was the second of two back-to-back overnight launches. “We’re proud to continue enabling fast, reliable access to space for industry leaders like Capella Space, Pixxel and more,” Dhruva Space said."
  },
  {
    "id": 32779,
    "title": "Launch Roundup: Starship, NS-35, and Falcon 9 launches planned",
    "authors": [
      {
        "name": "Aaron McCrea",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/launch-roundup-08-25-25/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Gy7aFPMXMAAkg8X.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "Eight launches are scheduled this week by SpaceX, Blue Origin, and CSNA. CSNA will kick…\nThe post Launch Roundup: Starship, NS-35, and Falcon 9 launches planned appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-26T16:13:40Z",
    "updated_at": "2025-08-26T16:20:11.110850Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 10th flight of Starship is expected to liftoff on Aug. 26 at 6:30 PM CDT (23:30 UTC) The week’s first batch of Starlink satellites is launching into LEO on a Falcon 9. Blue Origin is scheduled to launch New Shepard on the NS-35 mission on August 27. Starlink Group 10-14 is launching on Aug. 30 at 7:38 AM EDT (11:38 UTC) from SLC-40 at CCSFS. This mission will carry 28 Starlink v2 Mini satellites to a LEO with a 53.16-degree inclination. The booster, B1077, will attempt to land on SpaceX’s autonomous droneship, Just Read the Instructions."
  },
  {
    "id": 32769,
    "title": "Reaching Out",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/reaching-out/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/msh1552-lg.jpg",
    "news_site": "NASA",
    "summary": "This image released on Aug. 20, 2025, combines new radio data from the Australia Telescope Compact Array with X-ray data from NASA’s Chandra X-ray Observatory. Chandra first released an image of this pulsar and its surrounding hand-shaped nebula in 2009. The new data provides a fresh view of this exploded star and its environment, which […]",
    "published_at": "2025-08-26T16:08:59Z",
    "updated_at": "2025-08-26T16:10:05.711054Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Image released on Aug. 20, 2025, combines new radio data from the Australia Telescope Compact Array with X-ray data from NASA. Chandra first released an image of this pulsar and its surrounding hand-shaped nebula in 2009. The new data provides a fresh view of this exploded star and its environment."
  },
  {
    "id": 32768,
    "title": "Google’s AI model just nailed the forecast for the strongest Atlantic storm this year",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/science/2025/08/googles-ai-model-just-nailed-the-forecast-for-the-strongest-atlantic-storm-this-year/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20252281710_GOES19-ABI-taw-GEOCOLOR-1800x1080-1.jpg",
    "news_site": "Arstechnica",
    "summary": "If they improve further, AI weather models may very well become the gold standard.",
    "published_at": "2025-08-26T14:43:41Z",
    "updated_at": "2025-08-26T14:50:13.036968Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Google unveiled a new model designed specifically to forecast the tracks and intensity of tropical cyclones. The \"Weather Lab\" model for cyclones was a bit of an unknown for meteorologists at its launch. Google's model beat the \"official\" track forecast from the National Hurricane Center. The fact that Google's model beat the consensus models is significant. From a forecast standpoint, the period of three to five days out is the most important. This is when important decisions about evacuations and other hurricane preparations need to be made. If these models improve further, they may very well become the gold standard for certain types of weather prediction."
  },
  {
    "id": 32766,
    "title": "The Exploration Company’s Nyx Spacecraft Passes Initial ISS Safety Review",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/the-exploration-companys-nyx-spacecraft-passes-initial-iss-safety-review/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/The-Exploration-Companys-Nyx-Spacecraft-Passes-Initial-ISS-Safety-Review.webp",
    "news_site": "European Spaceflight",
    "summary": "The Exploration Company’s reusable Nyx Earth spacecraft has passed Phase 1 of the International Space Station Safety Review, confirming that the spacecraft’s preliminary design meets all hazard-control requirements for visiting vehicles. Nyx Earth is being developed to ferry cargo and, eventually, crew, to and from low Earth orbit destinations. The company’s first mission to the […]\nThe post The Exploration Company’s Nyx Spacecraft Passes Initial ISS Safety Review appeared first on European Spaceflight.",
    "published_at": "2025-08-26T14:05:00Z",
    "updated_at": "2025-08-26T14:10:23.603558Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Exploration Company’s reusable Nyx Earth spacecraft has passed Phase 1 of the International Space Station Safety Review. Nyx is being developed to ferry cargo and, eventually, crew, to and from low Earth orbit destinations. The company's first mission to the ISS in 2028 will deliver 2,600 kilograms of supplies."
  },
  {
    "id": 32771,
    "title": "NASA Stennis Provides Ideal Setting for Range Operations",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/stennis/an-ideal-setting-for-range-operations/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2016/06/dsc-0992-range-airspace-operations-drone.jpg",
    "news_site": "NASA",
    "summary": "Think of NASA’s Stennis Space Center, and one likely thinks of rocket propulsion testing. The site has a long history of testing to support the nation’s space efforts, including the current Artemis program to send astronauts to the Moon to prepare for future human exploration of Mars. However, NASA Stennis also is working to become […]",
    "published_at": "2025-08-26T14:00:00Z",
    "updated_at": "2025-08-26T16:10:05.769362Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA Stennis has its own protected airspace, similar to how airports control the skies around them. It operates two main airspace zones – a propulsion testing area extending from ground level up to 12,000 feet for safely testing rocket engines. The centerpiece of the NASA Stennis marine range is its extensive 7.5-mile canal system. The NASA Stennis federal city already hosts more than 50 federal, state, academic, public, and private aerospace, technology, and research organizations. “NASA Stennis is open for business, and we want to provide a user-friendly range for operators to test vehicles,” Peterson said."
  },
  {
    "id": 32770,
    "title": "NASA Test Deploys Roman Space Telescope Solar Panels, ‘Visor’",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasa-test-deploys-roman-space-telescope-solar-panels-visor/",
    "image_url": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2023/01/nasa-logo-web-rgb.png",
    "news_site": "NASA",
    "summary": "On Aug. 7 and 8, NASA’s Nancy Grace Roman Space Telescope team assessed the observatory’s solar panels and a visor-like sunshade called the deployable aperture cover — two components that will be stowed for launch and unfold in space. Engineers confirmed their successful operation during a closely monitored sequence in simulated space-like conditions. On the […]",
    "published_at": "2025-08-26T14:00:00Z",
    "updated_at": "2025-08-26T16:10:05.751085Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Nancy Grace Roman Space Telescope team assessed observatory's solar panels and sunshade. Roman slated to launch no later than May 2027. Engineers confirmed successful operation during a closely monitored sequence in simulated space-like conditions. On the first day, Roman’s outer solar panels were deployed one at a time."
  },
  {
    "id": 32767,
    "title": "Four laser links over 300 million kilometres: ESA concludes daring optical communication campaign",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Operations/Four_laser_links_over_300_million_kilometres_ESA_concludes_daring_optical_communication_campaign",
    "image_url": "https://www.esa.int/extension/pillars/design/pillars/images/nebula.jpg",
    "news_site": "ESA",
    "summary": "Over the summer, the European Space Agency ran an optical communication demonstration campaign using two observatories on Earth and NASA’s Psyche mission. All four optical links were successful.",
    "published_at": "2025-08-26T13:38:00Z",
    "updated_at": "2025-08-26T15:04:59.757773Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "66133437-db31-4098-8e3e-cf34c8125f9b",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots of the U.S. for next week. Visit CNN.com/Travel each week for a new gallery of snapshots. Visit www.dailymail.co.uk/travel for the latest."
  },
  {
    "id": 32765,
    "title": "Time moves fast when you are preparing for liftoff!",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/Time_moves_fast_when_you_are_preparing_for_liftoff",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/time_moves_fast_when_you_are_preparing_for_liftoff/26847605-1-eng-GB/Time_moves_fast_when_you_are_preparing_for_liftoff_card_full.png",
    "news_site": "ESA",
    "summary": " ",
    "published_at": "2025-08-26T09:50:00Z",
    "updated_at": "2025-08-26T10:50:10.631509Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "MetOp-SG-A1 was launched aboard an Ariane 6 rocket from the European spaceport in French Guiana, on 13 August at 02:37 CEST (12 August 21:37 Kourou time) This new weather satellite also carries the Copernicus Sentinel-5 mission to deliver daily global data."
  },
  {
    "id": 32764,
    "title": "Gaia proves our skies are filled with chains of starry gatherings",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Gaia/Gaia_proves_our_skies_are_filled_with_chains_of_starry_gatherings",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2019/08/stellar_families_in_gaia_s_sky/19677629-1-eng-GB/Stellar_families_in_Gaia_s_sky_card_full.jpg",
    "news_site": "ESA",
    "summary": "In the past decade, the European Space Agency’s Gaia mission has revealed the nature, history, and behaviour of billions of stars. Our pioneering stargazer has reshaped our view of the skies around us like no other, revealing that star clusters are more connected than expected over vast distances.",
    "published_at": "2025-08-26T08:00:00Z",
    "updated_at": "2025-08-26T08:12:23.768093Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2044f8a1-4dad-4c8b-a3a9-5ecc7045c257",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The European Space Agency’s Gaia mission has revealed the nature, history, and behaviour of billions of stars. Since it opened its eyes in 2014, Gaia has mapped how different stars zip through space and pinpointed their whereabouts more precisely than ever. The telescope has watched whether they shrink and swell, spotted surprising ‘ starquakes ’, monitored how stars grow, evolve, and crystallise as they die. Gaia has revolutionised our view of the solar neighbourhood, allowing scientists to comprehensively map all the stars and interstellar ‘stuff’ near the Sun in a way they were unable to do before. Scientists have also applied Artificial Intelligence (AI) to Gaia data, using algorithms and machine learning approaches to pinpoint new cluster members and subgroups of stars. In this way, Gaia has pushed us to rethink how we hunt for stellar groups.  Gaia has shown that structures resembling streams, beads, strings, pearls, snakes, rings, or filaments of stars are reasonably common in young cluster formation. It has also revealed that large-scale galactic dynamics influence how young star clusters form in the first place. Thanks to Gaia, open clusters are no longer seen as isolated entities but as dynamically evolving structures, slowly dissolving into our galaxy. Gaia has now completed its sky-scanning observations and, as of March 2025, is quietly orbiting the Sun in its retirement orbit. The vast majority of data collected by the spacecraft is yet to be released, with a couple of huge data releases planned by the end of the decade. Scientists are already using Gaia’s treasure trove of released observations to explore billions of stars and objects in our galaxy and beyond."
  },
  {
    "id": 32772,
    "title": "Curiosity Blog, Sols 4638-4640: Imaging Extravaganza Atop a Ridge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4638-4640-imaging-extravaganza-atop-a-ridge/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04636_opgs_edr_ncam_NLB_809060540EDR_F1181752NCAM00254M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Conor Hayes, Graduate Student at York University Earth planning date: Friday, Aug. 22, 2025 Curiosity is continuing its winding path through the mysterious boxwork structures that have been a major focus of the last several months of the mission. After driving away from “Río Frío,” we are now parked on top of a […]",
    "published_at": "2025-08-26T04:38:45Z",
    "updated_at": "2025-08-26T16:10:05.785557Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "This weekend plan is packed with a lot of good science. The highlight of Mastcam’s work in this plan is the large 44-image mosaic of the north crater rim. ChemCam will be taking several RMI images of Mishe Mokwa and a distant outcrop. Mastcam also gets involved in the environmental fun with a tau to track the amount of dust in the air."
  },
  {
    "id": 32763,
    "title": "Weather Scrubs Second Starship IFT-10 Launch Attempt",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/weather-scrubs-second-starship-ift-10-launch-attempt/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/IFT10-webcast-9-Aug-25-25-218x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "SpaceX is still trying to get its 10th Starship Integrated Flight Test, IFT-10, off the ground.  Yesterday’s attempt was canceled because of a ground-side liquid oxygen leak. Today’s was scrubbed […]",
    "published_at": "2025-08-26T02:08:26Z",
    "updated_at": "2025-08-26T02:10:20.441778Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is still trying to get its 10th Starship Integrated Flight Test, IFT-10, off the ground. Yesterday’s attempt was canceled because of a ground-side liquid oxygen leak. SpaceX might try again tomorrow. Musk made a surprise appearance on the launch webcast sharing his views on the need for a multiplanetary species. NASA contracted with SpaceX in 2021 for a Starship Human Landing System (HLS) to put NASA astronauts on the lunar surface in 2024. SpaceX must perform an uncrewed lunar landing demonstration first and fire the engines to show it can lift off the surface. Getting American astronauts back on the Moon before China puts taikonauts there is a unifying goal of Republicans and Democrats."
  },
  {
    "id": 32762,
    "title": "ICEYE Secures €9.38M in Funding from Poland’s National Development Bank",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/iceye-secures-e9-38m-in-funding-from-polands-national-development-bank/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/ICEYE-Secures-E9.38M-in-Funding-from-Polands-National-Development-Bank.webp",
    "news_site": "European Spaceflight",
    "summary": "Earth observation data provider and satellite manufacturer ICEYE has secured over PLN 40 million (€9.38 million) in new funding from Vinci S.A., an investment vehicle of Bank Gospodarstwa Krajowego (BGK), Poland’s National Development Bank. As an investment vehicle for BGK, Vinci S.A. is tasked with investing in the commercialization and expansion of Polish startups. According […]\nThe post ICEYE Secures €9.38M in Funding from Poland’s National Development Bank appeared first on European Spaceflight.",
    "published_at": "2025-08-25T21:50:16Z",
    "updated_at": "2025-08-25T22:00:12.527446Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "ICEYE has secured over PLN 40 million (€9.38 million) in new funding from Vinci S.A. Vinci is an investment vehicle of Bank Gospodarstwa Krajowego (BGK), Poland’s National Development Bank."
  },
  {
    "id": 32761,
    "title": "Vulcan Begins Operational Missions",
    "authors": [
      {
        "name": "Nik Alexander",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/08/vulcan-begins-operational-missions/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/08/joebvulcan-scaled.jpg",
    "news_site": "Space Scout",
    "summary": "On August 12, 2025 at 8:56 p.m. EDT (0056 UTC), United Launch Alliance successfully launched its Vulcan Centaur VC4S vehicle from Space Launch Complex-41 at Cape Canaveral Space Force Station for the USSF-106 mission.",
    "published_at": "2025-08-25T17:20:40Z",
    "updated_at": "2025-08-25T17:30:22.638781Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "On August 12, 2025 at 8:56 p.m. EDT (0056 UTC), United Launch Alliance successfully launched its Vulcan Centaur VC4S vehicle. This was the third overall flight of the Vulcan rocket but its first to carry national security payloads. The ascent was nominal, despite an SRB nozzle anomaly on flight 2 which led to a lengthy stand down. Vulcan successfully launched USSF-106 from Cape Canaveral on April 4, 2025. The launch was part of the second round of the National Security Space Launch program. The program seeks to distribute vital government payloads across industry to prevent potential bottlenecks. The path to operational Vulcan flights has been marred with challenges, with the company encountering several key issues."
  },
  {
    "id": 32759,
    "title": "With a new Soyuz rocket, Russia seeks to break its Ukrainian dependency",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/with-a-new-soyuz-rocket-russia-seeks-to-break-its-ukrainian-dependency/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2202741417.jpg",
    "news_site": "Arstechnica",
    "summary": "Now you Zenit, now you don't",
    "published_at": "2025-08-25T17:17:20Z",
    "updated_at": "2025-08-25T17:20:05.930051Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Soyuz-5 will be Russia's new medium-lift rocket. The rocket has been in development since 2016 and largely repurposes older technology. It takes rocket elements formerly made in Ukraine and now manufactures them in Russia. Full operational service is not expected to begin until 2028. The vehicle's debut has been repeatedly pushed back, however, with Russia now expected to debut the vehicle no earlier than 2030. Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information."
  },
  {
    "id": 32760,
    "title": "Live coverage: SpaceX preps for Starship Flight 10 following Sunday scrub",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/25/live-coverage-spacex-preps-for-starship-flight-10-following-sunday-scrub/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250825_Starship_Flight-10.jpg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX Founder and Chief Engineer Elon Musk said on his social media site, X, that the scrub was caused by a “Ground side liquid oxygen leak (that) needs to be fixed.” The launch is scheduled for no earlier than Monday, Aug. 25, at 6:30 p.m. CDT (7:30 p.m. EDT / 2330 UTC). ",
    "published_at": "2025-08-25T17:12:46Z",
    "updated_at": "2025-08-25T17:20:18.614471Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for its second attempt to launch the 10th test flight of a Starship rocket from southern Texas as soon as Monday evening. Liftoff from Pad A at Starbase is scheduled for 6:30 p.m. CDT (7:30pm. EDT / 2330 UTC), which is the opening of the hour-long launch window. SpaceX announced on social media that it was scrubbing the Sunday launch attempt to “allow time to troubleshoot an issue with ground systems” SpaceX will perform a multi-hour experiment on the second stage of a Falcon 9 rocket after the launcher deploys a Dragon supply ship on the way to the International Space Station. Orbital ATK and SpaceX won Pentagon contracts worth a combined value of up to $241 million Wednesday."
  },
  {
    "id": 32773,
    "title": "From NASA Citizen Scientist to Astronaut Training: An Interview with Benedetta Facini",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/astrophysics/from-nasa-citizen-scientist-to-astronaut-training-an-interview-with-benedetta-facini/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/citizen-science/highlights/2025/Benedetta-facini.jpg",
    "news_site": "NASA",
    "summary": "Titans Space Industries, a commercial space company, selected a new cohort of astronaut candidates this spring – and among them is NASA citizen scientist, Benedetta Facini. She has participated in not one, but many NASA citizen science projects: Cloudspotting on Mars, Active Asteroids, Daily Minor Planet, GLOBE, Exoasteroids and International Astronomical Collaboration (IASC). We asked […]",
    "published_at": "2025-08-25T16:01:37Z",
    "updated_at": "2025-08-26T16:10:05.802018Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Benedetta Facini is a NASA citizen scientist. She has participated in not one, but many NASA citizen science projects. Facini was selected as an Astronaut Candidate by the commercial space company, Titans Space Industries. She shares her advice for other citizen scientists and people who want to become astronauts. For aspiring astronauts, my advice is to gain as much experience as possible. Academic results are important but hands-on skills, teamwork, adaptability, and real experiences are also important. Don’t be afraid to ask for help and interact with other colleagues because the goal of the NASA Citizen Science program is international collaboration."
  },
  {
    "id": 32774,
    "title": "NASA’s X-59 at Sunrise",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-x-59-at-sunrise/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/p25-056-49orig.jpg",
    "news_site": "NASA",
    "summary": "NASA’s X-59 quiet supersonic research aircraft sits on the ramp at sunrise before ground tests at Lockheed Martin’s Skunk Works facility in Palmdale, California, on July 18, 2025. Following completion of low-speed taxi tests in July 2025 in Palmdale, California, medium- and high-speed taxi tests mark the final steps before the aircraft takes to the skies for […]",
    "published_at": "2025-08-25T15:49:32Z",
    "updated_at": "2025-08-26T16:10:05.814943Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The X-59 is the centerpiece of NASA’s Quesst mission, which aims to demonstrate quiet supersonic flight. Low-speed taxi tests in July 2025 in Palmdale, California, mark the final steps before the aircraft takes to the skies for the first time."
  },
  {
    "id": 32775,
    "title": "Washington State Student Wins 2025 NASA Art Contest",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/langley/washington-state-student-wins-2025-nasa-art-contest/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/my-wonders-with-you-grand-prize-12th-grade-winner.jpg",
    "news_site": "NASA",
    "summary": "A Washington state high school student with a passion for art, space exploration, and a curiosity about the possibility of life on other planets earned the grand prize for the 2025 NASA Student Art Contest. Dahyun Jung’s winning piece, titled “My Wonders with You,” shows a child seated on the roof of a barn, their […]",
    "published_at": "2025-08-25T15:36:32Z",
    "updated_at": "2025-08-26T16:10:05.827903Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Dahyun Jung’s winning piece, titled “My Wonders with You,” shows a child seated on the roof of a barn, their arm draped around a dog, watching a space shuttle blast off in the distance. Jung used Procreate, a digital illustration and painting app, to create her award-winning work. Jung was one of more than 2,300 kindergarten through 12 th grade students who participated in the 2025 art contest. NASA Langley Research Center is located in Virginia. Langley is home to the Langley Institute for Space Studies. The Langley institute is a part of NASA Langley, which is based in Washington, D.C. It is also home to NASA's Langley Science Center."
  },
  {
    "id": 32776,
    "title": "Astronomers Map Stellar ‘Polka Dots’ Using NASA’s TESS, Kepler",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/tess/astronomers-map-stellar-polka-dots-using-nasas-tess-kepler/",
    "image_url": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2023/01/nasa-logo-web-rgb.png",
    "news_site": "NASA",
    "summary": "Scientists have devised a new method for mapping the spottiness of distant stars by using observations from NASA missions of orbiting planets crossing their stars’ faces. The model builds on a technique researchers have used for decades to study star spots. By improving astronomers’ understanding of spotty stars, the new model — called StarryStarryProcess — […]",
    "published_at": "2025-08-25T15:06:35Z",
    "updated_at": "2025-08-26T16:10:05.838976Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Scientists have devised a new method for mapping the spottiness of distant stars. Model builds on a technique researchers have used for decades to study star spots. By improving astronomers’ understanding of spotty stars, the new model — called StarryStarryProcess — can help discover more about planetary atmospheres and potential habitability. Astronomers think the planet is a gas giant about five times bigger than Earth and 32 times its mass. The StarryStarryProcess analysis suggests that the planet’s cool, dim star — called TOI 3384 — has concentrations of spots at its north pole. Pandora, a small satellite developed through NASA's Astrophysics Pioneers Program, will study the atmospheres of exoplanets."
  },
  {
    "id": 32777,
    "title": "NASA Accepts Proposals for 2026 Student Launch Challenge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/marshall/nasa-accepts-proposals-for-2026-student-launch-challenge/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/sl26-handbook-cover.png",
    "news_site": "NASA",
    "summary": "NASA is kicking off the 2026 Student Launch challenge, looking for new student teams to design, build, and launch high-powered rockets with a scientific or engineering payload next April.  The agency is seeking proposals until Monday, Sept. 22. Details about this year’s challenge are in the 2026 handbook, which outlines the requirements for middle school, high school, […]",
    "published_at": "2025-08-25T14:53:40Z",
    "updated_at": "2025-08-26T16:10:05.860637Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is looking for new student teams to design, build, and launch high-powered rockets with a scientific or engineering payload next April. Final launches are scheduled for April 25, at Bragg Farms in Toney, Alabama, near NASA’s Marshall Space Flight Center in Huntsville, Alabama. The Artemis II crew will be the first humans to test NASA’s Orion spacecraft. For the fourth year in a row, the American Association of Physics Teachers, a collaborator with NASA, is sponsoring the Student Launch Challenge. From January through June 2025, the Education Outreach… Learning Resources Marshall STEM Engagement How to Apply for the Student launch challenge."
  },
  {
    "id": 32778,
    "title": "Harmonized Landsat and Sentinel-2: Collaboration Drives Innovation",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/harmonized-landsat-and-sentinel-2-collaboration-drives-innovation/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-feature-article-banner.png",
    "news_site": "NASA",
    "summary": "Introduction Landsat, a joint program of NASA and the U.S. Geological Survey (USGS), has been an invaluable tool for monitoring changes in Earth’s land surface for over 50 years. Researchers use instruments on Landsat satellites to monitor decades-long trends, including urbanization and agricultural expansion, as well as short-term dynamics, including water use and disaster recovery. […]",
    "published_at": "2025-08-25T14:40:09Z",
    "updated_at": "2025-08-26T16:10:05.876171Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Harmonized Landsat and Sentinel-2 (HLS) project is a NASA initiative that created a seamless product from the Operational Land Imager (OLI) and Multi-Spectral Instrument (MSI) HLS Version 2.0 (V2.0) is the most recent version of these data and had a global median repeat frequency of 1.6 days in 2022. HLS data are available for download on NASA Earthdata: HLSL30v3.0 and HLSS30v4.0 . HLS V2.0 provides data at a spatial resolution of 30 m (98 ft) with near-global coverage from 2013 onward. HLS V1.4 covered about 30% of the global land area, providing data on North America and other select locations. The increased frequency of observations improved the ability of the scientific community to track disaster recovery. On average, DIST-ALERT is made available on LP DAAC within six hours of when new HLS data is available. Currently, the dataset does not provide attribution to disturbances. HLS V2.0 data are also better at identifying disturbances in cloudy ecosystems than other individual alert systems."
  },
  {
    "id": 32758,
    "title": "Cargo ship docks with International Space Station",
    "authors": [
      {
        "name": "William Harwood",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/25/cargo-ship-docks-with-international-space-station/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250825_crs33_docking.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "Launched Sunday from Cape Canaveral Space Force Station atop a Falcon 9 rocket, the cargo Dragon closed out a 28-hour rendezvous with an ahead-of-schedule docking at the lab's forward port at 7:05 a.m. EDT as the two spacecraft were passing 260 miles above the Ivory Coast of Africa. ",
    "published_at": "2025-08-25T13:45:43Z",
    "updated_at": "2025-08-25T17:10:18.859051Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Tortillas are a crumb-free bread substitute for crews dining in weightlessness. The Dragon also brought an add-on thruster kit to help boost the space station’s altitude. A Russian Soyuz rocket rolled out to a launch pad in Kazakhstan early Thursday in preparation for liftoff Saturday."
  },
  {
    "id": 32757,
    "title": "ESA data records help underpin climate change report",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Space_for_our_climate/ESA_data_records_help_underpin_climate_change_report",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/soil_moisture_anomalies_over_2024_compared_to_1991_2020/26846786-1-eng-GB/Soil_moisture_anomalies_over_2024_compared_to_1991_2020_card_full.gif",
    "news_site": "ESA",
    "summary": "According to the newly released 35th State of the Climate report, 2024 saw record highs in greenhouse gas concentrations, global land and ocean temperatures, sea levels, and ocean heat content. Glaciers also suffered their largest annual ice loss on record. Data records from ESA’s Climate Change Initiative helped underpin these findings.",
    "published_at": "2025-08-25T11:49:00Z",
    "updated_at": "2025-08-25T14:10:20.100605Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 35th State of the Climate report has been published by the Bulletin of the American Meteorological Society. 2024 saw record highs in greenhouse gas concentrations, global land and ocean temperatures, sea levels, and ocean heat content. Glaciers suffered their largest annual ice loss on record. Data records from ESA’s Climate Change Initiative helped underpin these findings. Permafrost stores nearly 1700 billion tonnes of frozen and thawing carbon. Anthropogenic warming threatens to release an unknown quantity of this carbon to the atmosphere. Sometimes permafrost can thaw rapidly, but scientists are unsure why and what these abrupt thaws mean in terms of feedback loops."
  },
  {
    "id": 32723,
    "title": "Juice team resolves anomaly on approach to Venus",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Operations/Juice_team_resolves_anomaly_on_approach_to_Venus",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2022/03/juice_s_flyby_of_venus_close-up/23992257-1-eng-GB/Juice_s_flyby_of_Venus_close-up_card_full.png",
    "news_site": "ESA",
    "summary": "The European Space Agency’s Jupiter Icy Moons Explorer (Juice) is on track for its gravity-assist flyby at Venus on 31 August, following the successful resolution of a spacecraft communication anomaly that temporarily severed contact with Earth.",
    "published_at": "2025-08-25T10:00:00Z",
    "updated_at": "2025-08-25T10:00:14.789193Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Jupiter Icy Moons Explorer (Juice) is on track for its gravity-assist flyby at Venus on 31 August. The issue emerged during a routine ground station pass on 16 July. It temporarily disrupted Juice’s ability to transmit information about its health and status (telemetry) Jupiter Icy Moons Explorer, ‘Juice’, is humankind’s next bold mission to the outer Solar System. It will make detailed observations of gas giant Jupiter and its three large ocean-bearing moons – Ganymede, Callisto and Europa. It has an eight-year cruise with flybys of Earth and Venus to slingshot it to Jupiter."
  },
  {
    "id": 32722,
    "title": "Lindy Garay: Supporting Space Station Safety and Success",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/lindy-garay-supporting-space-station-safety-and-success/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/garay-lindy.jpg",
    "news_site": "NASA",
    "summary": "Lindy Garay always knew she wanted to develop software. She did not anticipate that her work would contribute to human spaceflight. The electrical and software engineering degree Garay earned from the University of Texas at Austin paved the way for a 25-year career with NASA’s Johnson Space Center in Houston. Her first job out of […]",
    "published_at": "2025-08-25T10:00:00Z",
    "updated_at": "2025-08-25T10:00:08.574933Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Lindy Garay has worked at NASA's Johnson Space Center in Houston for 25 years. She is a training systems software architect and technical lead for training system external interfaces. Garay was recently named as a 2025 NASA Space Flight Awareness Program Honoree – one of the highest recognitions presented to the agency’s workforce."
  },
  {
    "id": 32721,
    "title": "Live Coverage: SpaceX gets ready for crucial 10th test flight of Starship",
    "authors": [
      {
        "name": "Spaceflight Now",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/24/live-coverage-spacex-gets-ready-for-crucial-10th-test-flight-of-starship/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2023/11/20231120-Starship-IFT-2-Adam-Remote.jpg",
    "news_site": "Spaceflight Now",
    "summary": "Watch live as a Super Heavy booster and Starship launch on a crucial test flight for SpaceX's fully reusable rocket, following three consecutive failures of the Starship upper stage in-flight and an explosion on the test stand. Liftoff is scheduled for  6:30 p.m. CDT / 7:30 p.m. EDT / 2330 UTC. ",
    "published_at": "2025-08-24T21:51:16Z",
    "updated_at": "2025-08-24T22:00:28.125688Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX scrubbed the launch attempt due to a ground systems issue. This tenth test flight follows three consecutive failures of the Starship upper stage in-flight and an explosion on the test stand. Liftoff of the 10th fully integrated Starship from SpaceX’s Starbase facility at Boca Chica Beach, in Texas."
  },
  {
    "id": 32720,
    "title": "What’s Happening in Space Policy August 24-30, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-august-24-30-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Starbase-stunning-Aug-2025-300x169.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of August 24-30, 2025 and any insight we can offer about them. The House and Senate are in recess […]",
    "published_at": "2025-08-24T18:36:56Z",
    "updated_at": "2025-08-24T18:40:12.643367Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpacePolicyOnline.com has compiled a list of space policy events for the week of August 24-30, 2025. The House and Senate are in recess until September 2 except for pro forma sessions. The FAA will have four in-person meetings this week to gather public input on its Draft Environmental Impact Statement. The House Rules Committee set Thursday, August 28, as the deadline for Members to offer amendments to the FY2026 NDAA. The House plans to take up the bill the second week of September. The NDAA is the one piece of legislation that has passed every year since the first in 1961."
  },
  {
    "id": 32719,
    "title": "NASA, SpaceX launch Dragon to the ISS on extended cargo, station boosting mission",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/24/nasa-spacex-launch-dragon-to-the-iss-on-extended-cargo-station-boosting-mission/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250824_CRS-33_liftoff.jpg",
    "news_site": "Spaceflight Now",
    "summary": "This will be the 50th Dragon vehicle to visit the International Space Station, including the Dragon 1 vehicles that were berthed to the orbiting lab. Docking with the Harmony module is anticipated Monday, Aug. 25, at 7:30 a.m. EDT (1130 UTC). ",
    "published_at": "2025-08-24T08:20:46Z",
    "updated_at": "2025-08-24T08:30:16.964796Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Cargo Dragon spacecraft from SpaceX lifted off atop a Falcon 9 rocket in the early hours Sunday morning to begin a day-long journey to the International Space Station. The launch marks SpaceX’s 33rd Commercial Resupply Services (CRS-33) mission to the orbiting outpost. Docking at the forward port of the Harmony module is anticipated on Monday, Aug. 25, at 7:30 a.m. EDT."
  },
  {
    "id": 32718,
    "title": "NASA Science, Cargo Launch on 33rd SpaceX Resupply Mission to Station",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-science-cargo-launch-on-33rd-spacex-resupply-mission-to-station/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/screenshot-195-1.png",
    "news_site": "NASA",
    "summary": "Following a successful launch of NASA’s SpaceX 33rd commercial resupply mission, new scientific experiments and cargo for the agency are bound for the International Space Station. The SpaceX Dragon spacecraft, carrying more than 5,000 pounds of supplies to the orbiting laboratory, lifted off at 2:45 a.m. EDT on Sunday, on the company’s Falcon 9 rocket […]",
    "published_at": "2025-08-24T07:14:08Z",
    "updated_at": "2025-08-24T07:20:04.891535Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Following a successful launch of NASA’s SpaceX 33rd commercial resupply mission, new scientific experiments and cargo for the agency are bound for the International Space Station. The SpaceX Dragon spacecraft, carrying more than 5,000 pounds of supplies to the orbiting laboratory, lifted off at 2:45 a.m. EDT on Sunday, on the company’s Falcon 9 rocket […]"
  },
  {
    "id": 32717,
    "title": "Starship prepares to launch Flight 10 in penultimate Block 2 test",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/flight-10-ship-37-block-2/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-23-23-41-51-295.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX has not experienced much success with the Block 2 version of Starship since its…\nThe post Starship prepares to launch Flight 10 in penultimate Block 2 test appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-23T22:50:17Z",
    "updated_at": "2025-08-23T23:00:11.701117Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has not experienced much success with the Block 2 version of Starship since its introduction earlier this year. Ship 37 aims to break this streak during Flight 10, which is set to launch no earlier than August 24 at 6:30 p.m. Central Daylight Time. This journey started with Ship 33 and Booster 14 for Flight 7 on January 16, 2025. The second Block 2 ship to fly was Ship 34 paired with Booster 15. Ship 36 experienced an anomaly on June 18, which resulted in the loss of the ship on the Masseys static fire test stand. This caused a pressurization problem in the payload bay and in the methane tank. Ship 35 reentered in an uncontrolled manner and was lost without completing any primary objectives. Booster 16 was static fire tested on June 6, when it was slated to fly with Ship 36.  Starship Flight 10 is currently set for no earlier than Aug 24 at 6:30 pm Central Daylight Time with a one-hour launch window. The only significant difference is that Booster 16 will have a boost back burn that is 10 seconds longer compared to Flight 9. As for trajectory, this will once again be a suborbital ballistic trajectory with Ship 37 set to splashdown in the Indian Ocean."
  },
  {
    "id": 32716,
    "title": "Live coverage: NASA, SpaceX to launch Falcon 9 rocket, Dragon spacecraft on CRS-33 from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/23/live-coverage-nasa-spacex-to-launch-falcon-9-rocket-dragon-spacecraft-on-crs-33-from-cape-canaveral/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250823_CRS_33_full_rocket.jpg",
    "news_site": "Spaceflight Now",
    "summary": "This will be the first Cargo Dragon flight featuring a modified trunk that allows it to perform multiple orbital boosts of the International Space Station. SpaceX is targeting liftoff from pad 40 at Cape Canaveral Space Force Station at 2:45 a.m. EDT (0645 UTC). ",
    "published_at": "2025-08-23T20:39:46Z",
    "updated_at": "2025-08-23T20:40:19.247769Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Dragon spacecraft set to launch in the predawn hours of Sunday morning features a new propulsion system inside its unpressurized trunk. This addition will allow the spacecraft to boost the orbit of the space station, keeping it in its desired orbit. SpaceX will launch the mission using its Falcon 9 first stage booster with the tail number B1090, which will fly for a seventh time. SpaceX's Dragon capsule heading for the International Space Station carrying more than 4,800 pounds of supplies and experiments. SpaceX’s Falcon 9 rocket is set for liftoff from Cape Canaveral on Monday, heading due east over the Atlantic Ocean to deliver the Telstar 18 VANTAGE communications satellite into orbit around 32 minutes later."
  },
  {
    "id": 32715,
    "title": "NASA Tests Tools to Assess Drone Safety Over Cities",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasa-tests-tools-to-assess-drone-safety-over-cities/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/20250822-sws-resilienx.jpeg",
    "news_site": "NASA",
    "summary": "A future with advanced air mobility aircraft populating the skies will require the U.S. to implement enhanced preflight planning that can mitigate potential risks well before takeoff – and NASA is working to develop the tools to make that happen.  Preflight planning is critical to ensuring safety in the complex, high-risk environments of the future […]",
    "published_at": "2025-08-22T16:15:55Z",
    "updated_at": "2025-08-22T16:20:06.332798Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and aviation safety company ResilienX Inc. demonstrated how these tools can be integrated into commercial systems. Timely, predictive, and up-to-date risk assessment within a single platform makes it much easier for drone or air taxi operators to check flight plans. Allowing operators to perform these tasks quickly reduces the safety risk to flight passengers as well as humans on the ground."
  },
  {
    "id": 32714,
    "title": "NASA Shares Final Contenders for Artemis II Moon Mascot Design Contest",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/nasa-shares-final-contenders-for-artemis-ii-moon-mascot-design-contest/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/54699815290-5cb6508dd2-o.jpg",
    "news_site": "NASA",
    "summary": "NASA is down to 25 finalists for the Artemis II zero gravity indicator set to fly with the mission’s crew around the Moon and back next year. Astronauts Reid Wiseman, Victor Glover, and Christina Koch of NASA, and CSA (Canadian Space Agency) astronaut Jeremy Hansen will soon select one of the finalist designs to join […]",
    "published_at": "2025-08-22T16:08:40Z",
    "updated_at": "2025-08-22T16:10:12.497149Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is down to 25 finalists for the Artemis II zero gravity indicator set to fly with the mission’s crew around the Moon and back next year. Astronauts Reid Wiseman, Victor Glover, and Christina Koch of NASA, and CSA (Canadian Space Agency) astronaut Jeremy Hansen will soon select one of the finalist designs to join them inside the Orion spacecraft."
  },
  {
    "id": 32712,
    "title": "UK Space Agency Hires Consultants to Explain the UK Space Sector",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/uk-space-agency-hires-consultants-to-explain-the-uk-space-sector/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/UK-Space-Agency-Hires-Consultants-to-Explain-the-UK-Space-Sector.webp",
    "news_site": "European Spaceflight",
    "summary": "The UK Space Agency has commissioned Frazer-Nash Consultancy to review the nation’s capacity to deliver on in-situ resource utilisation capabilities. According to the agency, the results of the study will be used to “inform future activities in this area.” In an 18 August press release, Surrey-based Frazer-Nash Consultancy explained that the study will examine the […]\nThe post UK Space Agency Hires Consultants to Explain the UK Space Sector appeared first on European Spaceflight.",
    "published_at": "2025-08-22T15:48:23Z",
    "updated_at": "2025-08-22T15:50:09.678973Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The UK Space Agency has commissioned Frazer-Nash Consultancy to review the nation’s capacity to deliver on in-situ resource utilisation capabilities. The results of the study will be used to “inform future activities in this area” As a “first step,” Frazers has asked companies developing ISRU technology or solutions to complete a 10-minute survey before 17 October."
  },
  {
    "id": 32711,
    "title": "Epic Research Can Help Mars Missions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/epic-research-can-help-mars-missions/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/afrc2025-0094-0864orig.jpg",
    "news_site": "NASA",
    "summary": "The parachute of the Enhancing Parachutes by Instrumenting the Canopy, or EPIC, test experiment deploys following an air launch from an Alta X drone on June 4, 2025, at NASA’s Armstrong Flight Research Center in Edwards, California. NASA researchers are developing technology to make supersonic parachutes safer and more reliable for delivering instruments and payloads […]",
    "published_at": "2025-08-22T14:47:36Z",
    "updated_at": "2025-08-22T14:50:06.590631Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA researchers are developing technology to make supersonic parachutes safer and more reliable for delivering instruments and payloads to Mars. The flight tests were a first step toward filling gaps in computer models to improve the parachutes. This work could also open the door to future partnerships, including with the aerospace and auto racing industries."
  },
  {
    "id": 32710,
    "title": "NASA’s Bennu Samples Reveal Complex Origins, Dramatic Transformation",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/uncategorized/nasas-bennu-samples-reveal-complex-origins-dramatic-transformation/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/psd/ares/jsc2025e069611_Bennu_particle.tif",
    "news_site": "NASA",
    "summary": "Asteroid Bennu, sampled by NASA’s OSIRIS-REx mission in 2023, is a mixture of dust that formed in our solar system, organic matter from interstellar space, and pre-solar system stardust. Its unique and varied contents were dramatically transformed over time by interactions with water and exposure to the harsh space environment. These insights come from a trio of newly published papers based on the analysis of Bennu samples by scientists at NASA and other institutions.",
    "published_at": "2025-08-22T14:01:11Z",
    "updated_at": "2025-08-22T14:10:06.633147Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Asteroid Bennu is a mixture of dust that formed in our solar system, organic matter from interstellar space, and pre-solar system stardust. Its unique and varied contents were dramatically transformed over time by interactions with water and exposure to the harsh space environment. These insights come from a trio of newly published papers based on the analysis of Bennu samples. Asteroids provide a record of the solar system’s history. Some types of asteroids burn up in the atmosphere and never make it to the ground. The next samples NASA expects to help unravel our solar system's story will be Moon rocks returned by the Artemis III astronauts."
  },
  {
    "id": 32709,
    "title": "Week in images: 18-22 August 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_18-22_August_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/iberian_fires_august_2025/26845081-2-eng-GB/Iberian_fires_August_2025_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 18-22 August 2025",
    "published_at": "2025-08-22T13:10:00Z",
    "updated_at": "2025-08-22T13:20:10.855496Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 32708,
    "title": "Lunar Environment Structural Test Rig",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/lunar-environment-structural-test-rig/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/grc-2025-c-05348.jpg",
    "news_site": "NASA",
    "summary": "The Lunar Environment Structural Test Rig simulates the intense cold of the lunar night, ranging from 40 Kelvin (K) to 125 K while maintaining a vacuum environment. This creates a tool by which scientists and engineers can test materials, electronics, and flight hardware for future Moon and Mars missions, characterizing their behaviors at these temperatures while also validating their ability to meet design requirements.",
    "published_at": "2025-08-22T12:29:37Z",
    "updated_at": "2025-08-22T12:30:08.567377Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "LESTR simulates the intense cold of the lunar night, ranging from 40 Kelvin (K) to 125 K. It uses a cryocooler to reject heat and bring the test section to any point desired by the test engineer. LESTR enables safe, accurate, and cost-effective testing of materials and hardware."
  },
  {
    "id": 32706,
    "title": "Rocket Report: Pivotal Starship test on tap, Firefly wants to be big in Japan",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/rocket-report-pivotal-starship-test-on-tap-firefly-wants-to-be-big-in-japan/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/Gy5mgr3XsAAs79t.jpg",
    "news_site": "Arstechnica",
    "summary": "Starship returns to the launch pad for the first time in three months.",
    "published_at": "2025-08-22T11:00:18Z",
    "updated_at": "2025-08-22T11:10:04.714886Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX's Starship rocket will return to the launch pad for the first time in three months on Sunday. A Chinese methane-powered rocket failed on Friday after the carrier rocket experienced an \"anomaly\" The French government has granted Avio a 10-year license to carry out Vega rocket operations from the Guiana Space Centre. SpaceX launched its 100th Falcon 9 rocket of the year Monday morning. Students from Concordia University cheered and whistled as the Starsailor rocket lifted off on Cree territory on August 15. This was Canada's first space launch in more than 25 years, and the first to be achieved by a team of students, according to the university. SpaceX has not had a good run of things with the ambitious Starship vehicle this year. Three times, in January, March, and May, the vehicle took flight. Sources at SpaceX believe the upper stage issues can be resolved. But the acid test will only come on upcoming flights, beginning Sunday. Engineers recreated the diffuser failure on the ground during the investigation. They then redesigned the part to better direct pressurized gas into the main fuel tank. This will also \"substantially decrease\" strain on the Diffuser structure, SpaceX said. The Falcon 9 is scheduled to launch on August 22."
  },
  {
    "id": 32707,
    "title": "Hubble Observes Noteworthy Nearby Spiral Galaxy",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-observes-noteworthy-nearby-spiral-galaxy/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/spiral/Hubble_NGC2835_potw2533a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image offers a new view of the nearby spiral galaxy NGC 2835, which lies 35 million light-years away in the constellation Hydra (the Water Snake). The galaxy’s spiral arms are dotted with young blue stars sweeping around an oval-shaped center where older stars reside. This image differs from previously released […]",
    "published_at": "2025-08-22T11:00:00Z",
    "updated_at": "2025-08-22T11:10:05.669636Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NGC 2835 lies 35 million light-years away in the constellation Hydra (the Water Snake) The galaxy’s spiral arms are dotted with young blue stars sweeping around an oval-shaped center where older stars reside. This image differs from previously released images from Hubble and the NASA/ESA/CSA James Webb Space Telescope."
  },
  {
    "id": 32704,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/22/live-coverage-spacex-to-launch-24-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb-2/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/03/20250320_F9_SLC-4E_small.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The mission will include the 1,800th Starlink satellite launched in 2025. SpaceX is targeting liftoff from pad 4E at Vandenberg Space Force Base at 10:02 a.m. PDT (1:02 p.m. EDT / 1702 UTC).",
    "published_at": "2025-08-22T05:18:06Z",
    "updated_at": "2025-08-22T08:47:47.751781Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "80af8d63-64aa-4d16-9abd-bdbe167cecb9",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "SpaceX is planning to launch of its latest batch of Starlink V2 Mini satellites from Vandenberg Space Force Base in California on Friday. The Starlink 17-6 mission will add another 24 satellites to the low Earth orbit constellation. With a successful completion of this mission, SpaceX will have launched more than 1,800 of its Starlink satellites in 2025 alone."
  },
  {
    "id": 32705,
    "title": "SpaceX launches Space Force’s X-37B spaceplane to demo laser communications, quantum navigation",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/22/spacex-launches-space-forces-x-37b-spaceplane-to-demo-laser-communications-quantum-navigation/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250821_USSF-36_streak_JP-1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The uncrewed spacecraft will operate in low Earth orbit for an unspecified amount of time. This is the eighth launch of an X-37B Orbital Test Vehicle since its first flight in 2010.",
    "published_at": "2025-08-22T05:15:08Z",
    "updated_at": "2025-08-22T08:47:30.191874Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2d5f2335-c3c2-4306-9dde-8ec37f348ccf",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The X-37B Orbital Test Vehicle was launched Thursday night. It's the eighth mission for the program, which began operational flights in April 2010. There are two operational spaceplanes in the X- 37B fleet. The rocket's first stage will attempt to land on a SpaceX droneship. NASA, Boeing and Lockheed Martin argued that the United States shouldn't skip past the Moon in favor of Mars. The discussion came up during a panel at the SpaceCom conference concerning the Artemis 2 mission. A SpaceX Falcon 9 rocket loaded with 10 Iridium Next communications satellite is awaiting a predawn launch Wednesday from Vandenberg Air Force Base."
  },
  {
    "id": 32703,
    "title": "X-37B Lifts Off on Eighth Mission",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/x-37b-lifts-off-on-eighth-mission/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/X-37B-after-OTV6-USSF-300x200.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "The U.S. Space Force’s X-37B Orbital Test Vehicle lifted off from Kennedy Space Center just before midnight on its eighth flight, OTV-8. Looking like a small space shuttle, the spaceplane […]",
    "published_at": "2025-08-22T03:52:08Z",
    "updated_at": "2025-08-22T08:47:23.060168Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2d5f2335-c3c2-4306-9dde-8ec37f348ccf",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The U.S. Space Force’s X-37B Orbital Test Vehicle lifted off from Kennedy Space Center just before midnight on its eighth flight, OTV-8. Looking like a small space shuttle, the spaceplane was nestled inside the fairing of a SpaceX Falcon 9 rocket. The USSF released a pre-launch photo and shared a few nuggets about some of the experiments aboard, but little is known about what these X- 37B missions do. Boeing built two X-37Bs. USSF didn’t specify which is being used for this mission. Some question whether it may be a space weapon of some kind. Secure World Foundation tracks global counterspace capabilities and concludes that’s not likely."
  },
  {
    "id": 32701,
    "title": "NASA’s SpaceX 33rd Commercial Resupply Mission Overview",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/commercial-resupply/spacex-crs/nasas-spacex-33rd-commercial-resupply-mission-overview/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/spacex-falcon9-dragon.png",
    "news_site": "NASA",
    "summary": "NASA and SpaceX are targeting no earlier than 2:45 a.m. EDT on Sunday, Aug. 24, for the next launch to deliver scientific investigations, supplies, and equipment to the International Space Station.",
    "published_at": "2025-08-21T20:51:21Z",
    "updated_at": "2025-08-22T08:47:16.752064Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "e8e93778-657c-401c-9c88-3cd4c7c45c9d",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The SpaceX Dragon spacecraft will arrive at the space station at approximately 7:30 a.m. on Monday, Aug. 25. NASA astronauts Mike Fincke and Jonny Kim will monitor the spacecraft’s arrival. It will stay docked to the orbiting laboratory for about four months before splashing down. Reboost Kit – This kit will perform a reboost demonstration of the station to maintain its current altitude. Separator Orbital Unit – The unit draws air and condensate mixture from a condensing heat exchanger. Reducer Cylinder Assembly & Emergency Portable Breathing Apparatus – Together, this hardware provides 15 minutes of oxygen to a crew member in case of an emergency. Oxygen Generation Assembly Pump converts potable water from the water recovery system into oxygen and hydrogen. The oxygen is sent to the crew cabin, and the hydrogen is either vented or used to produce more water. The Rate Gyro Enclosure Assembly determines the space station’s rate of angular motion."
  },
  {
    "id": 32702,
    "title": "To See the World in a Grain of Sand: Investigating Megaripples at ‘Kerrlaguna’",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/to-see-the-world-in-a-grain-of-sand-investigating-megaripples-at-kerrlaguna/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/mars2020/2025/perseverance-rover-updates/august-2025/Mars_Perseverance_ZR0_1593_0808356707_285EBY_N0780780ZCAM09652_1100LMJ.jpg",
    "news_site": "NASA",
    "summary": "Written by Athanasios Klidaras, Ph.D. candidate at Purdue University On Mars, the past is written in stone — but the present is written in sand. Last week, Perseverance explored inactive megaripples to learn more about the wind-driven processes that are reshaping the Martian landscape every day.  After wrapping up its investigation at the contact between […]",
    "published_at": "2025-08-21T20:07:56Z",
    "updated_at": "2025-08-21T21:10:06.586835Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Perseverance explored inactive megaripples to learn more about the wind-driven processes that are reshaping the Martian landscape every day. It is hoped that this investigation at “Kerrlaguna’ can provide a practice run for a more comprehensive campaign located at a more extensive field of larger bedforms at ‘Lac de Charmes’"
  },
  {
    "id": 32700,
    "title": "NASA Astronauts to Answer Questions from Students in Ohio",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-astronauts-to-answer-questions-from-students-in-ohio/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/nasa-astronauts-mike-fincke-and-zena-cardman-downlink-advisory-aug-21.jpg",
    "news_site": "NASA",
    "summary": "NASA astronauts Michael Fincke and Zena Cardman will connect with students in Ohio as they answer prerecorded science, technology, engineering, and mathematics (STEM) questions aboard the International Space Station. The Earth-to-space call will begin at 10:15 a.m. EDT on Wednesday, Aug. 27, and will stream live on the agency’s Learn With NASA YouTube channel. Media […]",
    "published_at": "2025-08-21T17:55:14Z",
    "updated_at": "2025-08-21T18:00:07.327821Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronauts Michael Fincke and Zena Cardman will answer prerecorded science, technology, engineering, and mathematics questions. The Earth-to-space call will begin at 10:15 a.m. EDT on Wednesday, Aug. 27. Media interested in covering the event must RSVP by 5 p.m., Monday, August 25."
  }
]