[
  {
    "id": 33043,
    "title": "NASA reestablishes contact with one of two TRACERS satellites",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-reestablishes-contact-with-one-of-two-tracers-satellites/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/07/tracers.jpg?fit=1024%2C732&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA has restored contact with one of a pair of space science satellites that ran into problems shortly after its July launch.\nThe post NASA reestablishes contact with one of two TRACERS satellites appeared first on SpaceNews.",
    "published_at": "2025-09-13T20:06:52Z",
    "updated_at": "2025-09-13T20:10:28.228053Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33042,
    "title": "Golden Dome’s cost: anywhere from billions to trillions, depending on design",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/golden-domes-cost-anywhere-from-billions-to-trillions-depending-on-design/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Screenshot-2025-06-04-at-1.34.59-PM.png?fit=1024%2C601&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA new report by Todd Harrison of the American Enterprise Institute estimates Golden Dome could cost from $252 billion to $3.6 trillion over 20 years, based on scope and capabilities\nThe post Golden Dome’s cost: anywhere from billions to trillions, depending on design appeared first on SpaceNews.",
    "published_at": "2025-09-13T15:14:37Z",
    "updated_at": "2025-09-13T15:20:24.500141Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33041,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/13/live-coverage-spacex-to-launch-24-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb-3/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small.jpg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX is targeting a liftoff from pad 4 East at 8:41 a.m. PDT (11:41 a.m. EDT / 1541 UTC). ",
    "published_at": "2025-09-13T13:06:12Z",
    "updated_at": "2025-09-13T13:10:18.877159Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Starlink 17-10 mission on Saturday will add another 24 broadband internet satellites to the low Earth orbit constellation. This will be SpaceX’s 42nd launch from California this year. The launch of another 60 Starlink internet spacecraft from Cape Canaveral Sunday thrust SpaceX past a major milestone in rocket reuse: the 10th successful flight of a Falcon 9 booster."
  },
  {
    "id": 33040,
    "title": "60 years after Gemini, newly processed images reveal incredible details",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/60-years-after-gemini-newly-processed-images-reveal-incredible-details/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/01-Aldrin-Selfie-Before-After_NASA_ASU_Andy-Saunders.jpg",
    "news_site": "Arstechnica",
    "summary": "\"It's that level of risk that they were taking. I think that's what really hit home.\"",
    "published_at": "2025-09-13T11:15:47Z",
    "updated_at": "2025-09-13T11:20:05.331388Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Gemini & Mercury Remastered is a collection of 300 photographs from NASA's Mercury and Gemini programs during the 1960s. Andy Saunders meticulously restored the images and then deeply researched their background to more fully tell the stories behind them. Saunders: \"It's really the photographs that will just forever symbolize and document at the beginning of our expansion out into the cosmos\" With Apollo, they took about 35,000 photographs, with Mercury and Gemini, there were about 5,000. I went through every frame of film that was captured from launch to splashdown on every mission. The final 300 that are in the book are those that are either aesthetically stunning, or they're a big transformation. Saunders has been working on the book since the middle of 2019, nonstop. There are only about 100 million photos from the Space Shuttle era. The process I used for this, on the low-quality 16 mm film, was to stack hundreds of frames. To see this level of detail, to me, it's just like a portrait of courage."
  },
  {
    "id": 33039,
    "title": "Maxar executive renews warning that budget cuts threaten commercial remote sensing industry",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/maxar-executive-renews-warning-that-budget-cuts-threaten-commercial-remote-sensing-industry/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/G0luXUBWsAA1-5q.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nMaxar executive Susanne Hake pressed the case that commercial firms can deliver faster and for less cost than bespoke government satellites, but need predictable funding and contracts to keep investing\nThe post Maxar executive renews warning that budget cuts threaten commercial remote sensing industry appeared first on SpaceNews.",
    "published_at": "2025-09-12T23:24:05Z",
    "updated_at": "2025-09-12T23:30:21.019812Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33038,
    "title": "Curiosity Blog, Sols 4649-4654: Ridges, Hollows and Nodules, Oh My",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4649-4654-ridges-hollows-and-nodules-oh-my/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/september/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04650_opgs_edr_ncam_NLB_810299729EDR_F1182304NCAM00354M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Lucy Thompson, Planetary Scientist and APXS Team Member, University of New Brunswick, Canada Earth planning date: Friday, Sept. 5, 2025 Curiosity is in the midst of the boxwork campaign, trying to decipher why we see such pronounced ridges and hollows in this area of Mount Sharp. When this terrain was first identified from […]",
    "published_at": "2025-09-12T22:57:37Z",
    "updated_at": "2025-09-12T23:10:07.654343Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Curiosity is in the midst of the boxwork campaign, trying to decipher why we see such pronounced ridges and hollows in this area of Mount Sharp. The focus of our activities this week was to document the transition from smoother bedrock atop a boxwork ridge to more nodular bedrock associated with the edge of a shallow hollow."
  },
  {
    "id": 33037,
    "title": "China completes second hot-fire test for new moon rocket, including engine restarts",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-completes-second-hot-fire-test-for-new-moon-rocket-including-engine-restarts/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/CZ10-short-tank-static-fire2-Wenchang-12sept2025-CASC.jpg?fit=1024%2C770&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nChina conducted a rocket stage hot fire test Friday in the latest step in the country’s plans to land astronauts on the moon.\nThe post China completes second hot-fire test for new moon rocket, including engine restarts appeared first on SpaceNews.",
    "published_at": "2025-09-12T22:06:07Z",
    "updated_at": "2025-09-12T22:10:20.509890Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33036,
    "title": "Flight 11 closing in as Booster 15 completes testing, Pad 1 awaits Ship 38",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/flight-11-booster-15-ship-38/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/Booster-15-Rolling-Back-After-its-Static-Fire-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "With Booster 15-2’s static fire out of the way and crews setting up Pad 1(A)…\nThe post Flight 11 closing in as Booster 15 completes testing, Pad 1 awaits Ship 38 appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-12T21:07:44Z",
    "updated_at": "2025-09-12T21:10:21.300434Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX appears poised to test Ship 38 rather than later. The last piece of testing before Flight 11 is Ship 38’s static fire on Pad 1(A) This will be the last time a booster receives one for flight. There is also confirmation on the flight plans for Flight 11 and at least 12 other flights. SpaceX executive Bill Gerstenmaier gave a talk and answered questions at the American Astronautical Society’s Glenn Space Technology Symposium in Cleveland. With this next flight, SpaceX aims to test measures to prevent burn-through similar to what was observed on Flight 10. For Flight 11, there are no regulatory holdups as long as SpaceX aligns with current suborbital flight. SpaceX confirms that Block 3 won’t fly until next year, which was expected, given the current state of all the components. Flight 11 will be suborbital as well as Flight 12 to test the new designs. If that goes well, they may proceed to orbit and attempt a catch as early as Flight 13."
  },
  {
    "id": 33035,
    "title": "NASA Awards Third Glenn Facility and Engineering Services Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-third-glenn-facility-and-engineering-services-contract/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
    "news_site": "NASA",
    "summary": "NASA has selected Troy Sierra JV, LLC of Huntsville, Alabama, to provide engineering, research, and scientific support at the agency’s Glenn Research Center in Cleveland.   The Test Facility Operations, Maintenance, and Engineering Services III contract is a cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract with a maximum potential value of approximately $388.3 million. The performance period begins Jan. […]",
    "published_at": "2025-09-12T20:20:42Z",
    "updated_at": "2025-09-12T20:30:06.564038Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA has selected Troy Sierra JV, LLC of Huntsville, Alabama, to provide engineering, research, and scientific support. The Test Facility Operations, Maintenance, and Engineering Services III contract is a maximum potential value of approximately $388.3 million. The performance period begins Jan. 1, 2026, with a three-year base period followed by a two-year option."
  },
  {
    "id": 33034,
    "title": "NASA’s X-59 Moves Toward First Flight at Speed of Safety",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasas-x-59-moves-toward-first-flight-at-speed-of-safety/",
    "image_url": "https://images-assets.nasa.gov/image/P25-056-02/P25-056-02~large.jpg",
    "news_site": "NASA",
    "summary": "As NASA’s one-of-a-kind X-59 quiet supersonic research aircraft approaches first flight, its team is mapping every step from taxi and takeoff to cruising and landing – and their decision-making is guided by safety. First flight will be a lower-altitude loop at about 240 mph to check system integration, kicking off a phase of flight testing […]",
    "published_at": "2025-09-12T18:37:32Z",
    "updated_at": "2025-09-12T18:40:15.136780Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "First flight will be a lower-altitude loop at about 240 mph to check system integration. During subsequent test flights, the X-59 will go higher and faster, eventually exceeding the speed of sound. The aircraft is designed to fly supersonic while generating a quiet thump rather than a loud sonic boom. The X-59's life support system is designed to deliver oxygen through the pilot’s mask to compensate for the decreased atmospheric pressure at 55,000 feet. In order to withstand high-altitude flight, Larson will also wear a counter-pressure garment, or g-suit, similar to what fighter pilots wear. All these systems form a network of safety, adding confidence to the pilot and engineers as they approach the next milestone – first flight."
  },
  {
    "id": 33033,
    "title": "NASA, War Department Partnership Tests Boundaries of Autonomous Drone Operations",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/ames/nasa-war-department-partnership-tests-boundaries-of-autonomous-drone-operations/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/acd25-0074-007.jpg",
    "news_site": "NASA",
    "summary": "Through an ongoing collaboration, NASA and the Department of War are working to advance the future of modern drones to support long distance cargo transportation that could increase efficiency, reduce human workload, and enhance safety.   Researchers from NASA’s Ames Research Center in California’s Silicon Valley recently participated in a live flight demonstration showcasing how […]",
    "published_at": "2025-09-12T18:22:46Z",
    "updated_at": "2025-09-12T18:30:09.845765Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and the Department of War are working to advance the future of modern drones. Drones could support long distance cargo transportation that could increase efficiency, reduce human workload, and enhance safety. Autonomous and semi-autonomous drones could potentially support a broad range of tasks for commercial, military, and private users."
  },
  {
    "id": 33032,
    "title": "Department of the Air Force, FAA clear SpaceX to launch up to 120 Falcon 9 rockets annually from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/12/department-of-the-air-force-faa-clear-spacex-to-launch-up-to-120-falcon-9-rockets-annually-from-cape-canaveral/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/09/20240928_Crew-9_launch_MC-1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The move not only allows SpaceX to increase its allowed launches at pad 40 from 50 to 120, but it also permits the Texas-based company to construct a new landing site adjacent to the launch pad. ",
    "published_at": "2025-09-12T17:31:45Z",
    "updated_at": "2025-09-12T17:40:18.493166Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The FAA and the Department of the Air Force gave the green light for SpaceX to more than double its launch cadence from its workhorse launch pad in Florida. The FAA issued a 21-page document called a Mitigated Finding of No Significant Impact and Record of Decision (FONSI/ROD) The FAA is currently working through the EIS process when it comes to bringing SpaceX’s massive Starship rocket to Florida. The Final EA was published this week by the U.S. Department of the Interior. SpaceX is required to conduct species monitoring for creatures like sea turtles, the Florida scrub-jay and the southeastern beach mouse. The FAA determined that plans proposed by SpaceX as evaluated by the Final EA wouldn’t violate the relevant section of the Endangered Species Act. SpaceX's Proposed Action includes construction of a new landing zone at SLC-40. It would consist of a 280-foot diameter concrete pad with a 60-foot-wide gravel apron. Roughly two acres of Florida scrub-jay and about seven acres of a combination of grassy areas, existing roads and infrastructure would be impacted. SpaceX announced during the launch campaign of the Crew-11 mission to the International Space Station that it would end its use of LZ-1 with that mission. SpaceX launched 60 more Starlink internet satellites at 10:59 p.m. EST Monday (0359 GMT Tuesday) aboard a Falcon 9 rocket from pad 40 at Cape Canaveral."
  },
  {
    "id": 33031,
    "title": "New U.S. military satellite constellation takes shape with first launch from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/12/new-u-s-military-satellite-constellation-takes-shape-with-first-launch-from-vandenberg-sfb/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/09/20250910_SDA_T1TL_B.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Space Development Agency’s Proliferated Warfighter Space Architecture constellation is expected to deliver global coverage beginning in 2027. Launch from Vandenberg Space Force Base occurred at 7:12 a.m. PDT (10:12 a.m. EDT / 1412 UTC). ",
    "published_at": "2025-09-12T17:16:04Z",
    "updated_at": "2025-09-12T17:20:25.011436Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Space Development Agency took a big step in realizing a new satellite constellation to support the various branches of the U.S. military and its allies. This was the first in a series of six launches for what it calls the Transport Layer of space vehicles. The mission began with a SpaceX Falcon 9 launch from Vandenberg Space Force Base. The first T1TL satellites will go through some early testing and then will be used by some early adopters within about four to six months. Sandhoo said that will primarily be the U.S. Indo-Pacific Command, one of six Unified Combatant Commands. “This is the first time we’ll have a space layer actually fully integrated into our war fighting operations,” he added."
  },
  {
    "id": 33030,
    "title": "A Brief Outburst",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/a-brief-outburst/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/brief-outburst-16760026566-oorig.jpg",
    "news_site": "NASA",
    "summary": "The NASA-ESA Solar and Heliospheric Observatory (SOHO) spacecraft captured this extreme ultraviolet wavelength image of the Sun on Feb. 24, 2015, during a three-hour period in which our closest star blew out a coronal mass ejection along with part of a solar filament. While some of the strands fell back into the Sun, a substantial […]",
    "published_at": "2025-09-12T15:36:50Z",
    "updated_at": "2025-09-12T15:40:04.393883Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The NASA-ESA Solar and Heliospheric Observatory (SOHO) captured this extreme ultraviolet wavelength image of the Sun on Feb. 24, 2015. Soon, there will be three new ways to study the Sun’s influence across the solar system with the launch of a trio of NASA and NOAA spacecraft."
  },
  {
    "id": 33029,
    "title": "NASA’s GUARDIAN Tsunami Detection Tech Catches Wave in Real Time",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/earth/natural-disasters/tsunamis/nasas-guardian-tsunami-detection-tech-catches-wave-in-real-time/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/1-honolulu-skyline-16.jpg",
    "news_site": "NASA",
    "summary": "A massive earthquake and subsequent tsunami off Russia in late July tested an experimental detection system that had deployed a critical component just the day before. A recent tsunami triggered by a magnitude 8.8 earthquake off Russia’s Kamchatka Peninsula sent pressure waves to the upper layer of the atmosphere, NASA scientists have reported. While the […]",
    "published_at": "2025-09-12T15:10:34Z",
    "updated_at": "2025-09-12T15:20:05.317648Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A massive earthquake and subsequent tsunami off Russia in late July tested an experimental detection system. The system flagged distortions in the atmosphere and issued notifications to subscribed subject matter experts. Within about 10 minutes of receiving data, it can produce a snapshot of a tsunami’s rumble. Tsunamis are most often caused by large undersea earthquakes, but not always. Volcanic eruptions, underwater landslides, and certain weather conditions in some geographic locations can all produce dangerous waves. Key to this effort is the network of GNSS stations around the world supported by NASA."
  },
  {
    "id": 33028,
    "title": "Cailabs Raises €57M to Ramp Up Production of Optical Ground Station",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/cailabs-raises-e57m-to-ramp-up-production-of-optical-ground-station/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/Cailabs-Raises-57M-Euros-to-Ramp-Up-Production-of-Optical-Ground-Station.webp",
    "news_site": "European Spaceflight",
    "summary": "French optical communication systems provider Cailabs has secured €57 million in new funding that it will use to scale production of its optical ground stations. Founded in 2013, Cailabs offers a range of laser-based solutions for a wide range of terrestrial and space applications. Among these is an off-the-shelf optical ground station that is designed […]\nThe post Cailabs Raises €57M to Ramp Up Production of Optical Ground Station appeared first on European Spaceflight.",
    "published_at": "2025-09-12T14:43:01Z",
    "updated_at": "2025-09-12T14:50:09.937799Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "French optical communication systems provider Cailabs has secured €57 million in new funding. The company plans to use the new funding to scale production to as many as 50 units per year by 2027. The new funding will support the company’s expansion into new markets and the development of new products."
  },
  {
    "id": 33025,
    "title": "Week in images: 08-12 September 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_08-12_September_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/blood_moon_over_concordia/26863960-1-eng-GB/Blood_moon_over_Concordia_card_full.jpg",
    "news_site": "ESA",
    "summary": " Week in images: 08-12 September 2025",
    "published_at": "2025-09-12T13:10:00Z",
    "updated_at": "2025-09-12T13:40:17.923260Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 33024,
    "title": "Artemis II Crew  to Advance Human Spaceflight Research",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/humans-in-space/artemis-ii-crew-to-advance-human-spaceflight-research/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/52790060302-221dc6d2af-k-1.png",
    "news_site": "NASA",
    "summary": "A sweeping collection of astronaut health studies planned for NASA’s Artemis II mission around the Moon will soon provide agency researchers with a glimpse into how deep space travel influences the human body, mind, and behavior. During an approximately 10-day mission set to launch in 2026, NASA astronauts Reid Wiseman, Victor Glover, and Christina Koch, […]",
    "published_at": "2025-09-12T13:01:27Z",
    "updated_at": "2025-09-12T13:10:07.582648Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronauts will collect and store their saliva, don wrist monitors that track movement and sleep. One study will explore how the immune system reacts to spaceflight. The findings are expected to provide vital insights for future missions to destinations beyond low Earth orbit, including Mars. “The lessons we learn from this crew will help us to more safely accomplish deep space missions and research,” an engineer says. Artemis missions will be the farthest NASA astronauts have ventured into space since the Apollo era. NASA also plans to use the Artemis II mission to help scientists characterize the radiation environment in deep space. Several CubeSats, shoe-box sized satellites that will be deployed into high-Earth orbit during Orion’s transit to the Moon, will probe the near and deep space radiation environment. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. Living in Space Artemis Human Research Program Space Station Research and Technology NASA explores the known and unknown in space and air, innovating for thebenefit of humanity."
  },
  {
    "id": 33023,
    "title": "How carrying enough water to make return-trip propellant simplifies a Starship mission to Mars",
    "authors": [
      {
        "name": "Donald Rapp",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/how-carrying-enough-water-to-make-return-trip-propellant-simplifies-a-starship-mission-to-mars/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/mars_carousel2_card1_d.jpg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe idea of a human mission to explore Mars has been studied repeatedly over the past 75 years. More than 1,000 piloted Mars mission studies were conducted inside and outside NASA between about 1950 and 2000. Many were the product of NASA and industry study teams, while others were the work of committed individuals or […]\nThe post How carrying enough water to make return-trip propellant simplifies a Starship mission to Mars appeared first on SpaceNews.",
    "published_at": "2025-09-12T13:00:00Z",
    "updated_at": "2025-09-12T13:00:49.292636Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33026,
    "title": "Group photo from General Assembly on Defence, Space and Cybersecurity",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/Group_photo_from_General_Assembly_on_Defence_Space_and_Cybersecurity",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/group_photo_from_general_assembly_on_defence_space_and_cybersecurity/26865866-1-eng-GB/Group_photo_from_General_Assembly_on_Defence_Space_and_Cybersecurity_card_full.jpg",
    "news_site": "ESA",
    "summary": "Group photo taken at the General Assembly on Defence, Space and Cybersecurity, held on Friday 12 September 2025, at ESRIN, ESA’s Centre for Earth Observation Programmes in Italy. ",
    "published_at": "2025-09-12T12:39:00Z",
    "updated_at": "2025-09-12T13:40:17.954244Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "General Assembly on Defence, Space and Cybersecurity, held on Friday 12 September 2025, at ESRIN, ESA’s Centre for Earth Observation Programmes in Italy. Event organised by the European Parliament and the European Commission, in collaboration with the European Space Agency. Representatives from major European entities debated the future of the European Union."
  },
  {
    "id": 33020,
    "title": "NSTGRO 2025",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/space-tech-research-grants/nstgro-2025/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2022/12/stmd.jpg",
    "news_site": "NASA",
    "summary": "NSTGRO Homepage Andrew ArendsUniversity of California, DavisAstronaut-Powered Laundry Machine Allan AttiaStanford UniversityComputational Modeling of Lithium Magnetoplasmadynamic Thruster for Nuclear Electric Propulsion Michael AuthUniversity of California, Santa BarbaraNon-Contact, Real-Time Diagnostics of Battery Aging in 18650 Cells During the Lunar Night Using Acoustic Spectroscopy Nicholas BrennanCornell UniversitySpin Wave-Based Neuromorphic Coprocessor for Advanced AI Applications John CarterPurdue UniversitySpectroscopic […]",
    "published_at": "2025-09-12T12:28:11Z",
    "updated_at": "2025-09-12T12:30:06.887311Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "University of California, Davis Astronaut-Powered Laundry Machine. Real-Time Diagnostics of Battery Aging in 18650 Cells During the Lunar Night. Spin Wave-Based Neuromorphic Coprocessor for Advanced AI Applications. Centimeter-Scale Robots for Accessing Europa’s Benthic Zone.  n Lie Groups for Precision Powered Descent Stanley Wang Stanford University Compact Robots with Long Reach for Space Exploration and Maintenance Tasks Thomas Westenhofer University of California, Irvine Kinetic Modeling of Carbon Mass Loss in Nuclear Thermal Propulsion Andrew Witty Purdue University Scalable Nanoporous Paints with High Solar Reflectance and Durability in Space Environments."
  },
  {
    "id": 33019,
    "title": "Hubble Surveys Cloudy Cluster",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-surveys-cloudy-cluster/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/nebulae/emission/Hubble_LMC_N44C_potw2536a.jpg",
    "news_site": "NASA",
    "summary": "This new NASA/ESA Hubble Space Telescope image features a cloudy starscape from an impressive star cluster. This scene is in the Large Magellanic Cloud, a dwarf galaxy situated about 160,000 light-years away in the constellations Dorado and Mensa. With a mass equal to 10–20% of the mass of the Milky Way, the Large Magellanic Cloud […]",
    "published_at": "2025-09-12T11:00:00Z",
    "updated_at": "2025-09-12T11:10:12.694179Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "This scene is in the Large Magellanic Cloud, a dwarf galaxy situated about 160,000 light-years away. We see bright, young stars lighting up the gas clouds and sculpting clumps of dust with powerful ultraviolet radiation. This image marries observations made roughly 20 years apart, a testament to Hubble’s longevity."
  },
  {
    "id": 33021,
    "title": "PAW Participant Discussion",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/events/paw-participant-discussion/",
    "image_url": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2023/01/nasa-logo-web-rgb.png",
    "news_site": "NASA",
    "summary": "Participants are encouraged to dialogue before, during, and after the workshop. Contact the organizing committee for further questions.",
    "published_at": "2025-09-12T10:51:46Z",
    "updated_at": "2025-09-12T12:40:05.145602Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. Participants are encouraged to dialogue before, during, and after the workshop. Contact the organizing committee for further questions. For more information, visit NASA's website."
  },
  {
    "id": 33018,
    "title": "Apex reaches billion-dollar valuation with Series D funding round",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/apex-reaches-billion-dollar-valuation-with-series-d-funding-round/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/05/Apex_Comet_DeployedInSpace.jpg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSatellite manufacturer Apex has raised $200 million in a new funding round that values the company at more than $1 billion.\nThe post Apex reaches billion-dollar valuation with Series D funding round appeared first on SpaceNews.",
    "published_at": "2025-09-12T10:29:46Z",
    "updated_at": "2025-09-12T10:30:26.060117Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33017,
    "title": "Drag Prediction Workshop Series",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/aiaa-dpw/",
    "image_url": "https://www.nasa.gov/wp-content/plugins/nasa-blocks/assets/images/topic-cards/topic-card-sample-1.jpg",
    "news_site": "NASA",
    "summary": "The Drag Prediction Workshop series is an extensive international effort to improve transonic aerodynamic predictions. This long-running collaborative effort seeks to mobilize the international aerospace community to improve the computational methods and tools to predict transonic aircraft performance, particularly drag. More details on the workshop can be found at the workshop website: https://www.aiaa-dpw.org NASA has […]",
    "published_at": "2025-09-12T10:18:20Z",
    "updated_at": "2025-09-12T10:20:05.397833Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Drag Prediction Workshop series is an international effort to improve transonic aerodynamic predictions. The series also resulted in the NASA/Boeing Common Research Model. NASA’s contributions to the upcoming DPW-8 and subsequent work will be highlighted on this page."
  },
  {
    "id": 33015,
    "title": "Cailabs raises $67 million to scale up production of optical ground stations",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/cailabs-raises-67-million-to-scale-up-production-of-optical-ground-stations/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/cailabs.jpeg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nCailabs, a French company that manufactures optical ground stations for satellite communications, has raised 57 million euros ($67 million) to scale up production.\nThe post Cailabs raises $67 million to scale up production of optical ground stations appeared first on SpaceNews.",
    "published_at": "2025-09-12T09:23:12Z",
    "updated_at": "2025-09-12T09:30:25.331852Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33014,
    "title": "Avio Approves €400M Capital Increase to Expand Defence and Rocket Production",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/avio-approves-e400m-capital-increase-to-expand-defence-and-rocket-production/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/Avio-Approves-400M-Euro-Capital-Increase-to-Expand-Defence-and-Rocket-Production.webp",
    "news_site": "European Spaceflight",
    "summary": "Italian rocket builder Avio’s Board of Directors has approved a €400 million capital increase to fund an expansion of its manufacturing capacity to meet rising demand in the global space and defence markets. Announced on 12 September, the capital raise is part of a new ten-year business plan targeting an average annual growth rate of […]\nThe post Avio Approves €400M Capital Increase to Expand Defence and Rocket Production appeared first on European Spaceflight.",
    "published_at": "2025-09-12T09:20:08Z",
    "updated_at": "2025-09-12T09:20:12.240306Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Italian rocket builder Avio’s Board of Directors has approved a €400 million capital increase. The capital raise is part of a new ten-year business plan targeting an average annual growth rate of about 10% in turnover. This growth will be driven by a higher Vega C launch cadence, the introduction of Vega E, and continued participation in the Ariane 6 programme."
  },
  {
    "id": 33013,
    "title": "Earth from Space: Gibson Desert, Australia",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/Earth_from_Space_Gibson_Desert_Australia",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/earth_from_space_gibson_desert_australia/26863612-1-eng-GB/Earth_from_Space_Gibson_Desert_Australia_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-12T08:00:00Z",
    "updated_at": "2025-09-12T08:40:12.874657Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Part of the Gibson Desert in Western Australia is featured in this image, captured by the Φsat-2 mission in June 2025. Covering an area of over 150 000 sq km, the desert consists of gravel terrains covered by desert grasses, as well as red sandy plains and dune fields. Parallel dune ridges are a defining characteristic of the area and can be seen spreading across the image."
  },
  {
    "id": 33027,
    "title": "Europe celebrates 30 years of satellite navigation",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Satellite_navigation/Europe_celebrates_30_years_of_satellite_navigation",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/30y_nav_galileo_galilei/26865162-1-eng-GB/30Y_NAV_Galileo_Galilei_card_full.jpg",
    "news_site": "ESA",
    "summary": "On 2 September 2025, the European Space Agency (ESA) opened the doors of ESTEC, its research and technology centre, to celebrate 30 years of European satellite navigation. Partners from across the continent gathered for a sensational event that took the audience on a journey through time, honouring the achievements and collaboration that have shaped this success story.",
    "published_at": "2025-09-12T07:10:00Z",
    "updated_at": "2025-09-12T14:30:14.603496Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency (ESA) opened the doors of ESTEC, its research and technology centre, to celebrate 30 years of European satellite navigation. Partners from across the continent gathered for a sensational event that took the audience on a journey through time. A photo exhibition invited visitors to reminisce about the beginnings of EGNOS and Galileo, while a captivating show brought to life incredible milestones. The 135th PB-NAV has been a cornerstone in guiding ESA’s navigation strategy. It has shaped policy and execution of key EU projects Galileo and EGNOS, and even beyond with FutureNAV and NAVISP. Delegates discussed proposals for the Council at Ministerial Level, to be held this November."
  },
  {
    "id": 33012,
    "title": "Columbus: 100 000 orbits and counting",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Human_and_Robotic_Exploration/Columbus_100_000_orbits_and_counting",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/columbus_laboratory/26864556-2-eng-GB/Columbus_laboratory_card_full.jpg",
    "news_site": "ESA",
    "summary": "Today, the Columbus laboratory aboard the International Space Station completes its 100 000th orbit around Earth—a remarkable achievement for Europe’s science module in space. ",
    "published_at": "2025-09-12T06:13:00Z",
    "updated_at": "2025-09-12T08:20:12.473107Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Columbus laboratory aboard the International Space Station completes its 100 000th orbit around Earth. Since its launch in 2008, Columbus has been a hub of research and innovation, orbiting at 28 800 km/h and approximately 400 km above Earth. It has hosted astronauts from over 20 countries, and supported hundreds of experiments that explore everything from human health to advanced materials."
  },
  {
    "id": 33011,
    "title": "House Appropriators Approve FY2026 Budget for NASA",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/house-appropriators-approve-fy2026-budget-for-nasa/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/07/NASA-approps-table-H-and-S-July-25-300x179.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "The House Appropriations Committee approved the FY2026 Commerce-Justice-Science (CJS) bill last evening including funding for NASA. The committee disagreed with the Trump Administration’s proposal to cut NASA’s budget by 24.3 […]",
    "published_at": "2025-09-11T21:27:25Z",
    "updated_at": "2025-09-11T21:30:16.533654Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The House Appropriations Committee approved the FY2026 Commerce-Justice-Science (CJS) bill last evening including funding for NASA. The committee disagreed with the Trump Administration’s proposal to cut NASA's budget by 24.3 percent and instead keeps the agency at roughly the same level as FY2025 — $24.8 billion. CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel each week for a new gallery of snapshots. Visit http://www.dailymail.co.uk/travel/features/tourist-pictures-tour-tours.html#storylink=cpy. We are happy to feature photos from around the world in our gallery."
  },
  {
    "id": 33010,
    "title": "NASA found intriguing rocks on Mars, so where does that leave Mars Sample Return?",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/nasa-found-intriguing-rocks-on-mars-so-where-does-that-leave-mars-sample-return/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/NHQ202507310028medium.jpg",
    "news_site": "Arstechnica",
    "summary": "\"I have to look at dollars, and I have to look at time, and I have to look at return.\"",
    "published_at": "2025-09-11T21:21:03Z",
    "updated_at": "2025-09-11T21:30:05.540816Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's interim administrator Sean Duffy joined a teleconference to talk about new scientific findings that concerned the potential for life to have once existed on Mars. Duffy was ready to discuss the scientific results along with NASA experts on the call with reporters. But the very first question concerned NASA's on-again, off-again plan to return rocks from the surface of Mars for study on Earth. Interim NASA administrator is open to negotiating with Congress about the best path forward. It has already been a turbulent year for the Trump administration and NASA's science programs. The White House, NASA, and Congress already face a host of thorny questions about the future of more than two dozen science missions."
  },
  {
    "id": 33008,
    "title": "NASA Armstrong to Host Partnership Day Oct. 21-22",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-armstrong-to-host-partnership-day-oct-21-22/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/2025-partnershipdays-508.jpg",
    "news_site": "NASA",
    "summary": "NASA’s Armstrong Flight Research Center in Edwards, California, invites innovative companies, government agencies, and organizations to attend Partnership Days, scheduled for Oct. 21-22, 2025, at the center. The event offers a unique opportunity to explore collaboration with NASA on cutting-edge research and development in areas such as aerospace, autonomy, sustainability, and more. Attendees will engage […]",
    "published_at": "2025-09-11T21:09:53Z",
    "updated_at": "2025-09-11T21:10:14.564336Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA’s Armstrong Flight Research Center in Edwards, California, invites innovative companies, government agencies, and organizations to attend Partnership Days. The event offers a unique opportunity to explore collaboration with NASA on cutting-edge research and development. Space is limited, and RSVP is required by Sept. 26."
  },
  {
    "id": 33009,
    "title": "Firefly pitches rockets, satellites for Golden Dome",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/firefly-pitches-rockets-satellites-for-golden-dome/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/53359913328_b82878da3e_h.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nCEO Jason Kim said the company’s Alpha vehicle could launch test targets while the Elytra platform could host interceptors for the Golden Dome missile-defense shield\nThe post Firefly pitches rockets, satellites for Golden Dome appeared first on SpaceNews.",
    "published_at": "2025-09-11T21:08:03Z",
    "updated_at": "2025-09-11T21:10:29.865478Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33007,
    "title": "Sophia and Armada link terrestrial and space edge processors",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/sophia-and-armada-link-terrestrial-and-space-edge-processors/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_cruiser_1_76d2a2f19e.png?fit=879%2C542&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nPARIS – Mobile edge computing specialist Armada and Sophia Space are working together to establish integrated, scalable compute infrastructure extending from Earth to space. By connecting terrestrial and orbital edge processors, the partners intend to “create a seamless edge-computing network that connects remote locations on Earth with computing resources in space,” according to the Sept. […]\nThe post Sophia and Armada link terrestrial and space edge processors appeared first on SpaceNews.",
    "published_at": "2025-09-11T20:23:00Z",
    "updated_at": "2025-09-11T20:30:23.974263Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33006,
    "title": "NASA Ames Science Directorate: Stars of the Month – September 2025",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/nasa-ames-science-directorate-stars-of-the-month-september-2025/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/stars-of-the-month-september-2025.jpg",
    "news_site": "NASA",
    "summary": "Ames Science Directorate’s Stars of the Month: September 2025 The NASA Ames Science Directorate recognizes the outstanding contributions of (pictured left to right) Taejin Park, Lydia Schweitzer, and Rachel Morgan. Their commitment to the NASA mission represents the entrepreneurial spirit, technical expertise, and collaborative disposition needed to explore this world and beyond. Earth Science Star: […]",
    "published_at": "2025-09-11T20:07:15Z",
    "updated_at": "2025-09-11T20:10:13.999739Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The NASA Ames Science Directorate recognizes the outstanding contributions of Taejin Park, Lydia Schweitzer, and Rachel Morgan. Their commitment to the NASA mission represents the entrepreneurial spirit, technical expertise, and collaborative disposition needed to explore this world and beyond. Park is the Project Scientist for the Wildfire, Ecosystem Resilience, & Risk Assessment project."
  },
  {
    "id": 33004,
    "title": "NASA, Embry-Riddle Enact Agreement to Advance Research, Educational Opportunities",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/langley/nasa-embry-riddle-enact-agreement-to-advance-research-educational-opportunities/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/dyal-and-ernst-standing-with-agreement.jpg",
    "news_site": "NASA",
    "summary": "As NASA inspires the world through discovery in a new era of innovation and exploration, NASA’s Langley Research Center in Hampton, Virginia, and Embry-Riddle Aeronautical University are working together to advance research, educational opportunities, and workforce development to enable the next generation of aerospace breakthroughs. The collaborative work will happen through a Space Act Agreement […]",
    "published_at": "2025-09-11T19:01:18Z",
    "updated_at": "2025-09-11T19:10:13.012547Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA Langley Research Center and Embry-Riddle Aeronautical University sign a Space Act Agreement. The agreement will leverage NASA Langley’s aerospace expertise to drive innovation in aerospace, research, education, and technology. It will also develop a highly skilled workforce for the future of space exploration and advanced air mobility."
  },
  {
    "id": 33003,
    "title": "Shining Pismis 24",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/shining-pismis-24/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/54764951141-82cb69f2cd-o.png",
    "news_site": "NASA",
    "summary": "NASA’s James Webb Space Telescope captured this sparkling scene of star birth in an image released on Sept. 4, 2025. Called Pismis 24, this young star cluster resides in the core of the nearby Lobster Nebula, approximately 5,500 light-years from Earth in the constellation Scorpius. Home to a vibrant stellar nursery and one of the […]",
    "published_at": "2025-09-11T17:58:47Z",
    "updated_at": "2025-09-11T18:00:11.835114Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA’s James Webb Space Telescope captured this sparkling scene of star birth in an image released on Sept. 4, 2025. Called Pismis 24, this young star cluster resides in the core of the nearby Lobster Nebula, approximately 5,500 light-years from Earth."
  },
  {
    "id": 33002,
    "title": "New U.S.-European Sea Level Satellite Will Help Safeguard Ships at Sea",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/jason-cs-sentinel-6/sentinel-6b/new-u-s-european-sea-level-satellite-will-help-safeguard-ships-at-sea/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/ship-waves-bering-sea-noaa.jpg",
    "news_site": "NASA",
    "summary": "Sea surface height data from the Sentinel-6B satellite, led by NASA and ESA, will help with the development of marine weather forecasts, alerting ships to possible dangers. Because most global trade travels by ship, accurate, timely ocean forecasts are essential. These forecasts provide crucial information about storms, high winds, and rough water, and they depend […]",
    "published_at": "2025-09-11T17:41:16Z",
    "updated_at": "2025-09-11T17:50:06.426760Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Sentinel-6B will provide essential sea level and other ocean data after it launches this November. The satellite will eventually take over from its twin, Sentinel-6 Michael Freilich, which launched in 2020. Both satellites have an altimeter instrument that measures sea levels, wind speeds, and wave heights, among other characteristics. Sentinel-6B will extend a long-term dataset featuring more than 30 years of sea level measurements. The dataset has turned this dataset into the gold standard sea level measurement from space. “This kind of data can’t be easily replaced,” said Mehra."
  },
  {
    "id": 33001,
    "title": "NASA’s Sean Duffy surprising leadership",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/nasas-sean-duffy-surprising-leadership/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/070325-space-minds-podcast-moon-2000x1500-1.png?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIn this week’s episode of Space Minds, host Mike Gruss is joined by SpaceNews senior writer Jeff Foust to break down the surprising appointment of Sean Duffy as NASA’s Acting Administrator.\nThe post NASA’s Sean Duffy surprising leadership appeared first on SpaceNews.",
    "published_at": "2025-09-11T17:21:47Z",
    "updated_at": "2025-09-11T17:30:20.978975Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 32999,
    "title": "Artemis II Crew Both Subjects and Scientists in NASA Deep Space Research",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/artemis-ii-crew-both-subjects-and-scientists-in-nasa-deep-space-research/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2023/09/53206112789-e5e932c583-o.jpg",
    "news_site": "NASA",
    "summary": "With Artemis II, NASA is taking the science of living and working in space beyond low Earth orbit. While the test flight will help confirm the systems and hardware needed for human deep space exploration, the crew also will be serving as both scientists and volunteer research subjects, completing a suite of experiments that will […]",
    "published_at": "2025-09-11T16:55:10Z",
    "updated_at": "2025-09-11T17:00:12.122516Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's Artemis II mission will explore how deep space travel affects sleep, stress, cognition, and teamwork. Results will help the agency build future interventions, protocols, and preventative measures to best protect astronauts on future missions to the lunar surface and to Mars. Saliva provides a unique window into how the human immune system functions in a deep space environment. AVATAR could inform measures to ensure crew health on future deep space missions, including personalizing medical kits to each astronaut. The Artemis II crew will take advantage of their location to explore the Moon from above. As the first humans to see the lunar surface up close since 1972, they’ll document their observations through photographs and audio recordings. Artemis II will be the first mission to integrate science flight control operations. The crew will be equipped with questions that scientists didn’t even know to ask during Apollo missions. Lessons learned during Artemis II will pave the way for lunar science operations on future missions. Several additional experiments are hitching a ride to space onboard Artemis II in the form of CubeSats – shoe-box-sized technology demonstrations."
  },
  {
    "id": 33000,
    "title": "NASA’s Northrop Grumman CRS-23 Infographics & Hardware",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/commercial-resupply/ng-crs/nasas-northrop-grumman-crs-23-infographics-hardware/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/iss071e418233large.jpg",
    "news_site": "NASA",
    "summary": "NASA’s Northrop Grumman Commercial Resupply Services 23, or Northrop Grumman CRS-23, will deliver more than 11,000 pounds of science and supplies to the International Space Station. This mission will be the first flight of the Cygnus XL, the larger, more cargo-capable version of the company’s solar-powered spacecraft. The Cygnus XL will launch on a SpaceX […]",
    "published_at": "2025-09-11T16:50:06Z",
    "updated_at": "2025-09-11T17:00:12.227058Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Northrop Grumman CRS-23 will deliver more than 11,000 pounds of science and supplies to the International Space Station. This mission will be the first flight of the Cygnus XL, the larger, more cargo-capable version of the company’s solar-powered spacecraft. The Upper, X, Y, and Z Isolator Assemblies are launching as spares for the space station’s treadmill. Quick Don Mask Assembly – This mask is used by the crew, along with the Pre-Breath Assembly, in emergency situations. Anomaly Gas Analyzer – This analyzer senses various gases, like oxygen, carbon dioxide, carbon monoxide, ammonia, and others."
  },
  {
    "id": 32998,
    "title": "After Biosignature Announcement, Mars Sample Return Remains in Limbo",
    "authors": [
      {
        "name": "Alejandro Turnbull",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/09/after-biosignature-announcement-mars-sample-return-remains-in-limbo/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2024/04/CurrentPlan.jpeg",
    "news_site": "Space Scout",
    "summary": "Ambitious plans by NASA and the European Space Agency to return samples of the Martian surface to Earth continue to remain in limbo even as the Agency has announced the collection of a potentially biosignature-containing sample aboard the Perseverance rover.",
    "published_at": "2025-09-11T16:41:21Z",
    "updated_at": "2025-09-11T16:50:19.703285Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and the European Space Agency have announced the collection of a potentially biosignature-containing sample aboard the Perseverance rover. This sample, stored in a tube inside the rover, is intended for return to earth on a future Mars Sample Return mission. This tantalizing discovery may provide a renewed sense of urgency for Martian exploration within the second Trump administration. The potential game-changing nature of the Sapphire Canyon sample adds new urgency to the future of the Mars Sample Return program. China has announced plans to launch their own Mars sample return mission as early as 2028. Europe, meanwhile, appears intent on further developing its own Martian capabilities."
  },
  {
    "id": 33016,
    "title": "ispace-Europe Completes Key Milestone for ESA MAGPIE Lunar Rover",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/ispace-europe-completes-key-milestone-for-esa-magpie-lunar-rover/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/ispace-Europe-Completes-Key-Milestone-for-ESA-MAGPIE-Lunar-Lander-update.webp",
    "news_site": "European Spaceflight",
    "summary": "Luxembourg-based ispace-Europe has completed the Mission Definition Review for the European Space Agency’s MAGPIE lunar rover mission. The Mission for Advanced Geophysics and Polar Ice Exploration (MAGPIE) is designed to prospect for water ice in the Moon’s south polar region. It will also map the distribution of hydrogen and study the geological history of the […]\nThe post ispace-Europe Completes Key Milestone for ESA MAGPIE Lunar Rover appeared first on European Spaceflight.",
    "published_at": "2025-09-11T15:50:13Z",
    "updated_at": "2025-09-12T09:50:11.528486Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Luxembourg-based ispace-Europe has completed the Mission Definition Review for the European Space Agency’s MAGPIE lunar rover mission. The Mission for Advanced Geophysics and Polar Ice Exploration (MAGPIE) is designed to prospect for water ice in the Moon's south polar region. It will also map the distribution of hydrogen and study the geological history of the area."
  },
  {
    "id": 32996,
    "title": "ispace-Europe Completes Key Milestone for ESA MAGPIE Lunar Lander",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/ispace-europe-completes-key-milestone-for-esa-magpie-lunar-lander/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/ispace-Europe-Completes-Key-Milestone-for-ESA-MAGPIE-Lunar-Lander-update.webp",
    "news_site": "European Spaceflight",
    "summary": "Luxembourg-based ispace-Europe has completed the Mission Definition Review for the European Space Agency’s MAGPIE lunar lander mission. The Mission for Advanced Geophysics and Polar Ice Exploration (MAGPIE) is designed to prospect for water ice in the Moon’s south polar region. It will also map the distribution of hydrogen and study the geological history of the […]\nThe post ispace-Europe Completes Key Milestone for ESA MAGPIE Lunar Lander appeared first on European Spaceflight.",
    "published_at": "2025-09-11T15:50:13Z",
    "updated_at": "2025-09-11T15:50:22.704308Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Luxembourg-based ispace-Europe has completed the Mission Definition Review for the European Space Agency’s MAGPIE lunar lander mission. The Mission for Advanced Geophysics and Polar Ice Exploration (MAGPIE) is designed to prospect for water ice in the Moon's south polar region. It will also map the distribution of hydrogen and study the geological history of the area."
  },
  {
    "id": 32997,
    "title": "Sentinel-1D in French Guiana for launch campaign",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-1/Sentinel-1D_in_French_Guiana_for_launch_campaign",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/unloading_sentinel-1d/26864007-1-eng-GB/Unloading_Sentinel-1D_card_full.jpg",
    "news_site": "ESA",
    "summary": "The fourth satellite for the Copernicus Sentinel-1 mission, Sentinel-1D, has arrived at Félix Eboué airport, the main airport in French Guiana. From there the spacecraft, safely stored in its protective casing, will be transported to launch preparation facilities at the European Spaceport in Kourou.",
    "published_at": "2025-09-11T15:30:00Z",
    "updated_at": "2025-09-11T16:00:15.450040Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The fourth satellite for the Copernicus Sentinel-1 mission has arrived at Félix Eboué airport, the main airport in French Guiana. It will be transported to launch preparation facilities at the European Spaceport in Kourou. This is the start of a launch campaign that will lead up to the launch date, still to be announced. The satellite will reach its orbit on board an Ariane 6."
  },
  {
    "id": 32995,
    "title": "Progress MS-32 set for launch to ISS from Baikonur",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/progress-ms-32/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/IMG_1432.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "Just over two weeks after the CRS-33 cargo delivery to the International Space Station, another…\r\nThe post Progress MS-32 set for launch to ISS from Baikonur appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-11T13:08:29Z",
    "updated_at": "2025-09-11T15:01:02.900410Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "d4813e5c-305e-4401-ba4f-917aa1aaceae",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The Progress MS-32 cargo ship is scheduled to dock with the International Space Station on Saturday, Sept. 13. The docking, as is usual for Progress craft, will be automated, but with a manual backup available for use if needed. The Progress spacecraft can carry up to 2,140 kg of trash for disposal. Kurs-NA requires just one phased array antenna as opposed to the old system’s use of four. The new system is also lighter and uses less power, with additional computerization, while being manufactured entirely in Russia. The TORU capability was last used in 2021, when current Station commander, Ryzhikov, used the manual backup to successfully dock Progress MS-16."
  },
  {
    "id": 32994,
    "title": "Plato arrived at ESA’s test centre by boat",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Plato/Plato_arrived_at_ESA_s_test_centre_by_boat",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/plato_sailing_to_the_netherlands_by_boat/26862081-1-eng-GB/Plato_sailing_to_the_Netherlands_by_boat_card_full.jpg",
    "news_site": "ESA",
    "summary": "The European Space Agency’s Plato spacecraft has safely arrived at ESTEC, ESA’s technical heart in the Netherlands. There, engineers will complete the spacecraft by connecting its solar panels and sunshield, and carry out a series of critical tests to confirm that Plato is fit for launch and ready for its planet-hunting mission in space.",
    "published_at": "2025-09-11T12:00:00Z",
    "updated_at": "2025-09-11T15:00:56.555263Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "526b4a0f-f0c9-4a20-9066-e9fc8c79307b",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Plato is scheduled to launch on an Ariane 6 rocket in December 2026. It will search for Earth-like planets orbiting stars similar to our Sun. The spacecraft is equipped with 26 ultrasensitive cameras designed to capture the tiniest variations in the intensity of a star’s light."
  }
]