[
  {
    "id": 32843,
    "title": "Juno Detected the Final Missing Auroral Signature from Jupiter’s Four Largest Moons",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/juno/juno-detected-the-final-missing-auroral-signature-from-jupiters-four-largest-moons/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/juno/Juno%20observes%20auroral%20footprint%20of%20Callisto%20during%20PJ22.jpg",
    "news_site": "NASA",
    "summary": "Jupiter hosts the brightest and most spectacular auroras in the Solar System. Near its poles, these shimmering lights offer a glimpse into how the planet interacts with the solar wind and moons swept by Jupiter’s magnetic field. Unlike Earth’s northern lights, the largest moons of Jupiter create their own auroral signatures in the planet’s atmosphere […]",
    "published_at": "2025-09-03T00:56:53Z",
    "updated_at": "2025-09-03T01:10:05.842093Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Jupiter hosts the brightest and most spectacular auroras in the Solar System. Near its poles, these shimmering lights offer a glimpse into how the planet interacts with the solar wind. Unlike Earth’s northern lights, the largest moons of Jupiter create their own auroral signatures. These moon-induced auroras reveal how each moon interacts with its local space environment."
  },
  {
    "id": 32842,
    "title": "Interview with Dr. Caleb Scharf",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/interview-with-dr-caleb-scharf/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2023/08/caleb-scharf13.jpg",
    "news_site": "NASA",
    "summary": "_________________________________________________________________________________________ In the following interview, questions from the interviewer, Fred Van Wert, are in bold, and Caleb Scharf’s responses are in regular text. _________________________________________________________________________________________ Let’s begin with your early years. Where you were born, something about your family, what your mother and father did, your early schooling, what got you interested in the career that […]",
    "published_at": "2025-09-03T00:38:54Z",
    "updated_at": "2025-09-03T00:40:05.391150Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Caleb Scharf was born in London, England, but grew up in a rural part of England. His parents were both academics and both were art historians. Scharf's grandfather was a musician and played in the Hollywood Studios in the 1930’s. He is an only child, for which his wife always pokes fun at him. In school, you had a growing interest in the stars, and that’s a science, astronomy is science. The math was, I wouldn’t say it was easy, but it came reasonably naturally to me. I did physics with a concentration in theoretical physics, which drove me a little crazy because it was really difficult. Ames is the birthplace of the science of astrobiology. Ames is also home to the Ames Research Center. Ames has a reputation for innovation and leading the field. Ames was rocked by the loss of its lab at the end of the last decade. The Ames team is now focused on developing climate models for exoplanets. I was also very lucky to work on a number of astrophysics projects where I think we made some significant discoveries. One I’m particularly proud of was using the Chandra X-ray Telescope. I think it’s made a significant contribution to understanding not only the possibilities for life but also the possibility for planets themselves. The physicist has two daughters who are now in their twenties, one has just graduated from college and the other is getting close to graduating. \"I’m extremely proud of them both. It’s really exciting as a parent to see them beginning to find their way in the world,\" he says. I like to mow the lawn because you can see the results of your work immediately. I like hedge trimming as well, which may be the British side of me! We like carefully pruned hedges and shrubbery. I’m a pretty good cook, although cooking for me is primarily because I enjoy it. I don’t like the process of traveling but I like it when I get there. JWST is asking readers to send in pictures of things they find interesting. If there’s a JWST image that you find particularly appealing or interesting, one that we might we see on the wall of your office or in your house, you can include that and others when you return the edited transcript. Among the images I find most interesting are the earth from space. NASA scientist John Grunsfeld has written over five hundred pieces for Scientific American over ten years. He has also written a bunch of books and is working on a new book called “The Giant Leap’ His advice to younger scientists: “Think about that side of yourself, your capacity to share\" Interview conducted by Fred Van Wert on March 28, 2024. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. Interview conducted byFred Van Werff on March 27, 2024, at NASA HQ in Washington, DC."
  },
  {
    "id": 32841,
    "title": "Trump Moves U.S. Space Command to Alabama",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/trump-moves-u-s-space-command-to-alabama/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/Trump-all-best-300x140.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "President Trump announced today he is moving the headquarters of U.S. Space Command from Colorado to Alabama. The decision has been expected since he returned to office, restoring a decision […]",
    "published_at": "2025-09-02T21:46:31Z",
    "updated_at": "2025-09-02T21:50:19.086658Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Trump announced today he is moving the headquarters of U.S. Space Command from Colorado to Alabama. The decision has been expected since he returned to office, restoring a decision made in his first term, but overturned by President Biden. The battle between Alabama and Colorado has been waged over the past four years on bipartisan grounds. USSPACECOM will be co-located at Redstone Arsenal along with other government installations including NASA’s Marshall Space Flight Center, the FBI, and the Missile Defense Agency. Sen. Tommy Tuberville (R-AL) said choosing Huntsville “will save taxpayers $480 million”"
  },
  {
    "id": 32839,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Wednesday sunrise Falcon 9 flight",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/02/live-coverage-spacex-to-launch-28-starlink-satellites-on-wednesday-sunrise-falcon-9-flight/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/02/20250211_Starlink_12-18_prelaunch.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-22 mission will be the 75th orbital launch from Florida’s Space Coast in 2025. SpaceX is targeting liftoff from pad 40 at Cape Canaveral Space Force Station at 7:06 a.m. EDT (1106 UTC). ",
    "published_at": "2025-09-02T20:55:05Z",
    "updated_at": "2025-09-02T21:00:21.883714Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The mission, dubbed Starlink 10-22, will be the company’s 110th Falcon 9 launch of the year. SpaceX will launch the missions using the first stage booster 1083, which will fly for a 14th time. If successful, this will be there 123rd landing on this vessel and the 499th booster landing to date. The 28 Starlink V2 Mini satellites onboard the rocket will be deployed a little more than an hour after liftoff."
  },
  {
    "id": 32840,
    "title": "Live coverage: SpaceX’s Tuesday night Starlink features rare debut of a Falcon booster",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/02/live-coverage-spacexs-tuesday-night-starlink-features-rare-debut-of-a-falcon-booster/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2022/07/20220721f9starlink3-2-pre.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 17-8 mission will be just the seventh new booster for the company out of more than 100 launches this year. SpaceX is targeting liftoff from pad 4E at Vandenberg Space Force Base at 8:21 p.m. PDT (11:21 p.m. EDT / 0321 UTC). ",
    "published_at": "2025-09-02T20:52:48Z",
    "updated_at": "2025-09-02T21:00:21.904462Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is gearing up for its first Falcon 9 launch of the month. The Tuesday night launch from Vandenberg Space Force Base features the flight of a new Falcon 9 rocket booster. The mission, dubbed Starlink 17-8, consists of 24 Starlink V2 Mini satellites. SpaceX has launched more than 1,900 of its satellites so far in 2025."
  },
  {
    "id": 32838,
    "title": "NASA 2026 Human Lander Challenge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/prizes-challenges-crowdsourcing-program/center-of-excellence-for-collaborative-innovation-coeci/nasa-2026-human-lander-challenge/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/hulc-logo.jpg",
    "news_site": "NASA",
    "summary": "NASA’s Human Lander Challenge (HuLC) is an initiative supporting its Exploration Systems Development Mission Directorate’s (ESDMD’s) efforts to explore innovative solutions for a variety of known technology development areas for human landing systems (HLS). Landers are used to safely ferry astronauts to and from the lunar surface as part of the mission architecture for NASA’s Artemis […]",
    "published_at": "2025-09-02T20:42:22Z",
    "updated_at": "2025-09-02T20:50:08.276655Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA’s Human Lander Challenge (HuLC) is open to teams comprised of full-time or part-time undergraduate and/or graduate students at an accredited U.S.-based community college, college, or university. HuLC projects allow students to incorporate their coursework into real aerospace design concepts."
  },
  {
    "id": 32837,
    "title": "Lydia Rodriguez Builds a Career of Service and Support at NASA",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/lydia-rodriguez-builds-a-career-of-service-and-support-at-nasa/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/20250527-lydia-rodriguez-portrait-0005-high-1.jpg",
    "news_site": "NASA",
    "summary": "Lydia Rodriguez is an office administrator in the Flight Operations Directorate’s Operations Division and Operations Tools and Procedures Branch at NASA’s Johnson Space Center in Houston.  Over nearly two decades, she has supported nine organizations, helping enable NASA’s missions and forming lasting relationships along the way.  “I’ve had the opportunity to meet many different people […]",
    "published_at": "2025-09-02T20:28:17Z",
    "updated_at": "2025-09-02T20:30:07.274405Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Lydia Rodriguez is an office administrator at NASA’s Johnson Space Center in Houston. Her path to NASA began in high school, when her parents encouraged her to apply for a part-time Office Education student position at Johnson. Rodriguez hopes to pass on the excitement of being part of the next frontier of space exploration."
  },
  {
    "id": 32836,
    "title": "Ted Cruz reminds us why NASA’s rocket is called the “Senate Launch System”",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/ted-cruz-reminds-us-why-nasas-rocket-is-called-the-senate-launch-system/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/ted-cruz.jpg",
    "news_site": "Arstechnica",
    "summary": "\"We need better than just window dressing.\"",
    "published_at": "2025-09-02T17:21:31Z",
    "updated_at": "2025-09-02T17:30:06.710147Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Ted Cruz, a Texas Republican, chairs the Senate Commerce, Science, and Transportation Committee. He has made a significant shift toward supporting the SLS rocket and its chief contractor, Boeing. Cruz has made it clear that his priorities for human spaceflight are to beat China back to the Moon. NASA has contracted with SpaceX and Blue Origin to build reusable lunar landers for Artemis, without which NASA astronauts can only fly around the Moon. By itself, the SLS rocket is expected to have a flight rate of once every other year, or annually at best. If Congress wants a sustained presence on the Moon, it needs one or both of SpaceX's Starship or Blue Origin's Mark II landers to work."
  },
  {
    "id": 32835,
    "title": "What’s Up: September 2025 Skywatching Tips from NASA",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/centers-and-facilities/jpl/whats-up-september-2025-skywatching-tips-from-nasa/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/psd/solar-system/skywatching/2025/september/Saturn_skychart_September2025.png",
    "news_site": "NASA",
    "summary": "Saturn’s spectacle, a Conjunction, and the Autumnal Equinox Saturn shines throughout the month, a conjunction sparkles in the sky, and we welcome the autumnal equinox.  Skywatching Highlights Transcript What’s Up for September? Saturn puts on a spectacular show, a sunrise conjunction shines bright, and we ring in the autumnal equinox. Saturn at Opposition Saturn will […]",
    "published_at": "2025-09-02T15:36:03Z",
    "updated_at": "2025-09-02T16:10:07.481183Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "On September 21, Saturn will be at opposition, meaning Earth will find itself in between Saturn and the Sun, temporarily lined up. On September 22, we mark the autumnal equinox or the official start of fall in the northern hemisphere. The Moon will be nestled up right next to both Venus and Regulus."
  },
  {
    "id": 32834,
    "title": "Circular Star Trails",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/circular-star-trails/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/iss073e0427643orig.jpg",
    "news_site": "NASA",
    "summary": "On July 26, 2025, NASA astronaut Nichole Ayers took this long-exposure photograph – taken over 31 minutes from a window inside the International Space Station’s Kibo laboratory module – capturing the circular arcs of star trails. In its third decade of continuous human presence, the space station has a far-reaching impact as a microgravity lab […]",
    "published_at": "2025-09-02T14:17:28Z",
    "updated_at": "2025-09-02T14:20:11.571068Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Long-exposure photograph taken over 31 minutes from a window inside the International Space Station’s Kibo laboratory module. In its third decade of continuous human presence, the space station has a far-reaching impact as a microgravity lab hosting technology, demonstrations, and scientific investigations."
  },
  {
    "id": 32833,
    "title": "Advancing Single-Photon Sensing Image Sensors to Enable the Search for Life Beyond Earth",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/stmd/advancing-single-photon-sensing-image-sensors-to-enable-the-search-for-life-beyond-earth/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/science-enabling-technology/technology-highlights/2025/SPSCMOSsensor1.jpg",
    "news_site": "NASA",
    "summary": "Advancing Single-Photon Sensing Image Sensors to Enable the Search for Life Beyond Earth A NASA-sponsored team is advancing single-photon sensing Complementary Metal-Oxide-Semiconductor (CMOS) detector technology that will enable future NASA astrophysics space missions to search for life on other planets. As part of their detector maturation program, the team is characterizing sensors before, during, and […]",
    "published_at": "2025-09-02T14:00:32Z",
    "updated_at": "2025-09-02T14:10:06.767813Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A NASA-sponsored team is advancing single-photon sensing Complementary Metal-Oxide-Semiconductor (CMOS) detector technology. The technology will enable future NASA astrophysics space missions to search for life on other planets. The Habitable Worlds Observatory will seek to find biosignatures in the ultraviolet, optical, and near-infrared (NIR) spectra of exoplanet atmospheres. The RIT team is developing new readout modes that are not available in commercial CMOS sensors. These custom modes sample the signal over time (a \"ramp\" acquisition) to enable the detection and removal of cosmic ray artifacts. In one mode, when the system identifies an artifact, it segments the signal ramp and selectively averages the segments to reconstruct the original signal. SPSCMOS technology promises to be a game-changer for exoplanet and general astrophysics research. These sensors will enhance our ability to detect and analyze distant worlds. This could bring us one step closer to answering one of humanity’s most profound questions: are we alone?"
  },
  {
    "id": 32832,
    "title": "Tech From NASA’s Hurricane-hunting TROPICS Flies on Commercial Satellites",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/earth/tech-from-nasas-hurricane-hunting-tropics-flies-on-commercial-satellites/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2023/05/TROPICS-Pathfinder-300x300-1.jpg",
    "news_site": "NASA",
    "summary": "NASA science and American industry have worked hand-in-hand for more than 60 years, transforming novel technologies created with NASA research into commercial products like cochlear implants, memory-foam mattresses, and more. Now, a NASA-funded device for probing the interior of storm systems has been made a key component of commercial weather satellites. The novel atmospheric sounder […]",
    "published_at": "2025-09-02T13:53:35Z",
    "updated_at": "2025-09-02T14:00:08.653728Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA-funded device for probing the interior of storm systems has been made a key component of commercial weather satellites. Atmospheric sounders allow researchers to gather data describing humidity, temperature, and wind speed. From low-Earth orbit, these devices help make air travel safer, shipping more efficient, and severe weather warnings more reliable. Tomorrow.io plans to have a full constellation of atmospheric sounders in orbit by 2025. The company also has two radar instruments that were launched in 2023. Tomorrow.io was among eight companies selected by NASA’s Commercial SmallSat Data Acquisition (CSDA) program in September 2024."
  },
  {
    "id": 32831,
    "title": "SpaceX McGregor looks to the future, from Raptor 3 to potential HLS testing",
    "authors": [
      {
        "name": "Alejandro Alcantarilla Romera and Chris Bergin",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/spacex-mcgregor-raptor-3-hls/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/NSF-2025-09-02-04-39-19-634.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX’s engine development and testing site in McGregor—the world’s most active rocket engine test facility—continues…\nThe post SpaceX McGregor looks to the future, from Raptor 3 to potential HLS testing appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-02T12:13:12Z",
    "updated_at": "2025-09-02T12:20:19.686911Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NSF photographer Gary Blair captured the assembly of a substantial new rig at one of the facility's test locations. The McGregor facility serves as a versatile testing ground for various Starship components. Recent updates reveal intensified Raptor engine trials and the construction of a large-scale rig. The latter has ignited speculation about its potential ties to Starship’s Human Landing System. SpaceX has not commented on the rig’s intended use, and observers caution that it could be for more mundane applications. The new structure could theoretically support a compact prototype of the HLS lander, outfitted with essential systems for lunar landing simulations. It might house an array of sensors positioned above a mock lunar terrain to refine autonomous landing capabilities, which are crucial for HLS."
  },
  {
    "id": 32829,
    "title": "EU to Commission Mobile Responsive Launch System Studies",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/eu-to-commission-mobile-responsive-launch-system-studies/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/EU-to-Commission-Mobile-Responsive-Launch-System-Studies.webp",
    "news_site": "European Spaceflight",
    "summary": "The European Commission has launched a call for studies to examine the potential of a mobile responsive launch system, a capability that would enable the rapid deployment of satellites into orbit from non-permanent (mobile) ground platforms. In the preamble to the call published on 10 July, the Commission notes that due to an increasing number […]\nThe post EU to Commission Mobile Responsive Launch System Studies appeared first on European Spaceflight.",
    "published_at": "2025-09-02T08:29:44Z",
    "updated_at": "2025-09-02T08:30:10.577241Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Commission has launched a call for studies to examine the potential of a mobile responsive launch system. The capability would enable the rapid deployment of satellites into orbit from non-permanent (mobile) ground platforms. The total budget for the call is €1.95 million, with up to €650,000 available for each study."
  },
  {
    "id": 32830,
    "title": "New MetOp Second Generation weather satellite returns first data",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Meteorological_missions/MetOp_Second_Generation/New_MetOp_Second_Generation_weather_satellite_returns_first_data",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/first_glimpse_of_metop-sg-a1_microwave_sounder_data/26852519-1-eng-GB/First_glimpse_of_MetOp-SG-A1_Microwave_Sounder_data_card_full.jpg",
    "news_site": "ESA",
    "summary": "Less than three weeks since the first MetOp Second Generation weather satellite, MetOp-SG-A1, was launched, this remarkable new satellite has already started transmitting data from two of its cutting-edge instruments, offering a tantalising glimpse of what’s to come.",
    "published_at": "2025-09-02T08:00:00Z",
    "updated_at": "2025-09-02T09:00:16.461935Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The MetOp Second Generation (MetOp-SG) mission builds on the proven success of the first-generation MetOp satellites. It will provide the essential data needed to strengthen weather prediction models and deepen our understanding of Earth’s changing climate. Launched on 13 August, aboard an Ariane 6 rocket from the European Spaceport in French Guiana, Eumetsat is currently putting the new satellite through a rigorous commissioning phase. Metop-SG-A1 is expected to require months of thorough testing and calibration before any data are released to Member State meteorological services and other users. Both the MWS and RO will provide inputs of unprecedented precision for numerical weather predication. The curves are plotted alongside ECMWF forecast data. The RO measurements refine and update temperature and humidity structure predictions."
  },
  {
    "id": 32828,
    "title": "Launch Roundup: SpaceX to launch five Falcon 9 missions this week",
    "authors": [
      {
        "name": "John Sharp",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/launch-roundup-090125/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2023/11/Nov.-3-2023-Falcon-9-Starlink-6-26-Streak-Shot.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Five Falcon 9 launches make up the launch manifest for this week. Collectively, four of…\nThe post Launch Roundup: SpaceX to launch five Falcon 9 missions this week appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-01T22:01:09Z",
    "updated_at": "2025-09-01T22:10:20.560054Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The first of SpaceX’s five scheduled Falcon 9 missions for this week, Starlink Group 17-8, is due to launch from Space Launch Complex 4 East (SLC-4E) at Vandenberg Space Force Base (VSFB) in California on Tuesday, Sept. 2. A new booster, B1097, is expected to support this mission. The payload will consist of 24 Starlink v2 Mini satellites launched due south to a Sun-synchronous orbit (SSO) The first stage booster is powered by nine Merlin 1D engines, while the second stage utilizes a single vacuum-optimized Merlin engine. Starlink Group 10-57 mission is expected to launch on Thursday, Sept. 4, at 7:18 AM EDT (11:18 UTC) from Launch Complex 39A (LC-39A) at the Kennedy Space Center in Florida. Falcon 9’s payload will consist of 28 Starlink v2 Mini satellites launched northeast to a low Earth orbit (LEO) Falcon 9 | Nusantara 5 (Lima) mission will place an Indonesian high-throughput telecommunications satellite into geostationary transfer orbit."
  },
  {
    "id": 32827,
    "title": "Double trouble: Solar Orbiter traces superfast electrons back to Sun",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Solar_Orbiter/Double_trouble_Solar_Orbiter_traces_superfast_electrons_back_to_Sun",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/solar_orbiter_traces_superfast_electrons_back_to_sun2/26849994-2-eng-GB/Solar_Orbiter_traces_superfast_electrons_back_to_Sun_card_full.png",
    "news_site": "ESA",
    "summary": "The European Space Agency-led Solar Orbiter mission has split the flood of energetic particles flung out into space from the Sun into two groups, tracing each back to a different kind of outburst from our star.",
    "published_at": "2025-09-01T07:00:00Z",
    "updated_at": "2025-09-01T07:18:45.158097Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "acdd0fab-b485-4c18-bb6f-c45cb62bdfd7",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "European Space Agency-led Solar Orbiter mission has split the flood of energetic particles flung out into space from the Sun into two groups. Researchers trace each back to a different kind of outburst from our star. The study is the most comprehensive of SEE events to date, and produces a catalogue that will only grow through Solar orbiter’s lifetime. The study fulfils an important goal of Solar Orbiter: to trace ejected particles back to their sources at the Sun. Crucially, the finding is important for our understanding of space weather, where accurate forecasting is essential to keep our spacecraft operational and safe. One of the two kinds of SEE events is more important for space weather: that connected to CMEs, which tend to hold more high-energy particles."
  },
  {
    "id": 32826,
    "title": "Trump’s Labor Union EO Designates NASA as Primarily An Intelligence/National Security Agency",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/trumps-labor-union-eo-designates-nasa-as-primarily-intelligence-national-security-agency/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/nasa-act-1-283x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "An Executive Order issued by President Trump to exclude NASA and other agencies from collective bargaining rights does so by designating them as having intelligence or national security as a […]",
    "published_at": "2025-09-01T03:54:44Z",
    "updated_at": "2025-09-01T04:00:17.691759Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Trump issued an Executive Order (EO) on Thursday excluding a number of agencies and agency subdivisions from collective bargaining representation. Some agencies were excluded from FSLMRS when the law was written, including the FBI, CIA, and the National Security Agency. Presidents may add to the list by Executive Order if an agency is “determined to have as a primary function intelligence, counterintelligence, investigative, or national security work” NASA was created as a civilian agency to emphasize the U.S. goal of using space for peaceful purposes and to encourage international cooperation. A White House fact sheet cited NASA’s development and operation of “advanced air and space technologies” as a justification for designating the agency as having intelligence, counterintelligence, investigative, or national security work as a “primary function”"
  },
  {
    "id": 32825,
    "title": "Scientists investigate moonquakes using Apollo 17 samples, LRO observations",
    "authors": [
      {
        "name": "Haygen Warren",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/moonquakes-a17-lro/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/as17-140-21497large-e1756668379781.jpg",
    "news_site": "NASASpaceflight",
    "summary": "While Earth and Mars are known for their intense surface quakes, other terrestrial bodies in…\nThe post Scientists investigate moonquakes using Apollo 17 samples, LRO observations appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-31T21:19:05Z",
    "updated_at": "2025-08-31T21:20:12.003999Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Moonquakes are rare and significantly weaker than earthquakes. The most powerful moonquakes reach magnitudes of around 5.0. Moonquakes occur along active fault lines on the lunar surface. These fault lines are cracks in the Moon’s crust that form due to the Moon's shrinking as its interior slowly cools. Scientists have identified thousands of active faults along the lunar surface that may be regularly producing moonquakes. For their study, the scientists analyzed surface changes near the Lee-Lincoln fault in the Taurus-Littrow valley. A magnitude 3.0 moonquake rattles the region once every 5.6 million years. NASA/JSC/ASU: August 20, 2025, August 17, 2025 and August 31, 2025. NASASpaceflight.com: May 18, 2024, December 3, 2023, April 26, 20 23, March 28, 2024, April 28, 2025 April 11, 2025 August 10, 2025 July 30, 2025    ©2005-2025 - NASAS Spaceflight."
  },
  {
    "id": 32824,
    "title": "What’s Happening in Space Policy August 31-September 6, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-august-31-september-6-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/04/Cruz-at-Isaacman-hrg-Apr-9-25-NASA-300x199.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of August 31-September 6, 2025 and any insight we can offer about them. The House and Senate are in […]",
    "published_at": "2025-08-31T15:35:04Z",
    "updated_at": "2025-08-31T21:00:18.493043Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Senate Commerce Committee will hold a hearing on Wednesday entitled “There’s a Bad Moon on the Rise: How Congress and NASA Can Thwart China in the Space Race” The hearing isn’t only about the Artemis program, but it certainly will be a key focus. The House plans to take up their NDAA bill next week. The Commerce-Justice-Science (CJS) bill that funds NASA was approved by the Senate Appropriations Committee on July 17. The House Appropriations Committee was supposed to mark up the CJS bill the day before recess was scheduled to begin, but the House adjourned a day early so the markup was postponed. Several other great events are on tap this week as well, including a discussion of “Space Law Across Borders” SpacePolicyOnline.com has the right (but not the obligation) to monitor the comments and to remove any materials it deems inappropriate. We do not post comments that include links to other websites since we have no control over that content nor can we verify the security of such links. Those and other events we know about as of Sunday morning are shown below."
  },
  {
    "id": 32823,
    "title": "Live coverage: SpaceX’s Sunday morning Falcon 9 launch will send 1,900th Starlink to orbit in 2025",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/30/live-coverage-spacexs-sunday-morning-falcon-9-launch-will-send-1900th-starlink-to-orbit-in-2025/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/10/20241022_Starlink_6-61_prelaunch_AB-1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX continues its blistering pace of orbital launches with its ninth and final Starlink launch of August. It’s targeting liftoff of its Falcon 9 rocket from pad 40 at Cape Canaveral Space Force Station at 7:17 a.m. EDT (1117 UTC). ",
    "published_at": "2025-08-30T17:46:55Z",
    "updated_at": "2025-08-30T17:50:22.768563Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX will launch the Starlink 10-14 mission using the Falcon 9 first stage booster 1077, which will make its 23rd trip to space and back. Sunday’s launch will the 108th of the year. SpaceX plans to launch at least 170 Falcon 9 rockets across 2025, with the majority of those supporting its Starlink constellation. A SpaceX Falcon 9 rocket successfully took off early Sunday with a Japanese video and data relay satellite. The rocket then stuck a landing on a barge stationed nearly 400 miles east of Cape Canaveral. The launch was part of a joint venture between SpaceX and a Japanese satellite company."
  },
  {
    "id": 32822,
    "title": "Rocket Lab inaugurates LC-3 at Wallops",
    "authors": [
      {
        "name": "Chris Bergin",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/rocket-lab-inaugurates-lc-3-wallops/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-30-05-07-20-754.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Rocket Lab has inaugurated Launch Complex 3 (LC-3) for its Neutron rocket, which is set…\nThe post Rocket Lab inaugurates LC-3 at Wallops appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-30T04:38:05Z",
    "updated_at": "2025-08-30T04:40:11.363535Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Rocket Lab has inaugurated Launch Complex 3 (LC-3) for its Neutron rocket. The rocket is set to launch from the Mid-Atlantic Regional Spaceport (MARS) on Wallops Island, Virginia. The pad was completed in under two years by a Virginia-based team of engineers. Rocket Lab aims for Neutron’s maiden flight by the end of 2025. The first stage is powered by nine Archimedes engines (up from an original seven), while the second stage uses one vacuum-optimized archimedes engine. Both stages use liquid oxygen (LOX) and liquid methane as propellants, enabling reusability."
  },
  {
    "id": 32821,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites into polar orbit",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/29/live-coverage-spacex-to-launch-24-starlink-satellites-into-polar-orbit/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250829_Falcon-9_sunset.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 17-7 mission is the penultimate planned launch of these broadband satellites in August. SpaceX is targeting liftoff from pad 4E at 8:08 p.m. PDT (11:08 p.m. EDT / 0308 UTC). ",
    "published_at": "2025-08-29T17:08:27Z",
    "updated_at": "2025-08-29T17:10:18.612068Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The mission dubbed Starlink 17-7 will be the fourth and final Starlink mission to launch from California in August. SpaceX continues to bolster its low Earth orbit Starlink constellation as it rolls out the service to more countries and territories around the world. According to numbers tracked by astronomer and expert orbital tracker, Jonathan McDowell, there are more than 8,200 Starlink satellites on orbit."
  },
  {
    "id": 32820,
    "title": "SpaceX got good heat shield data for Starship, so what comes next?",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/spacex-got-good-heat-shield-data-for-starship-so-what-comes-next/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/starship.jpg",
    "news_site": "Arstechnica",
    "summary": "\"The latest upgrades are looking good!\"",
    "published_at": "2025-08-29T16:10:39Z",
    "updated_at": "2025-08-29T16:20:07.605079Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX's Starship rocket made a soft landing in the Indian Ocean on Tuesday. A striking orange discoloration of the second stage led to all sorts of speculation. SpaceX founder Elon Musk provided some clarity on this discolration on Thursday. Musk: \"The latest upgrades are looking good!\" SpaceX is working on a range of missions that could lead to operational Starlink satellites. The company is also likely to conduct an in-orbit refueling test. This is a key step toward allowing Starships to go to the Moon (for NASA's Artemis Program) and Mars."
  },
  {
    "id": 32819,
    "title": "NASA Astronaut Megan McArthur Retires",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-astronaut-megan-mcarthur-retires/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/megan-mcarthur-iss.jpg",
    "news_site": "NASA",
    "summary": "NASA astronaut Megan McArthur has retired, concluding a career spanning more than two decades. A veteran of two spaceflights, McArthur logged 213 days in space, including being the first woman to pilot a SpaceX Dragon spacecraft and the last person to “touch” the Hubble Space Telescope with the space shuttle’s robotic arm. McArthur launched as […]",
    "published_at": "2025-08-29T15:21:40Z",
    "updated_at": "2025-08-29T15:30:06.737825Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Megan McArthur was the first woman to pilot a SpaceX Dragon spacecraft. She was the last person to “touch” the Hubble Space Telescope with the space shuttle’s robotic arm. McArthur has served in various technical and leadership roles within NASA. She also served as the assistant director of flight operations for the International Space Station Program. “I am grateful I had the opportunity to contribute to this work, and I’m excited to watch our brilliant engineers and scientists at NASA conquer new challenges,” says Shaneequa Vereen. To learn more about NASA’s astronauts and their contributions to space exploration, visit: https://www.nasa.gov/astronauts."
  },
  {
    "id": 32818,
    "title": "Landsat 9 Sees Buccaneer Archipelago",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/landsat-9-sees-buccaneer-archipelago/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/auskingsound-oli2-20250611-lrg.jpg",
    "news_site": "NASA",
    "summary": "The Operational Land Imager on Landsat 9 captured this image of Buccaneer Archipelago on June 11, 2025. The scene encapsulates the striking interactions between land and water in the area where King Sound opens to the Indian Ocean. The powerful tidal currents stir up sediment in shallow areas, producing the beautiful turquoise swirls visible in this image. This […]",
    "published_at": "2025-08-29T15:08:27Z",
    "updated_at": "2025-08-29T15:10:07.077717Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Operational Land Imager on Landsat 9 captured this image of Buccaneer Archipelago on June 11, 2025. The scene encapsulates the striking interactions between land and water in the area where King Sound opens to the Indian Ocean. The powerful tidal currents stir up sediment in shallow areas, producing the beautiful turquoise swirls visible in this image."
  },
  {
    "id": 32817,
    "title": "Webb observations of interstellar comet 3I/ATLAS",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/Webb_observations_of_interstellar_comet_3I_ATLAS",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/webb_observations_of_interstellar_comet_3i_atlas/26851511-1-eng-GB/Webb_observations_of_interstellar_comet_3I_ATLAS_card_full.png",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-29T13:58:00Z",
    "updated_at": "2025-08-29T14:30:17.905550Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "James Webb Space Telescope observed interstellar comet 3I/ATLAS on 6 August 2025 using its Near-Infrared Spectrograph. Webb is one of several space telescopes studying this comet, helping to reveal its size, physical properties, and chemical composition. While the comet poses no threat to Earth, such observations support astronomers in their ongoing mission to find, track, and better understand objects in our Solar System."
  },
  {
    "id": 32816,
    "title": "Hubble Homes in on Galaxy’s Star Formation",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-homes-in-on-galaxys-star-formation/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/Hubble_M96_2025_potw2534a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image features a galaxy whose asymmetric appearance may be the result of a galactic tug of war. Located 35 million light-years away in the constellation Leo, the spiral galaxy Messier 96 is the brightest of the galaxies in its group. The gravitational pull of its galactic neighbors may be responsible […]",
    "published_at": "2025-08-29T13:43:32Z",
    "updated_at": "2025-08-29T14:10:10.784838Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The gravitational pull of its galactic neighbors may be responsible for Messier 96’s uneven distribution of gas and dust, asymmetric spiral arms, and off-center galactic core. This asymmetric appearance is on full display in the new Hubble image that incorporates data from observations in ultraviolet, near infrared, and visible/optical light."
  },
  {
    "id": 32815,
    "title": "Week in images: 25-29 August 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_25-29_August_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/butterfly_nebula_ngc_6302_webb_alma_image/26848757-1-eng-GB/Butterfly_Nebula_NGC_6302_Webb_ALMA_image_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 25-29 August 2025",
    "published_at": "2025-08-29T13:10:00Z",
    "updated_at": "2025-08-29T13:50:12.965751Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 32814,
    "title": "Avio Signs New Tactical Propulsion Agreement with US Armed Forces",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/avio-signs-new-tactical-propulsion-agreement-with-us-armed-forces/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Avio-Signs-New-Tactical-Propulsion-Agreement-with-US-Armed-Forces.webp",
    "news_site": "European Spaceflight",
    "summary": "Italian rocket builder Avio has signed a new contract with the US Armed Forces for the production of solid rocket motors used to power tactical missiles. In 2022, Avio set up a US-based subsidiary in Delaware. In its 2023 year-end financial report, the company explained that it had launched the subsidiary after identifying a major […]\nThe post Avio Signs New Tactical Propulsion Agreement with US Armed Forces appeared first on European Spaceflight.",
    "published_at": "2025-08-29T13:09:54Z",
    "updated_at": "2025-08-29T13:10:15.419568Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Italian rocket builder Avio has signed a new contract with the US Armed Forces for the production of solid rocket motors used to power tactical missiles. In 2022, Avio set up a US-based subsidiary in Delaware. The company explained that it had launched the subsidiary after identifying a major shortfall in tactical propulsion production capacity in the US."
  },
  {
    "id": 32813,
    "title": "NASA, NOAA prep spacecraft trio to study the Sun and its impacts",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/29/nasa-noaa-prep-spacecraft-trio-to-study-the-sun-and-its-impacts/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250828-IMAP_processing-1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "NASA’s Interstellar Mapping and Acceleration Probe (IMAP) will be the primary payload on a SpaceX Falcon 9 rocket launching no earlier than Sep. 23. The vehicle is joined by the Carruthers Geocorona Observatory and NOAA’s Space Weather Follow-On - Lagrange 1 (SWFO-L1) observatory. ",
    "published_at": "2025-08-29T09:58:50Z",
    "updated_at": "2025-08-29T10:00:24.681884Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA’s Interstellar Mapping and Acceleration Probe (IMAP) will study the Sun and its effects on Earth and across the solar system. IMAP is joined by the Carruthers Geocorona Observatory and the Space Weather Follow-On – Lagrange 1 (SWFO-L1) observatory. All three spacecraft are fueled for launch, which is scheduled for no earlier than Sep. 23. SWFO-L1 will be capable of sending back solar weather data in less than five minutes. Carruthers will also study space weather, specifically, it’s interplay with this exosphere. Engineers hope to fly the rotorcraft four more times in the next two weeks before calling it quits."
  },
  {
    "id": 32812,
    "title": "Dusty wisps round a dusty disc",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Dusty_wisps_round_a_dusty_disc",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/webb_s_view_of_planet-forming_disc_iras_04302_2247/26849640-1-eng-GB/Webb_s_view_of_planet-forming_disc_IRAS_04302_2247_card_full.jpg",
    "news_site": "ESA",
    "summary": "For this new Picture of the Month feature, the NASA/ESA/CSA James Webb Space Telescope has provided a fantastic new view of IRAS 04302+2247, a planet-forming disc located about 525 light-years away in a dark cloud within the Taurus star-forming region. With Webb, researchers can study the properties and growth of dust grains within protoplanetary discs like this one, shedding light on the earliest stages of planet formation.",
    "published_at": "2025-08-29T08:00:00Z",
    "updated_at": "2025-08-29T08:10:12.183661Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "James Webb Space Telescope has provided a fantastic new view of IRAS 04302+2247, a planet-forming disc located about 525 light-years away in the Taurus star-forming region. With Webb, researchers can study the properties and growth of dust grains within protoplanetary discs like this one. ESA was responsible for the development and qualification of Ariane 5 adaptations for the Webb mission. ESA also provided the workhorse spectrograph NIRSpec and 50% of the mid-infrared instrument MIRI. Webb is an international partnership between NASA, ESA and the Canadian Space Agency (CSA)"
  },
  {
    "id": 32811,
    "title": "NASA Awards Spaceflight Operations, Systems Organization Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-spaceflight-operations-systems-organization-contract/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
    "news_site": "NASA",
    "summary": "NASA has awarded ASCEND Aerospace & Technology of Cape Canaveral, Florida, the Contract for Organizing Spaceflight Mission Operations and Systems (COSMOS), to provide services at the agency’s Johnson Space Center in Houston. The COSMOS is a single award, indefinite-delivery/indefinite-quantity contract valued at $1.8 billion that begins its five-year base period no earlier than Dec. 1, […]",
    "published_at": "2025-08-28T20:52:40Z",
    "updated_at": "2025-08-28T21:00:09.215105Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The COSMOS is a single award, indefinite-delivery/indefinite-quantity contract valued at $1.8 billion. Work performed under the contract will support NASA’s Flight Operation Directorate. Services include Mission Control Center systems, training systems, mockup environments."
  },
  {
    "id": 32810,
    "title": "NASA Invites Media to Learn About New Missions to Map Sun’s Influence",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-learn-about-new-missions-to-map-suns-influence/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/20410-imap-spinning-h264-00001-print.jpg",
    "news_site": "NASA",
    "summary": "NASA will hold a media teleconference at 12 p.m. EDT on Thursday, Sept. 4, to discuss the agency’s upcoming Sun and space weather missions, IMAP (Interstellar Mapping and Acceleration Probe) and Carruthers Geocorona Observatory. The two missions are targeting launch on the same rocket no earlier than Tuesday, Sept. 23. The IMAP mission will map […]",
    "published_at": "2025-08-28T19:44:27Z",
    "updated_at": "2025-08-28T19:50:06.892281Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The IMAP mission will map the boundaries of our heliosphere. The Carruthers Geocorona Observatory will image the ultraviolet glow of Earth’s exosphere. This data will help scientists understand how space weather from the Sun shapes the exosphere and ultimately impacts our planet."
  },
  {
    "id": 32809,
    "title": "NASA Marsquake Data Reveals Lumpy Nature of Red Planet’s Interior",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/insight/nasa-marsquake-data-reveals-lumpy-nature-of-red-planets-interior/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/1-pia26635-illustration-giant-asteroid-impacting-ancient-mars.jpg",
    "news_site": "NASA",
    "summary": "Rocky material that impacted Mars lies scattered in giant lumps throughout the planet’s mantle, offering clues about Mars’ interior and its ancient past. What appear to be fragments from the aftermath of massive impacts on Mars that occurred 4.5 billion years ago have been detected deep below the planet’s surface. The discovery was made thanks […]",
    "published_at": "2025-08-28T18:09:04Z",
    "updated_at": "2025-08-28T18:10:13.436324Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Rocky material that impacted Mars lies scattered in giant lumps throughout the planet’s mantle. The ancient impacts released enough energy to melt continent-size swaths of the early crust and mantle. They offer a record preserved only on worlds like Mars, whose lack of tectonic plates has kept its interior from being churned up. Lumps of material appear to be material with a different composition than the surrounding mantle. Lumps likely arrived as giant asteroids or other rocky material that struck Mars during the early solar system. The fact that such fine structures are still visible today tells us Mars hasn’t undergone the vigorous churning that would have smoothed out these lumps."
  },
  {
    "id": 32808,
    "title": "NASA, International Astronauts to Address Students from New York",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-international-astronauts-to-address-students-from-new-york/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/astronaut-group-photo-for-downlink-advisory-aug-28.jpg",
    "news_site": "NASA",
    "summary": "NASA astronaut Jonny Kim and JAXA (Japan Aerospace Exploration Agency) astronaut Kimiya Yui will connect with students in New York as they answer prerecorded science, technology, engineering, and mathematics (STEM) questions aboard the International Space Station. The Earth-to-space call will begin at 9:20 a.m. EDT on Friday, Sept. 5, and will stream live on the […]",
    "published_at": "2025-08-28T17:56:26Z",
    "updated_at": "2025-08-28T18:00:08.797365Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Earth-to-space call will begin at 9:20 a.m. EDT on Friday, Sept. 5. The Computer School will host this event in New York for middle school students. The goal of this event is to expose students to the real-world experiences and engineering challenges of astronauts working and living aboard the International Space Station."
  },
  {
    "id": 32807,
    "title": "NASA Scientists Help Maryland County Plan to Beat Summer Heat Risks",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/earth/nasa-helps-md-county-beat-heat/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/landsat-ecostress.png",
    "news_site": "NASA",
    "summary": "Thousands of Americans are impacted each summer by excessive heat and humidity, some suffering from heat-related illnesses when the body can’t cool itself down. Data from NASA satellites could help local governments reduce the sweltering risks, thanks to a collaboration between NASA scientists and officials in Prince George’s County, Maryland. The effort demonstrates how local […]",
    "published_at": "2025-08-28T17:31:58Z",
    "updated_at": "2025-08-28T17:40:06.618144Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA scientists and officials in Prince George’s County, Maryland, collaborated on the study. Data from NASA satellites could help local governments reduce the sweltering risks. The data also show how temperatures have responded to changing land use and construction. A NASA guide is available to aid other communities who hope to duplicate the Prince George's County study. Prince George’s County uses NASA resources and expertise in its efforts to improve safety and health. One of the greatest benefits of the collaboration is the boost in credibility that comes from incorporating NASA resources. “Working with NASA builds confidence that the decision-making process is based firmly in science,” Abe said."
  },
  {
    "id": 32806,
    "title": "NASA’s Chandra Reveals Star’s Inner Conflict Before Explosion",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/chandra/nasas-chandra-reveals-stars-inner-conflict-before-explosion/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/casa.jpg",
    "news_site": "NASA",
    "summary": "The inside of a star turned on itself before it spectacularly exploded, according to a new study from NASA’s Chandra X-ray Observatory. Today, this shattered star, known as the Cassiopeia A supernova remnant, is one of the best-known, well-studied objects in the sky. Over three hundred years ago, however, it was a giant star on […]",
    "published_at": "2025-08-28T16:17:50Z",
    "updated_at": "2025-08-28T16:20:05.642308Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Cassiopeia A was a giant star on the brink of self-destruction. New study reveals that just hours before it exploded, the star’s interior violently rearranged itself. Last-minute shuffling of its stellar belly has profound implications for understanding how massive stars explode and how their remains behave afterwards. Cassiopeia A, or Cas A, was a star on the brink of self-destruction. In composition it resembled an onion with layers rich in different elements such as hydrogen, helium, carbon, silicon, sulfur, calcium, and neon. When that iron core grew beyond a certain mass, the star could no longer support its own weight. The outer layers fell into the collapsing core, then rebounded as a supernova."
  },
  {
    "id": 32805,
    "title": "With recent Falcon 9 milestones, SpaceX vindicates its “dumb” approach to reuse",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/with-recent-falcon-9-milestones-spacex-vindicates-its-dumb-approach-to-reuse/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/booster-1067.jpg",
    "news_site": "Arstechnica",
    "summary": "The company's workhorse continues its stellar performance.",
    "published_at": "2025-08-28T14:46:46Z",
    "updated_at": "2025-08-28T14:50:05.227616Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX's Falcon 9 rocket continued to hit some impressive milestones this week. The company's workhorse continues its stellar performance. Both occurred during relatively anonymous launches of the company's Starlink satellites. The milestones underscore the value of first-stage reuse, which SpaceX pioneered over the last decade. United Launch Alliance says its approach is superior to SpaceX's. The company dubbed its approach SMART, an acronym for Sensible Modular Autonomous Return Technology. According to the United Launch Alliance analysis in 2015, the SMART plan would result in cost savings as soon as the second launch of a booster."
  },
  {
    "id": 32804,
    "title": "MaiaSpace Completes Burst Test Campaign and Begins Orbital Vehicle Development",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/maiaspace-completes-burst-test-campaign-and-begins-orbital-vehicle-development/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/MaiaSpace-Completes-Burst-Test-Campaign-and-Begins-Orbital-Vehicle-Development.webp",
    "news_site": "European Spaceflight",
    "summary": "French rocket builder and ArianeGroup subsidiary MaiaSpace has announced the completion of a months-long test campaign that subjected several subscale prototypes of its propellant tanks to high-pressure burst tests. In a 27 August update, the company revealed that over the six-month campaign it had conducted 15 burst tests of subscale propellant tanks, which MaiaSpace calls […]\nThe post MaiaSpace Completes Burst Test Campaign and Begins Orbital Vehicle Development appeared first on European Spaceflight.",
    "published_at": "2025-08-28T14:39:54Z",
    "updated_at": "2025-08-28T14:40:10.087718Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "French rocket builder MaiaSpace has announced the completion of a months-long test campaign. The company subjected several subscale prototypes of its propellant tanks to high-pressure burst tests. The data collected will be used to validate mechanical models that will inform the final design of the full-scale propellant Tanks."
  },
  {
    "id": 32803,
    "title": "Katie Bisci: Resourcing for Big Science",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/goddard/katie-bisci-resourcing-for-big-science/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/k-bisci-portraits-0002.jpg",
    "news_site": "NASA",
    "summary": "Deputy Project Manager for Resources – Goddard Space Flight Center How are you helping set the stage for the Roman mission? I’m a deputy project manager for resources on the Nancy Grace Roman Space Telescope team, sharing the role with Kris Steeley. Together, we oversee the business team, finance, outreach, scheduling, and more. I focus […]",
    "published_at": "2025-08-28T12:00:00Z",
    "updated_at": "2025-08-28T12:00:11.230767Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Nancy Grace Roman Space Telescope deputy project manager. Her job is to help along the technical parts of the mission, while supporting cost and schedule control. The Roman team is amazing, and those relationships are what keep me excited to come to work every day. She says the best part about Roman is the people. I’ve learned about how the Hubble Space Telescope , Webb, and Roman all build on each other during my time on this project. It’s really fulfilling to be a small part of something so big. I’m usually at their sports games or chauffeuring them around to one event or another."
  },
  {
    "id": 32802,
    "title": "Izaña-2 joins the laser game to track space debris",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/Izana-2_joins_the_laser_game_to_track_space_debris",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/izana-2_joins_the_laser_game_to_track_space_debris/26850289-3-eng-GB/Izana-2_joins_the_laser_game_to_track_space_debris_card_full.jpg",
    "news_site": "ESA",
    "summary": "In Tenerife, Spain, stands a unique duo: ESA’s Izaña-1 and Izaña-2 laser-ranging stations. Together, they form an optical technology testbed of the European Space Agency that takes the monitoring of space debris and satellites to a new level while maturing new technologies for commercialisation.  ",
    "published_at": "2025-08-28T08:00:00Z",
    "updated_at": "2025-08-28T08:50:15.674979Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Space debris is a threat to satellites and is rapidly becoming a daily concern for satellite operators. The Space Safety Programme helps develop new technologies to detect and track debris. One of these efforts takes place at the Izaña station in Tenerife. There, ESA and partner companies are testing how to deliver precise orbit data on demand with laser-based technologies."
  },
  {
    "id": 32801,
    "title": "Over Soroya Ridge & Onward!",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/over-soroya-ridge-onward/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/mars2020/2025/perseverance-rover-updates/august-2025/Mars_Perseverance_NLF_1597_0808718560_880ECM_N0783588NCAM14597_04_195J.png",
    "news_site": "NASA",
    "summary": "Written by Eleanor Moreland, Ph.D. Student Collaborator at Rice University Perseverance has continued exploring beyond the rim of Jezero crater, spending time last week at Parnasset conducting a mini-campaign on aeolian bedforms. After wrapping up that work, three separate drives brought Perseverance further southeast to an outcrop named Soroya. Soroya was first picked out from […]",
    "published_at": "2025-08-27T21:33:42Z",
    "updated_at": "2025-08-27T22:10:13.746022Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Perseverance spent last week at Parnasset conducting a mini-campaign on aeolian bedforms. Three separate drives brought Perseverance further southeast to an outcrop named Soroya. Soroya was first picked out from orbital images as a target of interest because, as can be seen in the above image, it appears as a much lighter color compared to the surroundings."
  },
  {
    "id": 32800,
    "title": "Live coverage: Record-breaking 30th flight planned for SpaceX Falcon 9 booster as it launches Starlink satellites",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/27/live-coverage-record-breaking-30th-flight-for-spacex-falcon-9-booster-as-it-launches-starlink-satellites/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/04/20250411-Starlink-12-17-Pad-Feature-Image.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-11 mission features the first launch of a booster on its 30th flight. SpaceX is targeting liftoff of its Falcon 9 rocket from Launch Complex 39A at 1:27 a.m. EDT (0527 UTC). ",
    "published_at": "2025-08-27T20:15:16Z",
    "updated_at": "2025-08-27T20:20:20.474781Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " SpaceX second Starlink launch in 24 hours will see the flight of a Falcon 9 booster for a record-setting 30th time. Liftoff from pad 39A at NASA’s Kennedy Space Center is scheduled for 1:27 a.m. EDT (0527 UTC) Thursday. Starlink 10-11 mission will place another 28 Starlink V2 Mini broadband internet satellites into the low Earth orbit constellation."
  },
  {
    "id": 32798,
    "title": "Russia’s state-run human spaceflight company may be near bankruptcy",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/russias-state-run-human-spaceflight-company-may-be-near-bankruptcy/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-1747269738.jpg",
    "news_site": "Arstechnica",
    "summary": "\"A significant part of the team has lost motivation and a sense of shared responsibility.\"",
    "published_at": "2025-08-27T19:54:54Z",
    "updated_at": "2025-08-27T20:00:07.153842Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Igor Maltsev, chief of RSC Energia, says his corporation is in a \"critical\" state. He says the company is struggling to pay wages and deliver products it is contracted to build. \"A significant part of the team has lost motivation and a sense of shared responsibility,\" he says. Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information. After all, you don’t need to know everything, only what’s important."
  },
  {
    "id": 32799,
    "title": "Patagonia Glacier retreat, Chile",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/earth/patagonia-glacier-retreat-chile/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/multimedia/images-of-change/Patagonia_Retreat_Comb_2.jpg",
    "news_site": "NASA",
    "summary": "Patagonia, Chile. Left: September 18, 1986. Right: August 5, 2002. The 1986 image shows the region prior to a major retreat of the glaciers. The 2002 image shows a retreat of nearly 10 kilometers (6.2 miles) of the glacier on the left side. The smaller glacier on the right has receded more than 2 kilometers (1.2 miles). In front of the smaller glacier, two ribbon lakes have formed behind the debris left by the glacier’s advance. Scientists and government managers are using satellite imagery like this to monitor the retreat of the glaciers and the impact on water bodies caused by the changes in the glaciers’ size and direction.",
    "published_at": "2025-08-27T19:24:14Z",
    "updated_at": "2025-08-27T20:10:15.454745Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. NASA Earth Science helps Americans respond to challenges and societal needs — such as wildland fires, hurricanes, and water supplies. Explore Earth Science data at: http://www.nasa.gov/earth."
  },
  {
    "id": 32797,
    "title": "The Starship Program rises from the ashes of Block 2 with Ship 37",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/starship-rises-ashes-block-2-ship-37/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/08-26-25_Starship_Flight_10_5D3-9688-4-wmarked-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Going into Flight 10, SpaceX was having a down year with the Starship program. Following…\nThe post The Starship Program rises from the ashes of Block 2 with Ship 37 appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-27T19:13:16Z",
    "updated_at": "2025-08-27T19:20:10.877941Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has completed Flight 10 of the Starship program. The first attempt was scrubbed due to problems with the supply line for LOX. Crews used a motorized winch at the top of the tower to reinstall a new supply hose. Flight 10 ended with both vehicles performing controlled splashdowns in the water. SpaceX's Starship Flight 10 took off from Pad 1 (A) at 6:30:00 p.m. Central Daylight Time. This was the second-to-last flight of a Block 2 booster with Booster 15-2 slated to be the last one to fly. The SpaceX logistics team brought in around 38 Liquid Nitrogen (LN2) tankers and around 40 LOX tankers. Ship 37 made it through reentry with no major problems. The aft flaps partially came apart, possibly due to hot-staging damage, and then early reentry tore them both open. The port or left side engine chill lines ruptured under the aft flap fairing and punched a hole into the ship’s drive section skirt."
  },
  {
    "id": 32796,
    "title": "SpaceX completes 400th Falcon booster landing on a drone ship",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/27/spacex-completes-400th-falcon-booster-landing-on-a-drone-ship/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250827_B1095-2_JRTI_landing.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The accomplishment came during Wednesday’s flight of the Starlink 10-56 mission from Cape Canaveral Space Force Station. The touchdown was also SpaceX’s 494th overall successful booster landing. ",
    "published_at": "2025-08-27T18:56:28Z",
    "updated_at": "2025-08-27T19:00:27.846095Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A Falcon 9 rocket placed another 28 Starlink satellites into orbit shortly after sunrise on Wednesday. The B1095 first stage booster, making its second flight, touched down on the drone ship ‘Just Read the Instructions’ (JRTI) stationed in the Atlantic Ocean east of the Carolinas. The majority of the 400 aquatic landings have occurred on SpaceX’s drone ship, ‘Of Course I Still Love You’ SpaceX released a new batch of photos showing the Feb. 6 liftoff of the company’s first Falcon Heavy rocket from pad 39A at the Kennedy Space Center in Florida. Liftoff from Space Launch Complex 40 happened at 8:32 p.m. EDT (0032 UTC) The crucial pre-launch engine test has been repeatedly delayed."
  }
]