[
  {
    "id": 32675,
    "title": "Aurora Australis over Concordia station",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/Aurora_Australis_over_Concordia_station",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/aurora_australis_over_concordia_station/26843757-1-eng-GB/Aurora_Australis_over_Concordia_station_card_full.jpg",
    "news_site": "ESA",
    "summary": "The Aurora Australis, photographed over Concordia station in July 2025, during the ongoing solar activity maximum, the peak of the Sun's 11-year cycle. ",
    "published_at": "2025-08-27T08:00:00Z",
    "updated_at": "2025-08-20T08:50:11.122359Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Aurora Australis appears when charged particles from the Sun are guided by Earth’s magnetic field towards the polar regions. Concordia station, perched high on Antarctica’‘Dome C plateau, is one of the most remote research outposts on Earth. Each year, ESA sponsors a medical doctor to live and work at Concordia."
  },
  {
    "id": 32763,
    "title": "Weather Scrubs Second Starship IFT-10 Launch Attempt",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/weather-scrubs-second-starship-ift-10-launch-attempt/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/IFT10-webcast-9-Aug-25-25-218x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "SpaceX is still trying to get its 10th Starship Integrated Flight Test, IFT-10, off the ground.  Yesterday’s attempt was canceled because of a ground-side liquid oxygen leak. Today’s was scrubbed […]",
    "published_at": "2025-08-26T02:08:26Z",
    "updated_at": "2025-08-26T02:10:20.441778Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is still trying to get its 10th Starship Integrated Flight Test, IFT-10, off the ground. Yesterday’s attempt was canceled because of a ground-side liquid oxygen leak. SpaceX might try again tomorrow. Musk made a surprise appearance on the launch webcast sharing his views on the need for a multiplanetary species. NASA contracted with SpaceX in 2021 for a Starship Human Landing System (HLS) to put NASA astronauts on the lunar surface in 2024. SpaceX must perform an uncrewed lunar landing demonstration first and fire the engines to show it can lift off the surface. Getting American astronauts back on the Moon before China puts taikonauts there is a unifying goal of Republicans and Democrats."
  },
  {
    "id": 32762,
    "title": "ICEYE Secures €9.38M in Funding from Poland’s National Development Bank",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/iceye-secures-e9-38m-in-funding-from-polands-national-development-bank/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/ICEYE-Secures-E9.38M-in-Funding-from-Polands-National-Development-Bank.webp",
    "news_site": "European Spaceflight",
    "summary": "Earth observation data provider and satellite manufacturer ICEYE has secured over PLN 40 million (€9.38 million) in new funding from Vinci S.A., an investment vehicle of Bank Gospodarstwa Krajowego (BGK), Poland’s National Development Bank. As an investment vehicle for BGK, Vinci S.A. is tasked with investing in the commercialization and expansion of Polish startups. According […]\nThe post ICEYE Secures €9.38M in Funding from Poland’s National Development Bank appeared first on European Spaceflight.",
    "published_at": "2025-08-25T21:50:16Z",
    "updated_at": "2025-08-25T22:00:12.527446Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "ICEYE has secured over PLN 40 million (€9.38 million) in new funding from Vinci S.A. Vinci is an investment vehicle of Bank Gospodarstwa Krajowego (BGK), Poland’s National Development Bank."
  },
  {
    "id": 32761,
    "title": "Vulcan Begins Operational Missions",
    "authors": [
      {
        "name": "Nik Alexander",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/08/vulcan-begins-operational-missions/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/08/joebvulcan-scaled.jpg",
    "news_site": "Space Scout",
    "summary": "On August 12, 2025 at 8:56 p.m. EDT (0056 UTC), United Launch Alliance successfully launched its Vulcan Centaur VC4S vehicle from Space Launch Complex-41 at Cape Canaveral Space Force Station for the USSF-106 mission.",
    "published_at": "2025-08-25T17:20:40Z",
    "updated_at": "2025-08-25T17:30:22.638781Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "On August 12, 2025 at 8:56 p.m. EDT (0056 UTC), United Launch Alliance successfully launched its Vulcan Centaur VC4S vehicle. This was the third overall flight of the Vulcan rocket but its first to carry national security payloads. The ascent was nominal, despite an SRB nozzle anomaly on flight 2 which led to a lengthy stand down. Vulcan successfully launched USSF-106 from Cape Canaveral on April 4, 2025. The launch was part of the second round of the National Security Space Launch program. The program seeks to distribute vital government payloads across industry to prevent potential bottlenecks. The path to operational Vulcan flights has been marred with challenges, with the company encountering several key issues."
  },
  {
    "id": 32759,
    "title": "With a new Soyuz rocket, Russia seeks to break its Ukrainian dependency",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/with-a-new-soyuz-rocket-russia-seeks-to-break-its-ukrainian-dependency/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2202741417.jpg",
    "news_site": "Arstechnica",
    "summary": "Now you Zenit, now you don't",
    "published_at": "2025-08-25T17:17:20Z",
    "updated_at": "2025-08-25T17:20:05.930051Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Soyuz-5 will be Russia's new medium-lift rocket. The rocket has been in development since 2016 and largely repurposes older technology. It takes rocket elements formerly made in Ukraine and now manufactures them in Russia. Full operational service is not expected to begin until 2028. The vehicle's debut has been repeatedly pushed back, however, with Russia now expected to debut the vehicle no earlier than 2030. Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information."
  },
  {
    "id": 32760,
    "title": "Live coverage: SpaceX preps for Starship Flight 10 following Sunday scrub",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/25/live-coverage-spacex-preps-for-starship-flight-10-following-sunday-scrub/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250825_Starship_Flight-10.jpg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX Founder and Chief Engineer Elon Musk said on his social media site, X, that the scrub was caused by a “Ground side liquid oxygen leak (that) needs to be fixed.” The launch is scheduled for no earlier than Monday, Aug. 25, at 6:30 p.m. CDT (7:30 p.m. EDT / 2330 UTC). ",
    "published_at": "2025-08-25T17:12:46Z",
    "updated_at": "2025-08-25T17:20:18.614471Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for its second attempt to launch the 10th test flight of a Starship rocket from southern Texas as soon as Monday evening. Liftoff from Pad A at Starbase is scheduled for 6:30 p.m. CDT (7:30pm. EDT / 2330 UTC), which is the opening of the hour-long launch window. SpaceX announced on social media that it was scrubbing the Sunday launch attempt to “allow time to troubleshoot an issue with ground systems” SpaceX will perform a multi-hour experiment on the second stage of a Falcon 9 rocket after the launcher deploys a Dragon supply ship on the way to the International Space Station. Orbital ATK and SpaceX won Pentagon contracts worth a combined value of up to $241 million Wednesday."
  },
  {
    "id": 32758,
    "title": "Cargo ship docks with International Space Station",
    "authors": [
      {
        "name": "William Harwood",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/25/cargo-ship-docks-with-international-space-station/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250825_crs33_docking.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "Launched Sunday from Cape Canaveral Space Force Station atop a Falcon 9 rocket, the cargo Dragon closed out a 28-hour rendezvous with an ahead-of-schedule docking at the lab's forward port at 7:05 a.m. EDT as the two spacecraft were passing 260 miles above the Ivory Coast of Africa. ",
    "published_at": "2025-08-25T13:45:43Z",
    "updated_at": "2025-08-25T17:10:18.859051Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Tortillas are a crumb-free bread substitute for crews dining in weightlessness. The Dragon also brought an add-on thruster kit to help boost the space station’s altitude. A Russian Soyuz rocket rolled out to a launch pad in Kazakhstan early Thursday in preparation for liftoff Saturday."
  },
  {
    "id": 32757,
    "title": "ESA data records help underpin climate change report",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Space_for_our_climate/ESA_data_records_help_underpin_climate_change_report",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/soil_moisture_anomalies_over_2024_compared_to_1991_2020/26846786-1-eng-GB/Soil_moisture_anomalies_over_2024_compared_to_1991_2020_card_full.gif",
    "news_site": "ESA",
    "summary": "According to the newly released 35th State of the Climate report, 2024 saw record highs in greenhouse gas concentrations, global land and ocean temperatures, sea levels, and ocean heat content. Glaciers also suffered their largest annual ice loss on record. Data records from ESA’s Climate Change Initiative helped underpin these findings.",
    "published_at": "2025-08-25T11:49:00Z",
    "updated_at": "2025-08-25T14:10:20.100605Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 35th State of the Climate report has been published by the Bulletin of the American Meteorological Society. 2024 saw record highs in greenhouse gas concentrations, global land and ocean temperatures, sea levels, and ocean heat content. Glaciers suffered their largest annual ice loss on record. Data records from ESA’s Climate Change Initiative helped underpin these findings. Permafrost stores nearly 1700 billion tonnes of frozen and thawing carbon. Anthropogenic warming threatens to release an unknown quantity of this carbon to the atmosphere. Sometimes permafrost can thaw rapidly, but scientists are unsure why and what these abrupt thaws mean in terms of feedback loops."
  },
  {
    "id": 32723,
    "title": "Juice team resolves anomaly on approach to Venus",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Operations/Juice_team_resolves_anomaly_on_approach_to_Venus",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2022/03/juice_s_flyby_of_venus_close-up/23992257-1-eng-GB/Juice_s_flyby_of_Venus_close-up_card_full.png",
    "news_site": "ESA",
    "summary": "The European Space Agency’s Jupiter Icy Moons Explorer (Juice) is on track for its gravity-assist flyby at Venus on 31 August, following the successful resolution of a spacecraft communication anomaly that temporarily severed contact with Earth.",
    "published_at": "2025-08-25T10:00:00Z",
    "updated_at": "2025-08-25T10:00:14.789193Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Jupiter Icy Moons Explorer (Juice) is on track for its gravity-assist flyby at Venus on 31 August. The issue emerged during a routine ground station pass on 16 July. It temporarily disrupted Juice’s ability to transmit information about its health and status (telemetry) Jupiter Icy Moons Explorer, ‘Juice’, is humankind’s next bold mission to the outer Solar System. It will make detailed observations of gas giant Jupiter and its three large ocean-bearing moons – Ganymede, Callisto and Europa. It has an eight-year cruise with flybys of Earth and Venus to slingshot it to Jupiter."
  },
  {
    "id": 32722,
    "title": "Lindy Garay: Supporting Space Station Safety and Success",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/lindy-garay-supporting-space-station-safety-and-success/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/garay-lindy.jpg",
    "news_site": "NASA",
    "summary": "Lindy Garay always knew she wanted to develop software. She did not anticipate that her work would contribute to human spaceflight. The electrical and software engineering degree Garay earned from the University of Texas at Austin paved the way for a 25-year career with NASA’s Johnson Space Center in Houston. Her first job out of […]",
    "published_at": "2025-08-25T10:00:00Z",
    "updated_at": "2025-08-25T10:00:08.574933Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Lindy Garay has worked at NASA's Johnson Space Center in Houston for 25 years. She is a training systems software architect and technical lead for training system external interfaces. Garay was recently named as a 2025 NASA Space Flight Awareness Program Honoree – one of the highest recognitions presented to the agency’s workforce."
  },
  {
    "id": 32721,
    "title": "Live Coverage: SpaceX gets ready for crucial 10th test flight of Starship",
    "authors": [
      {
        "name": "Spaceflight Now",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/24/live-coverage-spacex-gets-ready-for-crucial-10th-test-flight-of-starship/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2023/11/20231120-Starship-IFT-2-Adam-Remote.jpg",
    "news_site": "Spaceflight Now",
    "summary": "Watch live as a Super Heavy booster and Starship launch on a crucial test flight for SpaceX's fully reusable rocket, following three consecutive failures of the Starship upper stage in-flight and an explosion on the test stand. Liftoff is scheduled for  6:30 p.m. CDT / 7:30 p.m. EDT / 2330 UTC. ",
    "published_at": "2025-08-24T21:51:16Z",
    "updated_at": "2025-08-24T22:00:28.125688Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX scrubbed the launch attempt due to a ground systems issue. This tenth test flight follows three consecutive failures of the Starship upper stage in-flight and an explosion on the test stand. Liftoff of the 10th fully integrated Starship from SpaceX’s Starbase facility at Boca Chica Beach, in Texas."
  },
  {
    "id": 32720,
    "title": "What’s Happening in Space Policy August 24-30, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-august-24-30-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Starbase-stunning-Aug-2025-300x169.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of August 24-30, 2025 and any insight we can offer about them. The House and Senate are in recess […]",
    "published_at": "2025-08-24T18:36:56Z",
    "updated_at": "2025-08-24T18:40:12.643367Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpacePolicyOnline.com has compiled a list of space policy events for the week of August 24-30, 2025. The House and Senate are in recess until September 2 except for pro forma sessions. The FAA will have four in-person meetings this week to gather public input on its Draft Environmental Impact Statement. The House Rules Committee set Thursday, August 28, as the deadline for Members to offer amendments to the FY2026 NDAA. The House plans to take up the bill the second week of September. The NDAA is the one piece of legislation that has passed every year since the first in 1961."
  },
  {
    "id": 32719,
    "title": "NASA, SpaceX launch Dragon to the ISS on extended cargo, station boosting mission",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/24/nasa-spacex-launch-dragon-to-the-iss-on-extended-cargo-station-boosting-mission/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250824_CRS-33_liftoff.jpg",
    "news_site": "Spaceflight Now",
    "summary": "This will be the 50th Dragon vehicle to visit the International Space Station, including the Dragon 1 vehicles that were berthed to the orbiting lab. Docking with the Harmony module is anticipated Monday, Aug. 25, at 7:30 a.m. EDT (1130 UTC). ",
    "published_at": "2025-08-24T08:20:46Z",
    "updated_at": "2025-08-24T08:30:16.964796Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Cargo Dragon spacecraft from SpaceX lifted off atop a Falcon 9 rocket in the early hours Sunday morning to begin a day-long journey to the International Space Station. The launch marks SpaceX’s 33rd Commercial Resupply Services (CRS-33) mission to the orbiting outpost. Docking at the forward port of the Harmony module is anticipated on Monday, Aug. 25, at 7:30 a.m. EDT."
  },
  {
    "id": 32718,
    "title": "NASA Science, Cargo Launch on 33rd SpaceX Resupply Mission to Station",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-science-cargo-launch-on-33rd-spacex-resupply-mission-to-station/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/screenshot-195-1.png",
    "news_site": "NASA",
    "summary": "Following a successful launch of NASA’s SpaceX 33rd commercial resupply mission, new scientific experiments and cargo for the agency are bound for the International Space Station. The SpaceX Dragon spacecraft, carrying more than 5,000 pounds of supplies to the orbiting laboratory, lifted off at 2:45 a.m. EDT on Sunday, on the company’s Falcon 9 rocket […]",
    "published_at": "2025-08-24T07:14:08Z",
    "updated_at": "2025-08-24T07:20:04.891535Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Following a successful launch of NASA’s SpaceX 33rd commercial resupply mission, new scientific experiments and cargo for the agency are bound for the International Space Station. The SpaceX Dragon spacecraft, carrying more than 5,000 pounds of supplies to the orbiting laboratory, lifted off at 2:45 a.m. EDT on Sunday, on the company’s Falcon 9 rocket […]"
  },
  {
    "id": 32717,
    "title": "Starship prepares to launch Flight 10 in penultimate Block 2 test",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/flight-10-ship-37-block-2/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-23-23-41-51-295.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX has not experienced much success with the Block 2 version of Starship since its…\nThe post Starship prepares to launch Flight 10 in penultimate Block 2 test appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-23T22:50:17Z",
    "updated_at": "2025-08-23T23:00:11.701117Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has not experienced much success with the Block 2 version of Starship since its introduction earlier this year. Ship 37 aims to break this streak during Flight 10, which is set to launch no earlier than August 24 at 6:30 p.m. Central Daylight Time. This journey started with Ship 33 and Booster 14 for Flight 7 on January 16, 2025. The second Block 2 ship to fly was Ship 34 paired with Booster 15. Ship 36 experienced an anomaly on June 18, which resulted in the loss of the ship on the Masseys static fire test stand. This caused a pressurization problem in the payload bay and in the methane tank. Ship 35 reentered in an uncontrolled manner and was lost without completing any primary objectives. Booster 16 was static fire tested on June 6, when it was slated to fly with Ship 36.  Starship Flight 10 is currently set for no earlier than Aug 24 at 6:30 pm Central Daylight Time with a one-hour launch window. The only significant difference is that Booster 16 will have a boost back burn that is 10 seconds longer compared to Flight 9. As for trajectory, this will once again be a suborbital ballistic trajectory with Ship 37 set to splashdown in the Indian Ocean."
  },
  {
    "id": 32716,
    "title": "Live coverage: NASA, SpaceX to launch Falcon 9 rocket, Dragon spacecraft on CRS-33 from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/23/live-coverage-nasa-spacex-to-launch-falcon-9-rocket-dragon-spacecraft-on-crs-33-from-cape-canaveral/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250823_CRS_33_full_rocket.jpg",
    "news_site": "Spaceflight Now",
    "summary": "This will be the first Cargo Dragon flight featuring a modified trunk that allows it to perform multiple orbital boosts of the International Space Station. SpaceX is targeting liftoff from pad 40 at Cape Canaveral Space Force Station at 2:45 a.m. EDT (0645 UTC). ",
    "published_at": "2025-08-23T20:39:46Z",
    "updated_at": "2025-08-23T20:40:19.247769Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Dragon spacecraft set to launch in the predawn hours of Sunday morning features a new propulsion system inside its unpressurized trunk. This addition will allow the spacecraft to boost the orbit of the space station, keeping it in its desired orbit. SpaceX will launch the mission using its Falcon 9 first stage booster with the tail number B1090, which will fly for a seventh time. SpaceX's Dragon capsule heading for the International Space Station carrying more than 4,800 pounds of supplies and experiments. SpaceX’s Falcon 9 rocket is set for liftoff from Cape Canaveral on Monday, heading due east over the Atlantic Ocean to deliver the Telstar 18 VANTAGE communications satellite into orbit around 32 minutes later."
  },
  {
    "id": 32715,
    "title": "NASA Tests Tools to Assess Drone Safety Over Cities",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasa-tests-tools-to-assess-drone-safety-over-cities/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/20250822-sws-resilienx.jpeg",
    "news_site": "NASA",
    "summary": "A future with advanced air mobility aircraft populating the skies will require the U.S. to implement enhanced preflight planning that can mitigate potential risks well before takeoff – and NASA is working to develop the tools to make that happen.  Preflight planning is critical to ensuring safety in the complex, high-risk environments of the future […]",
    "published_at": "2025-08-22T16:15:55Z",
    "updated_at": "2025-08-22T16:20:06.332798Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and aviation safety company ResilienX Inc. demonstrated how these tools can be integrated into commercial systems. Timely, predictive, and up-to-date risk assessment within a single platform makes it much easier for drone or air taxi operators to check flight plans. Allowing operators to perform these tasks quickly reduces the safety risk to flight passengers as well as humans on the ground."
  },
  {
    "id": 32714,
    "title": "NASA Shares Final Contenders for Artemis II Moon Mascot Design Contest",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/nasa-shares-final-contenders-for-artemis-ii-moon-mascot-design-contest/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/54699815290-5cb6508dd2-o.jpg",
    "news_site": "NASA",
    "summary": "NASA is down to 25 finalists for the Artemis II zero gravity indicator set to fly with the mission’s crew around the Moon and back next year. Astronauts Reid Wiseman, Victor Glover, and Christina Koch of NASA, and CSA (Canadian Space Agency) astronaut Jeremy Hansen will soon select one of the finalist designs to join […]",
    "published_at": "2025-08-22T16:08:40Z",
    "updated_at": "2025-08-22T16:10:12.497149Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is down to 25 finalists for the Artemis II zero gravity indicator set to fly with the mission’s crew around the Moon and back next year. Astronauts Reid Wiseman, Victor Glover, and Christina Koch of NASA, and CSA (Canadian Space Agency) astronaut Jeremy Hansen will soon select one of the finalist designs to join them inside the Orion spacecraft."
  },
  {
    "id": 32712,
    "title": "UK Space Agency Hires Consultants to Explain the UK Space Sector",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/uk-space-agency-hires-consultants-to-explain-the-uk-space-sector/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/UK-Space-Agency-Hires-Consultants-to-Explain-the-UK-Space-Sector.webp",
    "news_site": "European Spaceflight",
    "summary": "The UK Space Agency has commissioned Frazer-Nash Consultancy to review the nation’s capacity to deliver on in-situ resource utilisation capabilities. According to the agency, the results of the study will be used to “inform future activities in this area.” In an 18 August press release, Surrey-based Frazer-Nash Consultancy explained that the study will examine the […]\nThe post UK Space Agency Hires Consultants to Explain the UK Space Sector appeared first on European Spaceflight.",
    "published_at": "2025-08-22T15:48:23Z",
    "updated_at": "2025-08-22T15:50:09.678973Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The UK Space Agency has commissioned Frazer-Nash Consultancy to review the nation’s capacity to deliver on in-situ resource utilisation capabilities. The results of the study will be used to “inform future activities in this area” As a “first step,” Frazers has asked companies developing ISRU technology or solutions to complete a 10-minute survey before 17 October."
  },
  {
    "id": 32711,
    "title": "Epic Research Can Help Mars Missions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/epic-research-can-help-mars-missions/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/afrc2025-0094-0864orig.jpg",
    "news_site": "NASA",
    "summary": "The parachute of the Enhancing Parachutes by Instrumenting the Canopy, or EPIC, test experiment deploys following an air launch from an Alta X drone on June 4, 2025, at NASA’s Armstrong Flight Research Center in Edwards, California. NASA researchers are developing technology to make supersonic parachutes safer and more reliable for delivering instruments and payloads […]",
    "published_at": "2025-08-22T14:47:36Z",
    "updated_at": "2025-08-22T14:50:06.590631Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA researchers are developing technology to make supersonic parachutes safer and more reliable for delivering instruments and payloads to Mars. The flight tests were a first step toward filling gaps in computer models to improve the parachutes. This work could also open the door to future partnerships, including with the aerospace and auto racing industries."
  },
  {
    "id": 32710,
    "title": "NASA’s Bennu Samples Reveal Complex Origins, Dramatic Transformation",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/uncategorized/nasas-bennu-samples-reveal-complex-origins-dramatic-transformation/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/psd/ares/jsc2025e069611_Bennu_particle.tif",
    "news_site": "NASA",
    "summary": "Asteroid Bennu, sampled by NASA’s OSIRIS-REx mission in 2023, is a mixture of dust that formed in our solar system, organic matter from interstellar space, and pre-solar system stardust. Its unique and varied contents were dramatically transformed over time by interactions with water and exposure to the harsh space environment. These insights come from a trio of newly published papers based on the analysis of Bennu samples by scientists at NASA and other institutions.",
    "published_at": "2025-08-22T14:01:11Z",
    "updated_at": "2025-08-22T14:10:06.633147Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Asteroid Bennu is a mixture of dust that formed in our solar system, organic matter from interstellar space, and pre-solar system stardust. Its unique and varied contents were dramatically transformed over time by interactions with water and exposure to the harsh space environment. These insights come from a trio of newly published papers based on the analysis of Bennu samples. Asteroids provide a record of the solar system’s history. Some types of asteroids burn up in the atmosphere and never make it to the ground. The next samples NASA expects to help unravel our solar system's story will be Moon rocks returned by the Artemis III astronauts."
  },
  {
    "id": 32709,
    "title": "Week in images: 18-22 August 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_18-22_August_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/iberian_fires_august_2025/26845081-2-eng-GB/Iberian_fires_August_2025_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 18-22 August 2025",
    "published_at": "2025-08-22T13:10:00Z",
    "updated_at": "2025-08-22T13:20:10.855496Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 32708,
    "title": "Lunar Environment Structural Test Rig",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/lunar-environment-structural-test-rig/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/grc-2025-c-05348.jpg",
    "news_site": "NASA",
    "summary": "The Lunar Environment Structural Test Rig simulates the intense cold of the lunar night, ranging from 40 Kelvin (K) to 125 K while maintaining a vacuum environment. This creates a tool by which scientists and engineers can test materials, electronics, and flight hardware for future Moon and Mars missions, characterizing their behaviors at these temperatures while also validating their ability to meet design requirements.",
    "published_at": "2025-08-22T12:29:37Z",
    "updated_at": "2025-08-22T12:30:08.567377Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "LESTR simulates the intense cold of the lunar night, ranging from 40 Kelvin (K) to 125 K. It uses a cryocooler to reject heat and bring the test section to any point desired by the test engineer. LESTR enables safe, accurate, and cost-effective testing of materials and hardware."
  },
  {
    "id": 32706,
    "title": "Rocket Report: Pivotal Starship test on tap, Firefly wants to be big in Japan",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/rocket-report-pivotal-starship-test-on-tap-firefly-wants-to-be-big-in-japan/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/Gy5mgr3XsAAs79t.jpg",
    "news_site": "Arstechnica",
    "summary": "Starship returns to the launch pad for the first time in three months.",
    "published_at": "2025-08-22T11:00:18Z",
    "updated_at": "2025-08-22T11:10:04.714886Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX's Starship rocket will return to the launch pad for the first time in three months on Sunday. A Chinese methane-powered rocket failed on Friday after the carrier rocket experienced an \"anomaly\" The French government has granted Avio a 10-year license to carry out Vega rocket operations from the Guiana Space Centre. SpaceX launched its 100th Falcon 9 rocket of the year Monday morning. Students from Concordia University cheered and whistled as the Starsailor rocket lifted off on Cree territory on August 15. This was Canada's first space launch in more than 25 years, and the first to be achieved by a team of students, according to the university. SpaceX has not had a good run of things with the ambitious Starship vehicle this year. Three times, in January, March, and May, the vehicle took flight. Sources at SpaceX believe the upper stage issues can be resolved. But the acid test will only come on upcoming flights, beginning Sunday. Engineers recreated the diffuser failure on the ground during the investigation. They then redesigned the part to better direct pressurized gas into the main fuel tank. This will also \"substantially decrease\" strain on the Diffuser structure, SpaceX said. The Falcon 9 is scheduled to launch on August 22."
  },
  {
    "id": 32707,
    "title": "Hubble Observes Noteworthy Nearby Spiral Galaxy",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-observes-noteworthy-nearby-spiral-galaxy/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/spiral/Hubble_NGC2835_potw2533a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image offers a new view of the nearby spiral galaxy NGC 2835, which lies 35 million light-years away in the constellation Hydra (the Water Snake). The galaxy’s spiral arms are dotted with young blue stars sweeping around an oval-shaped center where older stars reside. This image differs from previously released […]",
    "published_at": "2025-08-22T11:00:00Z",
    "updated_at": "2025-08-22T11:10:05.669636Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NGC 2835 lies 35 million light-years away in the constellation Hydra (the Water Snake) The galaxy’s spiral arms are dotted with young blue stars sweeping around an oval-shaped center where older stars reside. This image differs from previously released images from Hubble and the NASA/ESA/CSA James Webb Space Telescope."
  },
  {
    "id": 32704,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/22/live-coverage-spacex-to-launch-24-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb-2/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/03/20250320_F9_SLC-4E_small.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The mission will include the 1,800th Starlink satellite launched in 2025. SpaceX is targeting liftoff from pad 4E at Vandenberg Space Force Base at 10:02 a.m. PDT (1:02 p.m. EDT / 1702 UTC).",
    "published_at": "2025-08-22T05:18:06Z",
    "updated_at": "2025-08-22T08:47:47.751781Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "80af8d63-64aa-4d16-9abd-bdbe167cecb9",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "SpaceX is planning to launch of its latest batch of Starlink V2 Mini satellites from Vandenberg Space Force Base in California on Friday. The Starlink 17-6 mission will add another 24 satellites to the low Earth orbit constellation. With a successful completion of this mission, SpaceX will have launched more than 1,800 of its Starlink satellites in 2025 alone."
  },
  {
    "id": 32705,
    "title": "SpaceX launches Space Force’s X-37B spaceplane to demo laser communications, quantum navigation",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/22/spacex-launches-space-forces-x-37b-spaceplane-to-demo-laser-communications-quantum-navigation/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250821_USSF-36_streak_JP-1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The uncrewed spacecraft will operate in low Earth orbit for an unspecified amount of time. This is the eighth launch of an X-37B Orbital Test Vehicle since its first flight in 2010.",
    "published_at": "2025-08-22T05:15:08Z",
    "updated_at": "2025-08-22T08:47:30.191874Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2d5f2335-c3c2-4306-9dde-8ec37f348ccf",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The X-37B Orbital Test Vehicle was launched Thursday night. It's the eighth mission for the program, which began operational flights in April 2010. There are two operational spaceplanes in the X- 37B fleet. The rocket's first stage will attempt to land on a SpaceX droneship. NASA, Boeing and Lockheed Martin argued that the United States shouldn't skip past the Moon in favor of Mars. The discussion came up during a panel at the SpaceCom conference concerning the Artemis 2 mission. A SpaceX Falcon 9 rocket loaded with 10 Iridium Next communications satellite is awaiting a predawn launch Wednesday from Vandenberg Air Force Base."
  },
  {
    "id": 32703,
    "title": "X-37B Lifts Off on Eighth Mission",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/x-37b-lifts-off-on-eighth-mission/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/X-37B-after-OTV6-USSF-300x200.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "The U.S. Space Force’s X-37B Orbital Test Vehicle lifted off from Kennedy Space Center just before midnight on its eighth flight, OTV-8. Looking like a small space shuttle, the spaceplane […]",
    "published_at": "2025-08-22T03:52:08Z",
    "updated_at": "2025-08-22T08:47:23.060168Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2d5f2335-c3c2-4306-9dde-8ec37f348ccf",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The U.S. Space Force’s X-37B Orbital Test Vehicle lifted off from Kennedy Space Center just before midnight on its eighth flight, OTV-8. Looking like a small space shuttle, the spaceplane was nestled inside the fairing of a SpaceX Falcon 9 rocket. The USSF released a pre-launch photo and shared a few nuggets about some of the experiments aboard, but little is known about what these X- 37B missions do. Boeing built two X-37Bs. USSF didn’t specify which is being used for this mission. Some question whether it may be a space weapon of some kind. Secure World Foundation tracks global counterspace capabilities and concludes that’s not likely."
  },
  {
    "id": 32701,
    "title": "NASA’s SpaceX 33rd Commercial Resupply Mission Overview",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/commercial-resupply/spacex-crs/nasas-spacex-33rd-commercial-resupply-mission-overview/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/spacex-falcon9-dragon.png",
    "news_site": "NASA",
    "summary": "NASA and SpaceX are targeting no earlier than 2:45 a.m. EDT on Sunday, Aug. 24, for the next launch to deliver scientific investigations, supplies, and equipment to the International Space Station.",
    "published_at": "2025-08-21T20:51:21Z",
    "updated_at": "2025-08-22T08:47:16.752064Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "e8e93778-657c-401c-9c88-3cd4c7c45c9d",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The SpaceX Dragon spacecraft will arrive at the space station at approximately 7:30 a.m. on Monday, Aug. 25. NASA astronauts Mike Fincke and Jonny Kim will monitor the spacecraft’s arrival. It will stay docked to the orbiting laboratory for about four months before splashing down. Reboost Kit – This kit will perform a reboost demonstration of the station to maintain its current altitude. Separator Orbital Unit – The unit draws air and condensate mixture from a condensing heat exchanger. Reducer Cylinder Assembly & Emergency Portable Breathing Apparatus – Together, this hardware provides 15 minutes of oxygen to a crew member in case of an emergency. Oxygen Generation Assembly Pump converts potable water from the water recovery system into oxygen and hydrogen. The oxygen is sent to the crew cabin, and the hydrogen is either vented or used to produce more water. The Rate Gyro Enclosure Assembly determines the space station’s rate of angular motion."
  },
  {
    "id": 32702,
    "title": "To See the World in a Grain of Sand: Investigating Megaripples at ‘Kerrlaguna’",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/to-see-the-world-in-a-grain-of-sand-investigating-megaripples-at-kerrlaguna/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/mars2020/2025/perseverance-rover-updates/august-2025/Mars_Perseverance_ZR0_1593_0808356707_285EBY_N0780780ZCAM09652_1100LMJ.jpg",
    "news_site": "NASA",
    "summary": "Written by Athanasios Klidaras, Ph.D. candidate at Purdue University On Mars, the past is written in stone — but the present is written in sand. Last week, Perseverance explored inactive megaripples to learn more about the wind-driven processes that are reshaping the Martian landscape every day.  After wrapping up its investigation at the contact between […]",
    "published_at": "2025-08-21T20:07:56Z",
    "updated_at": "2025-08-21T21:10:06.586835Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Perseverance explored inactive megaripples to learn more about the wind-driven processes that are reshaping the Martian landscape every day. It is hoped that this investigation at “Kerrlaguna’ can provide a practice run for a more comprehensive campaign located at a more extensive field of larger bedforms at ‘Lac de Charmes’"
  },
  {
    "id": 32700,
    "title": "NASA Astronauts to Answer Questions from Students in Ohio",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-astronauts-to-answer-questions-from-students-in-ohio/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/nasa-astronauts-mike-fincke-and-zena-cardman-downlink-advisory-aug-21.jpg",
    "news_site": "NASA",
    "summary": "NASA astronauts Michael Fincke and Zena Cardman will connect with students in Ohio as they answer prerecorded science, technology, engineering, and mathematics (STEM) questions aboard the International Space Station. The Earth-to-space call will begin at 10:15 a.m. EDT on Wednesday, Aug. 27, and will stream live on the agency’s Learn With NASA YouTube channel. Media […]",
    "published_at": "2025-08-21T17:55:14Z",
    "updated_at": "2025-08-21T18:00:07.327821Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronauts Michael Fincke and Zena Cardman will answer prerecorded science, technology, engineering, and mathematics questions. The Earth-to-space call will begin at 10:15 a.m. EDT on Wednesday, Aug. 27. Media interested in covering the event must RSVP by 5 p.m., Monday, August 25."
  },
  {
    "id": 32699,
    "title": "NASA’s Artemis II Lunar Science Operations to Inform Future Missions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/solar-system/moon/nasas-artemis-ii-lunar-science-operations-to-inform-future-missions/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/psd/earths-moon/lunar-science/Artemis/artemis2_flyby.jpg",
    "news_site": "NASA",
    "summary": "While the Artemis II crew will be the first humans to test NASA’s Orion spacecraft in space, they will also conduct science investigations that will inform future deep space missions, including a lunar science investigation as Orion flies about 4,000 to 6,000 miles from the Moon’s surface.",
    "published_at": "2025-08-21T16:51:39Z",
    "updated_at": "2025-08-21T17:10:16.008580Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Artemis II crew will be the first humans to test NASA’s Orion spacecraft in space. Crew will analyze and photograph geologic features on the surface. Astronauts will practice describing nuances in shapes, textures, and colors of surface features. Artemis III astronauts will investigate the land forms, rocks, and other features around their landing site.  Artemis II will conduct experiments on the lunar surface. This data could inform long-term lunar exploration and future human missions to Mars. These experiments will be managed through the Payload Mission Operations Directorate at NASA’s Marshall Space Flight Center, in Huntsville, Alabama. For more information on Artemis II, visit: www.nasa.gov/mission/artemis-ii."
  },
  {
    "id": 32697,
    "title": "Cities by the Bay",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/cities-by-the-bay/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/iss073e0420568orig.jpg",
    "news_site": "NASA",
    "summary": "NASA astronaut Nichole Ayers took this photo of California’s San Francisco Bay Area surrounded by the cities of San Francisco, Oakland, and San Jose, and their suburbs on Aug. 3, 2025. At the time, the International Space Station orbited 260 miles above the Golden State. The International Space Station serves as a unique platform for […]",
    "published_at": "2025-08-21T15:40:46Z",
    "updated_at": "2025-08-21T15:50:04.846935Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA astronaut Nichole Ayers took this photo of California’s San Francisco Bay Area surrounded by the cities of San Francisco, Oakland, and San Jose. At the time, the International Space Station orbited 260 miles above the Golden State. The space station serves as a unique platform for observing Earth with both hands-on and automated equipment."
  },
  {
    "id": 32696,
    "title": "Close-Up Views of NASA’s DART Impact to Inform Planetary Defense",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/dart/close-up-views-of-nasas-dart-impact-to-inform-planetary-defense/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/dart/licia_cube_side_by_side.png",
    "news_site": "NASA",
    "summary": "On Sept. 11, 2022, engineers at a flight control center in Turin, Italy, sent a radio signal into deep space. Its destination was NASA’s DART (Double Asteroid Redirection Test) spacecraft flying toward an asteroid more than 5 million miles away. The message prompted the spacecraft to execute a series of pre-programmed commands that caused a small, […]",
    "published_at": "2025-08-21T14:28:20Z",
    "updated_at": "2025-08-21T15:18:13.363212Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "c4b2f90e-3385-4cbe-a89f-fc5f57da1bfb",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "NASA's DART spacecraft collided with near-Earth asteroid Dimorphos in 2022. A shoebox-sized satellite called LICIACube flew past the asteroid to snap a series of photos. The images provided the only on-site observations of the world's first demonstration of an asteroid deflection. The innermost parts of the plume were so thick with debris that they were completely opaque. Scientists used models to estimate the number of particles that were hidden from view. Data from other rubble-pile asteroids, including pieces of Bennu delivered to Earth in 2023 by NASA’s OSIRIS-REx spacecraft, helped refine the estimate."
  },
  {
    "id": 32695,
    "title": "NASA Invites Media to Joint Launch of Sun, Space Weather Missions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-joint-launch-of-sun-space-weather-missions/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/imap-closeouts.jpg",
    "news_site": "NASA",
    "summary": "Media accreditation is open for the launch of three observatories that will study the Sun and enhance the ability to make accurate space weather forecasts, helping protect technology systems that affect life on Earth. NASA is targeting no earlier than Tuesday, Sept. 23, for the launch of the agency’s IMAP (Interstellar Mapping and Acceleration Probe), […]",
    "published_at": "2025-08-21T14:07:37Z",
    "updated_at": "2025-08-21T14:39:05.701599Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "689d7129-10fa-4df9-b81e-2b8fb926bbaf",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "NASA is targeting no earlier than Tuesday, Sept. 23, for the launch of the agency’s IMAP ( Interstellar Mapping and Acceleration Probe ) IMAP will use 10 science instruments to study and map the heliosphere, a vast magnetic bubble surrounding the Sun. The Carruthers Geocorona Observatory is a small satellite set to study the exosphere, the outermost part of Earth's atmosphere. IMAP is the fifth mission in NASA’s Solar Terrestrial Probes program portfolio. Princeton University professor David McComas leads the IMAP mission with an international team of 25 partner institutions. The Johns Hopkins Applied Physics Laboratory in Laurel, Maryland, built the spacecraft and operates the mission."
  },
  {
    "id": 32694,
    "title": "France Grants Avio 10-Year Licence to Launch from Guiana Space Centre",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/france-grants-avio-10-year-licence-to-launch-from-guiana-space-centre/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/France-Grants-Avio-Ten-Year-Licence-to-Launch-from-Guiana-Space-Centre.webp",
    "news_site": "European Spaceflight",
    "summary": "The French government has granted Italian launch services provider Avio a ten-year licence to carry out Vega rocket operations from the Guiana Space Centre in French Guiana. During the 2023 Space Summit in Seville, European Space Agency Member States approved Italy’s petition to allow Avio to market and manage Vega rocket launches independently of Arianespace, […]\nThe post France Grants Avio 10-Year Licence to Launch from Guiana Space Centre appeared first on European Spaceflight.",
    "published_at": "2025-08-21T12:54:57Z",
    "updated_at": "2025-08-21T13:00:14.629190Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The French government has granted Avio a ten-year licence to carry out Vega rocket operations from the Guiana Space Centre in French Guiana. During the 2023 Space Summit in Seville, European Space Agency Member States approved Italy’s petition to allow Avio to market and manage Vega rocket launches. The company will formally take over the operation of the rocket with the launch of Vega C flight VV30, slated for later this year."
  },
  {
    "id": 32693,
    "title": "X-37B set to launch on USSF-36 mission aboard Falcon 9",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/ussf-36-launch/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Gy2VQb5aoAA3G--scaled.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "The U.S. Department of Defense’s reusable X-37B Orbital Test Vehicle (OTV) is about to make…\r\nThe post X-37B set to launch on USSF-36 mission aboard Falcon 9 appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-21T12:36:22Z",
    "updated_at": "2025-08-21T12:58:38.081073Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2d5f2335-c3c2-4306-9dde-8ec37f348ccf",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The U.S. Department of Defense’s reusable X-37B Orbital Test Vehicle (OTV) is about to make its eighth overall flight into orbit. Vehicle 1 is scheduled to launch atop a SpaceX Falcon 9 from the Kennedy Space Center on Thursday, August 21, at 11:50 PM EDT (03:50 UTC on Friday, Aug. 22) The launch window is just under four hours long and lasts until 3:40 AM EDT (07:40 UTC) on Friday morning. After liftoff, Falcon 9 will follow a northeast trajectory to loft the OTV into a low-Earth orbit, possibly a circular orbit at 500 km altitude inclined 49.5 degrees to the equator. OTV-8 will demonstrate laser communications using proliferated low-Earth orbit (LEO) communications satellite networks. Laser communications can carry higher data bandwidth due to the shorter wavelength of infrared light versus radio waves. The quantum inertial sensor experiment is also an effort to increase resiliency in military space systems. The X-37B OTV is a spaceflight-capable spacecraft. It is nearly nine meters long and features a 4.5 m wingspan. The spaceplane’s capacity to fly experiments was increased when a non-reusable service module for use in space was added to the design."
  },
  {
    "id": 32692,
    "title": "SpaceX has built the machine to build the machine. But what about the machine?",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/spacex-has-built-the-machine-to-build-the-machine-but-what-about-the-machine/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/starfactory.jpg",
    "news_site": "Arstechnica",
    "summary": "SpaceX has built an impressive production site in Texas. Will Starship success follow?",
    "published_at": "2025-08-21T11:30:20Z",
    "updated_at": "2025-08-21T11:40:04.557404Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has built an impressive production site in Texas. The factory measures about 1 million square feet. This is two times as large as SpaceX's main Falcon 9 factory in Hawthorne, California. The ultimate goal of this factory is to build one Starship rocket a day. SpaceX has not had a good run of things with the ambitious Starship vehicle this year. Three times, in January, March, and May, the vehicle took flight. The vehicle's tenth test flight is scheduled to take place no earlier than August 24. Success with Starship would solve a lot of problems for SpaceX. SpaceX's Starship program has been so disappointing this year. There will be a lot of learning, and almost certainly some failures, as SpaceX works through these technical milestones. If it continues to have teething pains, though, that makes it easier for Congress to continue funding NASA's expensive rocket and spacecraft, as it would prefer to do. Musk is highly critical of Artemis, saying NASA should focus on Mars. Both the Moon and Mars versions of Starship require the vehicle to reach orbit and successfully refuel. If Artemis is not a priority for Musk, how can it be for SpaceX? This all creates a tremendous amount of uncertainty ahead of Sunday's Starship launch."
  },
  {
    "id": 32691,
    "title": "NASA Selecting New Astronauts, Gearing Up for Artemis II",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/nasa-selecting-new-astronauts-gearing-up-for-artemis-ii/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Artemis-II-smiling-Apr-2023-NASA-261x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "In four weeks, NASA will introduce a new class of astronauts as it begins gearing up for the launch of Artemis II, the first time humans will travel around the […]",
    "published_at": "2025-08-21T03:05:47Z",
    "updated_at": "2025-08-21T03:10:20.428987Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA will introduce a new class of astronauts as it begins gearing up for the launch of Artemis II, the first time humans will travel around the Moon since the Apollo era. Artemis II is a test flight that will not attempt even to orbit the Moon, much less land. The four-person American-Canadian crew will fly a free-return trajectory taking them past the Moon and back to Earth. Cruz posted a video of the JSC visit and wrote that he is “making sure we have the tools we need to maintain American dominance in space,” but provided no details about the fate of the $10 billion. He and Babin wrote to Duffy on August 5 asking for details on when and how it will be spent. NASA laid out an architecture for routine flights beyond that, including assembling a lunar Gateway space station. The Trump Administration wants to kill not only Gateway, but SLS and Orion after Artemis III and replace them with commercial alternatives. Congress disagrees, pointing out commercial alternatives don’t exist yet."
  },
  {
    "id": 32690,
    "title": "Curiosity Blog, Sols 4636-4637: Up Against a Wall",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4636-4637-up-against-a-wall/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04634_opgs_edr_ncam_NLB_808883082EDR_F1181608NCAM00251M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Michelle Minitti, MAHLI Deputy Principal Investigator, Framework Earth planning date: Wednesday, Aug. 20, 2025 What does a good rover do when her back is up against a wall? Fight for science! Curiosity indeed fought the good fight at “Río Frío,” the wall of one of the many ridges cutting through the boxwork terrain […]",
    "published_at": "2025-08-21T02:28:07Z",
    "updated_at": "2025-08-21T03:10:12.973646Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The observations along the wall today provide insight into the internal structure and chemistry of the ridges. The structural story will be told by the large Mastcam mosaics we planned, covering the ridge from base to top. The mosaic target, “Jardín de las Delicias,” will surely yield a surfeit of Martian delights."
  },
  {
    "id": 32689,
    "title": "Firefly Looks to Japan’s Hokkaido Spaceport for First Asia Launch Site; Signs Feasibility Study MOU",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/policy-and-finance/firefly-looks-to-japans-hokkaido-spaceport-for-first-asia-launch-site-signs-feasibility-study-mou",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755721850352.jpg",
    "news_site": "The Launch Pad",
    "summary": "Firefly Looks to Japan’s Hokkaido Spaceport for First Asia Launch Site; Signs Feasibility Study MOU",
    "published_at": "2025-08-20T20:23:00Z",
    "updated_at": "2025-08-20T20:50:18.486801Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The agreement will study the feasibility of launching Firefly’s small-lift Alpha rocket from the growing commercial spaceport in Taiki Town, Japan. For Firefly, the agreement marks a potential expansion into Asia and adds flexibility for customers in the region. The news comes as Firefly works to return Alpha to flight following a failure earlier this year. The timing of any Firefly launches from Hokkaido remains uncertain. A company spokesperson confirmed that the schedule will depend on the results of the feasibility study under the newly signed MOU. If successful, the agreement would mark a significant milestone for both Firefly and SPACE COTAN: Firefly would secure access to Asia’s rapidly growing satellite market."
  },
  {
    "id": 32686,
    "title": "X-ray and Radio go ‘Hand in Hand’ in New Image",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/x-ray-and-radio-go-hand-in-hand-in-new-image/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/msh1552.jpg",
    "news_site": "NASA",
    "summary": "In 2009, NASA’s Chandra X-ray Observatory released a captivating image: a pulsar and its surrounding nebula that is shaped like a hand. Since then, astronomers have used Chandra and other telescopes to continue to observe this object. Now, new radio data from the Australia Telescope Compact Array (ATCA), has been combined with Chandra’s X-ray data […]",
    "published_at": "2025-08-20T19:18:59Z",
    "updated_at": "2025-08-20T19:20:06.670086Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Pulsar B1509-58 is a rapidly spinning neutron star that is only about 12 miles in diameter. This tiny object is responsible for producing an intricate nebula that spans over 150 light-years, or about 900 trillion miles. The nebula, which is produced by energetic particles, resembles a human hand with a palm and extended fingers pointing to the upper right in X-rays.  composite image of a nebula and pulsar that strongly resembles a cosmic hand reaching for a neon red cloud. Breaks in the cloud reveal interwoven strands of gold resembling spiderwebs, or a latticework substructure. The pulsar, a rapidly spinning neutron star only 12 miles in diameter, is far too small to be seen in this image, which represents a region of space over 150 light-years across."
  },
  {
    "id": 32688,
    "title": "NASA to Announce New Astronaut Class, Preview Artemis II Moon Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-to-announce-new-astronaut-class-preview-artemis-ii-moon-mission/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/screenshot-197.png",
    "news_site": "NASA",
    "summary": "Lee esta nota de prensa en español aquí. NASA is opening media accreditation for multi-day events to introduce America’s newest astronaut class and provide briefings for the Artemis II crewed test flight around the Moon. The activities will take place in September at the agency’s Johnson Space Center in Houston. After evaluating more than 8,000 applications, […]",
    "published_at": "2025-08-20T19:16:01Z",
    "updated_at": "2025-08-20T19:20:06.722054Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is opening media accreditation for multi-day events to introduce America’s newest astronaut class. The Artemis II crewed test flight around the Moon will take place in September. Media who wish to participate in person must contact the NASA Johnson newsroom at 281-483-5111 or jsccommu@mail.nasa.gov. Learn more about how NASA leads human spaceflight efforts at: https://www.nasa.gov/humans-in-space. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. For more information on NASA's Human Spaceflight Program, please visit: http://humansinspace.gov."
  },
  {
    "id": 32685,
    "title": "NASA: Ceres May Have Had Long-Standing Energy to Fuel Habitability",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/dawn/nasa-ceres-may-have-had-long-standing-energy-to-fuel-habitability/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/1-pia20182-ceres-globe.jpg",
    "news_site": "NASA",
    "summary": "The dwarf planet is cold now, but new research paints a picture of Ceres hosting a deep, long-lived energy source that may have maintained habitable conditions in the past. New NASA research has found that Ceres may have had a lasting source of chemical energy: the right types of molecules needed to fuel some microbial […]",
    "published_at": "2025-08-20T18:13:38Z",
    "updated_at": "2025-08-20T18:20:06.207405Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Dwarf planet Ceres may have had a long-lived source of chemical energy. The right molecules needed to fuel some microbial metabolisms. No evidence that microorganisms ever existed on Ceres. Findings support theories that this intriguing dwarf planet may have once had conditions suitable to support single-celled lifeforms. Dawn was a project of the directorate’s Discovery Program. Northrop Grumman in Dulles, Virginia, designed and built the spacecraft. German Aerospace Center, Max Planck Institute for Solar System Research, Italian Space Agency and Italian National Astrophysical Institute were international partners on the mission team."
  },
  {
    "id": 32684,
    "title": "Russia launches Bion-M No.2 research satellite",
    "authors": [
      {
        "name": "P. Katin",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/russia-bion-m/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-20-18-14-08-653.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Russia launched the Bion-M No.2 satellite at 17:13 UTC on Wednesday, Aug. 20, aboard a…\nThe post Russia launches Bion-M No.2 research satellite appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-20T17:14:34Z",
    "updated_at": "2025-08-20T17:20:12.942510Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Russia launched the Bion-M No.2 satellite at 17:13 UTC on Wednesday, Aug. 20, aboard a Soyuz-2-1b rocket from Site 31/6 at the Baikonur Cosmodrome. This biomedical satellite is a continuation of a Soviet and later Russian scientific program, which started with the launch of Bion 1 back in 1973. Bion program uses spacecraft that are based on the Zenit series of reconnaissance satellites, sharing the same basic design. Bion-M № 2 is scheduled to land on the steppe in the Orenburg region on September 19. The mice were bred specifically for this spaceflight. The NRF2 gene, which regulates the detoxification and antioxidant protection system, is the focus of this research. Bion-M No.2 mission will study the germination of seeds, study the effects of space conditions on the plants. Various microorganisms are also flying on board the satellite: anaerobic, spore-forming microorganisms and extremophiles. A place on board has been found for two experiments designed by school students. The mission comes over 12 years after the previous mission, which returned to Earth in May 2013."
  },
  {
    "id": 32683,
    "title": "Viking 1 Begins Journey to Mars",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/viking-1-begins-journey-to-mars/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/4940404265-47186ca7a3-o.jpg",
    "news_site": "NASA",
    "summary": "A Titan-Centaur rocket carrying the Viking 1 spacecraft launches from Complex 41 at Cape Canaveral Air Force Station on Aug. 20, 1975. Viking 1 touched down on the red planet on July 20, 1976, becoming the first truly successful landing on Mars. Viking 1 was the first of a pair of complex deep space probes […]",
    "published_at": "2025-08-20T16:52:19Z",
    "updated_at": "2025-08-20T17:00:10.754816Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Viking 1 touched down on the red planet on July 20, 1976, becoming the first truly successful landing on Mars. Viking 1 was the first of a pair of complex deep space probes that were designed to reach Mars. NASA’s exploration of Mars continues, with rovers exploring the surface and spacecraft studying from orbit."
  },
  {
    "id": 32682,
    "title": "Live coverage: SpaceX to launch X-37B military spaceplane on Falcon 9 rocket from the Kennedy Space Center",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/20/live-coverage-spacex-to-launch-x-37b-military-spaceplane-on-falcon-9-rocket-from-the-kennedy-space-center/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/03/20250307-X37B.jpg",
    "news_site": "Spaceflight Now",
    "summary": "This will be the eighth flight of the X-37B and the third time that it will launched by SpaceX. The Falcon 9 rocket is scheduled to liftoff from Launch Complex 39A at 11:50 p.m. EDT (0350 UTC). ",
    "published_at": "2025-08-20T16:41:36Z",
    "updated_at": "2025-08-20T16:50:18.326645Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The U.S. Space Force and SpaceX are preparing to launch the Boeing-built X-37B spaceplane on its eighth mission shortly before midnight on Thursday. The winged spacecraft, flying under the mission names USSF-36 and Orbital Test Vehicle 8 (OTV-8), will launch atop a Falcon 9 rocket from pad 39A at NASA’s Kennedy Space Center at 11:50 p.m. EDT (0350 UTC) Meteorologists with the 45th Weather Squadron forecast a 65 percent chance for favorable conditions for liftoff. The OTV-8 flight will also feature what the Space Force calls “the world’s highest performing quantum inertial sensor ever used in space” It will demonstrate navigational capabilities without the use of GPS by instead “detecting rotation and acceleration of atoms”"
  },
  {
    "id": 32681,
    "title": "Firefly Aerospace explores launching its Alpha rocket from Japan",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/20/firefly-aerospace-explores-launching-its-alpha-rocket-from-japan/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250818_FLA006_launch.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "If the company moves forward with this possibility, it would present Firefly with a third launch site for its Alpha rockets. ",
    "published_at": "2025-08-20T16:07:14Z",
    "updated_at": "2025-08-20T16:10:17.431474Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Hokkaido Spaceport has room for two launch complexes designed to support the launches of small, orbital-class rockets. All six of Firefly Aerospace’s Alpha rocket launches so far took off from Space Launch Complex 2 at Vandenberg Space Force Base in California. Rocket Lab has launched the vast majority of its more than 60 Electron rockets from Mahia, New Zealand.  Firefly Aerospace launched its Alpha rocket Friday after a launch attempt on Wednesday was scrubbed by bad weather. The infrastructure expansion in Briggs, Texas, boosts the company’s manufacturing space from 92,000 to 207,000 square feet. Liftoff with a payload for Lockheed Martin occurred at 9:32 a.m. PST."
  }
]