[
  {
    "id": 32547,
    "title": "Crew-10 Splashes Down Off San Diego",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/crew-10-splashes-down-off-san-diego/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Crew10-splashdown-NASA-300x200.webp",
    "news_site": "SpacePolicyOnline.com",
    "summary": "NASA’s Crew-10 splashed down in the Pacific Ocean this morning after five months on the International Space Station. Two private astronaut crews, Fram2 and Axiom-4, made West Coast splashdowns earlier […]",
    "published_at": "2025-08-10T02:46:30Z",
    "updated_at": "2025-08-10T02:50:12.895844Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Crew Dragon Endurance landed off the coast of San Diego at 11:33 am EDT. SpaceX moved splashdowns from Florida to California to ensure that any surviving pieces of Dragon’s trunk, which separates during reentry, end up in the ocean and not on land. Two private astronaut crews, Fram2 and Axiom-4, made West Coast splashdowns earlier this year, but this is the first NASA crew to land there. NASA ISS Program Manager Dana Weigel said on August 1 that the Russian segment will be used for attitude control during the two-year process. The U.S. Deorbit Vehicle being built by SpaceX then will do the thrusting needed to direct the ISS into an unoccupied area of the Pacific Ocean in 2030."
  },
  {
    "id": 32546,
    "title": "NASA’s SpaceX Crew-10 Mission Returns, Splashes Down Off California",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasas-spacex-crew-10-mission-returns-splashes-down-off-california/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/nasas-spacex-crew-10-splashdown.jpg",
    "news_site": "NASA",
    "summary": "The first crew to splash down in the Pacific Ocean off the coast of California as part of NASA’s Commercial Crew Program completed the agency’s 10th commercial crew rotation mission to the International Space Station on Saturday. NASA astronauts Anne McClain and Nichole Ayers, JAXA (Japan Aerospace Exploration Agency) astronaut Takuya Onishi, and Roscosmos cosmonaut […]",
    "published_at": "2025-08-09T17:29:25Z",
    "updated_at": "2025-08-09T17:30:08.972527Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA astronauts Anne McClain and Nichole Ayers, JAXA (Japan Aerospace Exploration Agency) astronaut Takuya Onishi, and Roscosmos cosmonaut Kirill Peskov returned to Earth at 11:33 a.m. EDT. Crew-10 contributed hundreds of hours to scientific research, maintenance activities, and technology demonstrations."
  },
  {
    "id": 32545,
    "title": "Apollo 13 Astronaut Jim Lovell Passes Away",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/apollo-13-astronaut-jim-lovell-passes-away/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/NASA-astronauts-1962-300x197.webp",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Retired NASA astronaut Jim Lovell passed away yesterday at the age of 97. He will be long remembered as commander of Apollo 13, the historic 1970 mission to the Moon […]",
    "published_at": "2025-08-08T22:25:38Z",
    "updated_at": "2025-08-08T22:30:16.221829Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Jim Lovell passed away yesterday at the age of 97. He will be long remembered as commander of Apollo 13, the historic 1970 mission to the Moon. Lovell’s first spaceflight was Gemini VII , a 14-day mission with Borman in 1965, the longest spaceflight at that time. SpacePolicyOnline.com has the right (but not the obligation) to monitor the comments and to remove any materials it deems inappropriate. We do not post comments that include links to other websites since we have no control over that content nor can we verify the security of such links."
  },
  {
    "id": 32544,
    "title": "Jim Lovell, Apollo 8 & 13 astronaut, dies at 97",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/08/jim-lovell-apollo-8-13-astronaut-dies-at-97/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250808_Lovell_newspaper_small.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "Lovell served as the pilot of the Command Module for Apollo 8 and the commander of the Apollo 13 mission. NASA said he died Thursday, Aug. 7, in Lake Forest, Illinois, a suburb of Chicago. ",
    "published_at": "2025-08-08T21:08:38Z",
    "updated_at": "2025-08-08T21:10:19.134886Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "James 'Jim' Lovell, one of the last seven surviving Apollo astronauts, died on Thursday, Aug. 7, at the age of 97. A veteran of four spaceflights at the dawn of America’s human spaceflight program, he flew two missions in the Gemini program and then served on the crews of Apollo 8 and the ill-fated Apollo 13. NASA’s Perseverance Mars rover has been hoisted on top of its United Launch Alliance Atlas 5 rocket at Cape Canaveral for liftoff this month. Teams repaired a small leak on the launch vehicle and overcame delays caused by coronavirus cases among staff working on the mission. Kennedy Space Center will reopen for normal operations Friday."
  },
  {
    "id": 32543,
    "title": "NASA Selects Contractors to Supply Centers with Helium",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-selects-contractors-to-supply-centers-with-helium/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
    "news_site": "NASA",
    "summary": "NASA has chosen a group of contractors to supply multiple agency facilities with liquid and gaseous helium for at least the next two years. The NASA Agency-wide Supply of Liquid and Gaseous Helium contract is a fixed-price indefinite-delivery requirements contract with firm-fixed-price delivery orders. The awards have a total estimated value of approximately $105.1 million. […]",
    "published_at": "2025-08-08T20:55:19Z",
    "updated_at": "2025-08-08T21:00:11.489438Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The NASA Agency-wide Supply of Liquid and Gaseous Helium contract is a fixed-price indefinite-delivery requirements contract with firm-fixed-price delivery orders. The awards have a total estimated value of approximately $105.1 million. The performance period begins Wednesday, Oct. 1, to Sept. 30, 2027."
  },
  {
    "id": 32542,
    "title": "Legendary Apollo 13 Commander Jim Lovell Dies at 97",
    "authors": [
      {
        "name": "Chris Bergin",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/apollo-13-commander-lovell-dies-97/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-08-21-23-55-850.jpg",
    "news_site": "NASASpaceflight",
    "summary": "James “Jim” Lovell, the former NASA astronaut renowned for his heroic leadership during the ill-fated…\nThe post Legendary Apollo 13 Commander Jim Lovell Dies at 97 appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-08T20:37:46Z",
    "updated_at": "2025-08-08T20:40:18.273784Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Lovell was the oldest living former astronaut following the death of Frank Borman in 2023. Lovell’s career began in aviation, where he flew fighter jets, including a Western Pacific deployment aboard the aircraft carrier USS Shangri-La. He first ventured into space with the Gemini program, flying on Gemini 7 in 1965 and Gemini 12 in 1966. He later served as command module pilot on Apollo 8, the historic first crewed mission to orbit the Moon, before commanding Apollo 13. The Apollo 13 mission was a \"successful failure\" The mission spurred major safety redesigns in later Apollo spacecraft. Lovell retired from NASA in 1973 and pursued a successful career in the commercial sector. “We will miss his unshakeable optimism, his sense of humor, and the way he made each of us feel we could do the impossible,” his family said."
  },
  {
    "id": 32541,
    "title": "NASA Astronaut Jim Lovell, First to Orbit the Moon and Survive Apollo 13 Crisis; Passes at 97",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/remembering-nasa-astronaut-jim-lovell",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1754680440494.png",
    "news_site": "The Launch Pad",
    "summary": "NASA Astronaut Jim Lovell, First to Orbit the Moon and Survive Apollo 13 Crisis; Passes at 97",
    "published_at": "2025-08-08T19:10:00Z",
    "updated_at": "2025-08-08T19:30:19.425829Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Lovell is one of only three people to fly to the Moon twice, and the only one who did so without ever landing on it. His memoir, Lost Moon, remains one of the most compelling accounts of the Apollo program and served as the basis for Apollo 13. Known among his peers as “Smilin’ Jim” for his sharp wit and easygoing demeanor, Lovell was admired for his unwavering optimism and approachability. Lovell is survived by his four children, and a legacy that has touched millions around the world. “Jim Lovell embodied the bold resolve and optimism of both past and future explorers, and we will remember him always,” - NASA’s Statement Survived by His Family"
  },
  {
    "id": 32540,
    "title": "Acting NASA Administrator Reflects on Legacy of Astronaut Jim Lovell",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/acting-nasa-administrator-reflects-on-legacy-of-astronaut-jim-lovell/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/s69-62241large.jpg",
    "news_site": "NASA",
    "summary": "The following is a statement from acting NASA Administrator Sean Duffy on the passing of famed Apollo astronaut Jim Lovell. He passed away Aug. 7, in Lake Forest, Illinois. He was 97 years old. “NASA sends its condolences to the family of Capt. Jim Lovell, whose life and work inspired millions of people across the […]",
    "published_at": "2025-08-08T18:43:40Z",
    "updated_at": "2025-08-08T18:50:09.862888Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Jim Lovell passed away Aug. 7, in Lake Forest, Illinois. He was 97 years old. Lovell was nicknamed Smilin’ Jim by his fellow astronauts because he was quick with a grin when he had a particularly funny comeback. “Jim’s character and steadfast courage helped our nation reach the Moon and turned a potential tragedy into a success from which we learned an enormous amount,” NASA says."
  },
  {
    "id": 32539,
    "title": "NASA Invites Media to View Heliophysics, NOAA Space Weather Missions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-view-heliophysics-noaa-space-weather-missions/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/imap-advisory-aug-8.jpg",
    "news_site": "NASA",
    "summary": "NASA invites media to view the agency’s IMAP (Interstellar Mapping and Acceleration Probe) spacecraft and two other missions — the Carruthers Geocorona Observatory and the National Oceanic and Atmospheric Administration’s (NOAA) Space Weather Follow On–Lagrange 1 (SWFO-L1) observatory, which will launch along with IMAP as rideshares. Media will have the opportunity to photograph the three […]",
    "published_at": "2025-08-08T18:25:59Z",
    "updated_at": "2025-08-08T18:30:09.031702Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The IMAP mission will study the heliosphere, a vast magnetic bubble created by the Sun. Carruthers will use its ultraviolet cameras to monitor how material from the Sun impacts the outermost part of Earth’s atmosphere. The SWFO-L1 mission will observe solar eruptions, and monitor incoming space weather 24/7. Sara Frazier: 202-853-7191 sarah.frazier@nasa.gov Leejay Lockhart Kennedy Space Center, Florida 321-747-8310 leejay.lockhart@n Nasa.gov NASA explores the unknown in air and space, innovates for the benefit of humanity."
  },
  {
    "id": 32538,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites on Falcon 9 rocket from Vandenberg",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/08/live-coverage-spacex-to-launch-24-starlink-satellites-on-falcon-9-rocket-from-vandenberg/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/01/20240118-Starlink-File-Photo-Feature-Image.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 17-4 mission will add another 24 satellites to the growing megaconstellation in low Earth orbit. SpaceX is targeting the launch of its Falcon 9 rocket from pad 4E at Vandenberg Space Force Base at 8:43 p.m.  PDT (11:43 p.m. EDT / 0343 UTC). ",
    "published_at": "2025-08-08T16:29:25Z",
    "updated_at": "2025-08-08T16:30:22.141113Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is gearing up for its first Falcon 9 rocket launch from the West Coast in nine days with a mission to deliver 24 optimized Starlink V2 Mini satellites into a polar, low Earth orbit. Liftoff from Space Launch Complex 4 East at Vandenberg Space Force Base in California is scheduled for 8:43 p.m. PDT. If SpaceX is able to launch the KF-02 mission for Amazon’s Project Kuiper broadband satellite constellation, Saturday morning, the Starlink 17-4 mission will represent the company's 98th launch of 2025."
  },
  {
    "id": 32537,
    "title": "Rare Type of Black Hole Snacks on Star",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/rare-type-of-black-hole-snacks-on-star/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/unannotated-full-res-for-display.png",
    "news_site": "NASA",
    "summary": "NASA’s Hubble Space Telescope and NASA’s Chandra X-ray Observatory teamed up to identify a new possible example of a rare class of black holes, identified by X-ray emission (in purple) in this image released on July 24, 2025. Called NGC 6099 HLX-1, this bright X-ray source seems to reside in a compact star cluster in a giant elliptical galaxy. […]",
    "published_at": "2025-08-08T16:11:32Z",
    "updated_at": "2025-08-08T16:20:09.492160Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " Hubble Space Telescope and NASA’s Chandra X-ray Observatory teamed up to identify a new possible example of a rare class of black holes. Called NGC 6099 HLX-1, this bright X-rays source seems to reside in a compact star cluster in a giant elliptical galaxy. These rare black holes are called intermediate-mass black holes (IMBHs)"
  },
  {
    "id": 32536,
    "title": "The Exploration Company Completes Test Campaign for Lunar Lander Engine",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/the-exploration-company-completes-test-campaign-for-lunar-lander-engine/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/The-Exploration-Company-Completes-Test-Campaign-for-Lunar-Lander-Engine.webp",
    "news_site": "European Spaceflight",
    "summary": "The Exploration Company has completed a hot fire test campaign for the thrust chamber of its Huracan rocket engine. The testing put the fourth prototype of the thrust chamber through its paces, including introducing deliberate pressure disturbances to assess its performance under stress. Developed to power The Exploration Company’s Nyx Moon spacecraft, the Huracan engine […]\nThe post The Exploration Company Completes Test Campaign for Lunar Lander Engine appeared first on European Spaceflight.",
    "published_at": "2025-08-08T14:13:34Z",
    "updated_at": "2025-08-08T14:20:14.670324Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Exploration Company has completed a hot fire test campaign for its Huracan rocket engine. The testing put the fourth prototype of the thrust chamber through its paces, including introducing deliberate pressure disturbances to assess its performance under stress. The Huracan engine will support missions to both lunar orbit and the Moon’s surface. The company has not recently updated progress on its Nyx Moon spacecraft."
  },
  {
    "id": 32535,
    "title": "Week in images: 04-08 August 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_04-08_August_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/hubble_sizes_up_rare_interstellar_comet/26828252-1-eng-GB/Hubble_sizes_up_rare_interstellar_comet_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 04-08 August 2025",
    "published_at": "2025-08-08T13:15:00Z",
    "updated_at": "2025-08-08T13:10:18.165158Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 32534,
    "title": "Chinese launch cadence picks up as Tianlong-3 prepares for launch",
    "authors": [
      {
        "name": "Martin Smith",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/china-roundup-08072025/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Tianlong-3-simulator.jpg",
    "news_site": "NASASpaceflight",
    "summary": "China’s Space Pioneer is preparing for the maiden launch of its Tianlong-3, a vehicle similar…\nThe post Chinese launch cadence picks up as Tianlong-3 prepares for launch appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-08T12:59:10Z",
    "updated_at": "2025-08-08T13:00:20.405207Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "China launched four satellites in as many days in late July and early August. This included a successful return to flight for iSpace’s Shuang Quxian‑1 (or Hyperbola 1) China is preparing for the maiden launch of its Tianlong-3, a vehicle similar in design, size, and payload capacity to the Falcon 9. This is set to be the first of several commercially developed reusable launchers. Guowang and Qianfan constellations aim to compete with Starlink in size and reach. Both megaconstellations remain limited, for the time being, by the current bottlenecks in launcher availability and the speed of manufacturing the satellites. New commercially developed vehicles are edging closer to their debut launches, while some satellites are being manufactured by more than one company. iSpace has launched its own droneship, dedicated to the Shuang Quxian‑3 (or Hyperbola-3) rocket, as it took to the seas for the first time. Galactic Energy launched three Yunyao satellites aboard a Gushenxing-1S (Ceres 1S) in May. Chinarocket had also lofted ten satellite aboard a Jielong 3 in early January. Construction continues on pads LC-3 and 4 at the HICAL site, which will eventually extend to eight launch pads. Space Pioneer’s Tianlong-3 preparing for maiden launch, potentially in September. The two-stage rocket is similar in size, design, and payload capacity to SpaceX's Falcon 9. Its nine Tianhuo-12 (‘sky fire’) engines burn the same mix of liquid kerosene, also known as RP1, and liquid oxygen. Space Epoch fires a previously flown and recovered Longyun-70 engine. The company aims to conduct the Yuanxingzhe-1’s first orbital launch and sea recovery by the end of the year. Space Epoch has ambitions to launch up to 25 times annually."
  },
  {
    "id": 32532,
    "title": "Rocket Report: Firefly lights the markets up; SpaceX starts selling trips to Mars",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/rocket-report-firefly-lights-the-markets-up-spacex-starts-selling-ships-to-mars/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20250805204418_057650.jpeg",
    "news_site": "Arstechnica",
    "summary": "\"Get on board! We are going to Mars!\"",
    "published_at": "2025-08-08T11:00:14Z",
    "updated_at": "2025-08-08T11:10:13.257389Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Virgin Galactic delays resumption of spaceflights until 2026. Shares in space company Firefly begin trading at $70 on the NASDAQ. iRocket says it has signed a multi-year agreement with SpaceBelt KSA valued at up to $640 million. New York-based iRocket hasn't released much information on any technical progress. Chennai-based startup Agnikul Cosmos has announced the successful development of the world’s largest single-piece 3D-printed Inconel rocket engine. Skyrora became the first British commercial rocket manufacturer to secure a launch license from the UK Civil Aviation Authority. Crew-11 mission launches from Florida. The head of NASA has decided to move one of the agency's retired space shuttles to Houston. Senator John Cornyn did not state which of NASA's winged orbiters would be making the move. SpaceX has signed a \"first of its kind\" agreement with the Italian Space Agency."
  },
  {
    "id": 32533,
    "title": "Hubble Captures a Tarantula",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-captures-a-tarantula/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/nebulae/emission/Hubble_30Dor_potw2531a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image captures incredible details in the dusty clouds of a star-forming factory called the Tarantula Nebula. Most of the nebulae Hubble images are in our galaxy, but this nebula is in the Large Magellanic Cloud, a dwarf galaxy located about 160,000 light-years away in the constellations Dorado and Mensa. The […]",
    "published_at": "2025-08-08T11:00:00Z",
    "updated_at": "2025-08-08T11:10:13.983096Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "This image is very close to a rare type of star called a Wolf–Rayet star. The Tarantula Nebula is the largest and brightest star-forming region in the Large Magellanic Cloud. When stars die, they throw off their outer layers, creating the clouds that birth new stars."
  },
  {
    "id": 32531,
    "title": "Human minds, robotic hands",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/Human_minds_robotic_hands",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/human_minds_robotic_hands/26830088-1-eng-GB/Human_minds_robotic_hands_card_full.png",
    "news_site": "ESA",
    "summary": "Last July, a team of robots explored a simulated martian landscape in Germany, guided by an astronaut aboard the International Space Station. This was the final session of the Surface Avatar experiment, a joint initiative between ESA and the German Aerospace Center (DLR) to investigate how astronauts can remotely control robotic teams.",
    "published_at": "2025-08-08T07:30:00Z",
    "updated_at": "2025-08-08T07:40:14.955625Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Last July, a team of robots explored a simulated martian landscape in Germany, guided by an astronaut aboard the International Space Station. This latest session took place at the DLR site in Oberpfaffenhofen and introduced new levels of autonomy, decision-making and realism. Europe one step closer to seamless human-robot collaboration in space exploration."
  },
  {
    "id": 32530,
    "title": "Bruno Optimistic about ULA Launch Cadence, Worried About Starship Operations in Florida",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/bruno-optimistic-about-ula-launch-cadence-worried-about-starship-operations-in-florida/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/ULA-SLC3-Dec-3-24-300x225.jpeg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "ULA President Tory Bruno is optimistic the company will reach its goal of two launches a month by the end of 2025. That’s later than planned and total launches for […]",
    "published_at": "2025-08-08T00:29:52Z",
    "updated_at": "2025-08-08T00:30:19.194828Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "ULA President Tory Bruno is optimistic the company will reach its goal of two launches a month by the end of 2025. The first U.S. Space Force mission on ULA’s new Vulcan rocket next week will kick off a burst of activity that extends into 2026 and 2027. Bruno didn’t get into details about the payloads other than saying there are two satellites. ULA’s increased launch rate will add to congestion at CCSFS and the adjacent Kennedy Space Center. Bruno is concerned about what impact all that activity will have on other users of the Eastern Range. Bruno deferred to Sierra Space to say when it’ll be ready for launch."
  },
  {
    "id": 32529,
    "title": "ULA’s Tory Bruno lays out plans for ramping up launch cadence",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/07/ulas-tory-bruno-lays-out-plans-for-ramping-up-launch-cadence/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250807_USSF-106_VIF.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "United Launch Alliance will launch the USSF-106 mission as its first flight for the U.S. Space Force using a Vulcan rocket. The vehicle will carry two satellite missions onboard. ",
    "published_at": "2025-08-07T20:35:53Z",
    "updated_at": "2025-08-07T20:40:25.921350Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "United Launch Alliance is on the cusp of a significant milestone for its Vulcan rocket. The 202-foot-tall (61 m) launch vehicle is poised to take flight on its first national security mission. Atop the two-stage rocket are a pair of missions for that are part of the U.S. Space Force’s National Security Space Launch (NSSL) program. The next few years will be mostly driven by launches of ULA’s Vulcan rocket. Bruno said ULA is about 76 percent through building out Space Launch Complex 3 at Vandenberg Space Force Base in California. Amazon will fairly quickly move through its available Atlas 5 rocket launches to get its Kuiper constellation on orbit. SpaceX is hoping to get the green light to conduct up to 88 landings of the first and second stages of its Starship rocket. The Department of the Air Force is considering SpaceX’s proposal to conduct 76 launches and 152 landings at SLC-37. “We’re counting on the Space Force and the FAA to do a very thorough analysis of that,” Bruno said."
  },
  {
    "id": 32528,
    "title": "Italy Signs Agreement with SpaceX for Starship Mars Mission",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/italy-signs-agreement-with-spacex-for-starship-mars-mission/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Italy-Signs-Agreement-with-SpaceX-for-Starship-Mars-Mission.webp",
    "news_site": "European Spaceflight",
    "summary": "The Italian space agency, ASI, has signed an agreement with SpaceX for an uncrewed mission to Mars aboard one of the company’s Starship rockets. Announced on 7 August, the agreement includes provisions for several payloads, including a plant growth experiment, a radiation sensor, and a meteorological monitoring station. ASI expects to collect data not only […]\nThe post Italy Signs Agreement with SpaceX for Starship Mars Mission appeared first on European Spaceflight.",
    "published_at": "2025-08-07T19:10:16Z",
    "updated_at": "2025-08-07T19:20:16.161521Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Italian space agency, ASI, has signed an agreement with SpaceX for an uncrewed mission to Mars. The agreement includes provisions for several payloads, including a plant growth experiment, a radiation sensor, and a meteorological monitoring station. In March, SpaceX CEO Elon Musk stated that the company is targeting the end of next year for Starship’s first mission."
  },
  {
    "id": 32527,
    "title": "Linking Local Lithologies to a Larger Landscape",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/linking-local-lithologies-to-a-larger-landscape/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/mars2020/2025/perseverance-rover-updates/august-2025/Mars_Perseverance_ZR0_1568_0806136599_348EBY_N0771350ZCAM04183_1100LMJ.jpg",
    "news_site": "NASA",
    "summary": "Written by Margaret Deahn, Ph.D. Student at Purdue University NASA’s Mars 2020 rover is continuing to explore a boundary visible from orbit dividing bright, fractured outcrop from darker, smoother regolith (also known as a contact). The team has called this region “Westport,” (a fitting title, as the rover is exploring the western-most rim of Jezero), […]",
    "published_at": "2025-08-07T18:46:11Z",
    "updated_at": "2025-08-07T19:10:11.914378Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Olivine-rich materials are typically found draping over older rocks, often infilling depressions, which may provide clues to their origins. Jezero crater is in a region of Mars known as Northeast Syrtis, which hosts the largest contiguous exposure (more than 113,000 square kilometers, or more than 43,600 square miles) The Perseverance rover’s investigation may allow us to better constrain the history of the broader volcanic units."
  },
  {
    "id": 32526,
    "title": "US-French SWOT Satellite Measures Tsunami After Massive Quake",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/swot/us-french-swot-satellite-measures-tsunami-after-massive-quake/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/1-pia26652-swot-pac-tsunami-blk.jpg",
    "news_site": "NASA",
    "summary": "Data provided by the water satellite, a joint effort between NASA and the French space agency, is helping to improve tsunami forecast models, benefitting coastal communities. The SWOT (Surface Water and Ocean Topography) satellite captured the tsunami spawned by an 8.8 magnitude earthquake off the coast of Russia’s Kamchatka Peninsula on July 30, 11:25 a.m. […]",
    "published_at": "2025-08-07T18:22:12Z",
    "updated_at": "2025-08-07T18:30:12.267300Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Satellite captured the tsunami spawned by an 8.8 magnitude earthquake off the coast of Russia’s Kamchatka Peninsula on July 30, 11:25 a.m. local time. Data from SWOT provided a multidimensional look at the leading edge of the tsunami wave triggered by the earthquake. Comparing the observations fromSWOT to the model helps forecasters validate their model. The Doppler Orbitography and Radioposition Integrated by Satellite system, the dual frequency Poseidon altimeter, and ground operations were provided by CNES. The KaRIn high-power transmitter assembly was provided by CSA. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery."
  },
  {
    "id": 32525,
    "title": "ULA CEO Tory Bruno Outlines plans for Vulcan and beyond",
    "authors": [
      {
        "name": "Ryan Caton",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/ula-bruno-vulcan-and-beyond/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-07-18-25-43-056.jpg",
    "news_site": "NASASpaceflight",
    "summary": "In a teleconference ahead of the United Launch Alliance’s (ULA) first mission for the U.S.…\nThe post ULA CEO Tory Bruno Outlines plans for Vulcan and beyond appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-07T17:54:47Z",
    "updated_at": "2025-08-07T18:00:20.582645Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "United Launch Alliance (ULA) to launch Vulcan rocket for U.S. Space Force (USSF) ULA President and CEO Tory Bruno shared insights on a range of topics. Bruno addressed SpaceX’s Starship operations at Kennedy Space Center (KSC) Bruno also discussed ULA's reuse technologies and future launch infrastructure. Bruno expressed confidence in achieving nine launches this year, bolstered by the completion of a new Vertical Integration Facility (VIF) and Mobile Launch Platform (MLP) The payload mix is projected at a 40:60 ratio of government to commercial missions through 2027. Bruno expressed enthusiasm for Sierra Space’s Dream Chaser spacecraft. ULA CEO Tory Bruno used the conference to underscore ULA’s proactive stance in a rapidly evolving space sector. Bruno: ULA is balancing innovation with operational reliability to meet growing demands from both government and commercial clients. ULA: “Starship is an interesting vehicle. It's not just…"
  },
  {
    "id": 32524,
    "title": "NASA Uses Wind Tunnel to Test Advanced Air Mobility Aircraft Wing",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasa-uses-wind-tunnel-to-test-advanced-air-mobility-aircraft-wing/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/lrc-2025-ocio-01224.jpg",
    "news_site": "NASA",
    "summary": "The advanced air mobility industry is currently working to produce novel aircraft ranging from air taxis to autonomous cargo drones, and all of those designs will require extensive testing – which is why NASA is working to give them a head-start by studying a special kind of model wing. The wing is a scale model […]",
    "published_at": "2025-08-07T17:31:58Z",
    "updated_at": "2025-08-07T17:40:14.991905Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is studying a special kind of model wing. The wing is a scale model of a design used in a type of aircraft called a “tiltwing.” This allows the aircraft to take off, hover, and land like a helicopter, or fly like a fixed-wing airplane."
  },
  {
    "id": 32523,
    "title": "NASA’s Artemis II Crew Trains in Orion",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-artemis-ii-crew-trains-in-orion/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/54699815290-5cb6508dd2-o.jpg",
    "news_site": "NASA",
    "summary": "The Artemis II crew (from left to right) CSA (Canadian Space Agency) astronaut Jeremy Hansen, and NASA astronauts Christina Koch, Victor Glover, and Reid Wiseman don their Orion Crew Survival System Suits for a multi-day crew module training beginning July 31, 2025, at the agency’s Kennedy Space Center in Florida. Behind the crew, wearing clean room apparel, […]",
    "published_at": "2025-08-07T15:44:16Z",
    "updated_at": "2025-08-07T15:50:12.176735Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Artemis II crew will begin training on July 31, 2025, at the agency’s Kennedy Space Center in Florida. Testing included a suited crew test and crew equipment interface test. This series of tests marks the first time the crew entered their spacecraft that will take them around the Moon."
  },
  {
    "id": 32521,
    "title": "NASA’s Webb Finds New Evidence for Planet Around Closest Solar Twin",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/webb/nasas-webb-finds-new-evidence-for-planet-around-closest-solar-twin/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/webb-STScI-01K0FMETMS0VXZ8BNRCB205DKK-5K.tif",
    "news_site": "NASA",
    "summary": "Astronomers using NASA’s James Webb Space Telescope have found strong evidence of a giant planet orbiting a star in the stellar system closest to our own Sun. At just 4 light-years away from Earth, the Alpha Centauri triple star system has long been a compelling target in the search for worlds beyond our solar system. […]",
    "published_at": "2025-08-07T15:00:00Z",
    "updated_at": "2025-08-07T15:10:11.503730Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronomers using NASA’s James Webb Space Telescope have found strong evidence of a giant planet orbiting a star in the stellar system closest to our own Sun. At just 4 light-years away from Earth, the Alpha Centauri triple star system has long been a compelling target in the search for worlds beyond our solar system. If confirmed, the potential planet seen in the Webb image of Alpha Centauri A would mark a new milestone for exoplanet imaging efforts. The James Webb Space Telescope is the world’s premier space science observatory. Webb is solving mysteries in our solar system, looking beyond to distant worlds around other stars."
  },
  {
    "id": 32522,
    "title": "Webb finds new hints for planet around closest solar twin",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_finds_new_hints_for_planet_around_closest_solar_twin",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/artist_s_concept_of_alpha_centauri_a_and_planet/26828665-1-eng-GB/Artist_s_concept_of_Alpha_Centauri_A_and_planet_card_full.jpg",
    "news_site": "ESA",
    "summary": "Astronomers using the NASA/ESA/CSA James Webb Space Telescope have found strong evidence of a giant planet orbiting a star in the stellar system closest to our own Sun. At just 4 light-years away from Earth, the Alpha Centauri triple star system has long been a compelling target in the search for worlds beyond our solar system.",
    "published_at": "2025-08-07T15:00:00Z",
    "updated_at": "2025-08-07T15:10:19.225913Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronomers using the NASA/ESA/CSA James Webb Space Telescope have found strong evidence of a giant planet orbiting a star in the stellar system closest to our own Sun. If confirmed, the planet would be the closest to Earth that orbits in the habitable zone of a Sun-like star. Because the planet candidate is a gas giant, scientists say it would not support life as we know it. Researchers say it could be a gas giant approximately the mass of Saturn orbiting Alpha Centauri A. In half of the possible orbits simulated, the planet moved too close to the star. If confirmed by additional observations, the team’s results could transform the future of exoplanet science."
  },
  {
    "id": 32520,
    "title": "Three NASA Langley Employees Win Prestigious Silver Snoopy Awards",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/langley/three-nasa-langley-employees-win-prestigious-silver-snoopy-awards/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/tracy-dyson-honorees.jpg",
    "news_site": "NASA",
    "summary": "Three employees from NASA’s Langley Research Center in Hampton, Virginia recently earned the Silver Snoopy award, a prestigious honor given to NASA employees and contractors across the agency for exceptional achievements related to spaceflight safety or mission success. Christopher Broadaway, Jeremy Shidner, and Sara Wilson received the awards during a ceremony held at the center […]",
    "published_at": "2025-08-07T14:22:40Z",
    "updated_at": "2025-08-07T14:30:11.741275Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Three employees from NASA’s Langley Research Center in Hampton, Virginia recently earned the Silver Snoopy award. Christopher Broadaway, Jeremy Shidner, and Sara Wilson received the awards during a ceremony held at the center on July 22. The award is one of several overseen by the Space Flight Awareness (SFA) Program at NASA."
  },
  {
    "id": 32518,
    "title": "As NASA Missions Study Interstellar Comet, Hubble Makes Size Estimate",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/as-nasa-missions-study-interstellar-comet-hubble-makes-size-estimate/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/releases/2025/08/STScI-01K1X6XDR76ZD4FYJ9VTWN1ERB.tif",
    "news_site": "NASA",
    "summary": "A team of astronomers has taken the sharpest-ever picture of the unexpected interstellar comet 3I/ATLAS using the crisp vision of NASA’s Hubble Space Telescope. Hubble is one of many missions across NASA’s fleet of space telescopes slated to observe this comet, together providing more information about its size and physical properties. While the comet poses […]",
    "published_at": "2025-08-07T14:00:19Z",
    "updated_at": "2025-08-07T14:10:16.373989Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronomers have taken the sharpest-ever picture of the unexpected interstellar comet 3I/ATLAS. Hubble's observations allow astronomers to more accurately estimate the size of the comet’s solid, icy nucleus. The comet is traveling through our solar system at a staggering 130,000 miles (209,000 kilometers) per hour.  Hubble captured this image of the interstellar comet 3I/ATLAS on July 21, 2025, when the comet was 277 million miles from Earth. Hubble shows that the comet has a teardrop-shaped cocoon of dust coming off its solid, icy nucleus. Since its 1990 launch, the Hubble Space Telescope has changed our fundamental understanding of the universe."
  },
  {
    "id": 32516,
    "title": "Wade Sisler: A Wonder Aficionado in Service of the Cosmos",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/people-of-nasa/wade-sisler-a-wonder-aficionado-in-service-of-the-cosmos/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/07/wade-sisler-webb.jpg",
    "news_site": "NASA",
    "summary": "Executive Producer — Goddard Space Flight Center Across 42 years at NASA, Wade Sisler — executive producer at NASA’s Goddard Space Flight Center in Greenbelt, Maryland—watched the edge of human knowledge progress. During that time, the tools for visualizing and communicating those discoveries evolved just as rapidly. “I’ve spent my career surrounded by people with […]",
    "published_at": "2025-08-07T12:00:00Z",
    "updated_at": "2025-08-07T12:00:13.194763Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Wade Sisler worked as a student photographer at NASA’s Ames Research Center. He transitioned to videography when he realized the wonder and understanding the medium could convey. In the 1980s and ’90s, he worked on a wide range of projects, translating complex research into short documentaries. Wade Sisler is the former coordinator of NASA Goddard’s Office of Communications. He helped create the El Niño visualization, which helped drive public understanding of the phenomenon. He also helped launch a NASA Goddard program to link scientific experts with news stations around the world. His proudest accomplishment is the success of the internship program he led. He developed a communication “boot camp’ to help interns develop their storytelling chops. “The best, most powerful thing I think I’ve done in my time at NASA is to help guide the next wave of science communicators. Seeing their success is the gift that keeps on giving”"
  },
  {
    "id": 32515,
    "title": "ESA Astronaut Raphaël Liégeois",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/ESA_Astronaut_Raphael_Liegeois",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/esa_astronaut_raphael_liegeois/26829623-1-eng-GB/ESA_Astronaut_Raphael_Liegeois_card_full.png",
    "news_site": "ESA",
    "summary": "ESA astronaut Raphaël Liégeois from Belgium, a member of the ESA Astronaut Class of 2022, was selected in November 2022 from over 22,500 candidates who applied to ESA’s 2021 call for new astronauts.",
    "published_at": "2025-08-07T09:30:00Z",
    "updated_at": "2025-08-07T09:20:17.805512Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "In April 2024 erhielt Raphaël gemeinsam mit seinen Kolleginnen und Kollegen Sophie Adenot, Rosemary Coogan, Pablo Álvarez Fernández and Marco Sieber am EAC sein Astronautenzertifikat – ein offizieller Schritt zum vollwertigen Astronauten. Nach Abschluss seines Pre-Assignment-Trainings befindet er sich nun in der missionsspezifischen Vorbereitung."
  },
  {
    "id": 32513,
    "title": "Crew-10 poised for return to Earth after months at ISS",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/crew-10-return/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/IMG_0176.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "Crew Dragon C210 Endurance and the Crew-10 astronauts are preparing to return to Earth following…\r\nThe post Crew-10 poised for return to Earth after months at ISS appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-07T02:22:20Z",
    "updated_at": "2025-08-07T07:39:45.430884Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "fb39ac94-5e74-4ee9-afc5-df19c4132b28",
        "provider": "Launch Library 2"
      }
    ],
    "events": [
      {
        "event_id": 1212,
        "provider": "Launch Library 2"
      },
      {
        "event_id": 1227,
        "provider": "Launch Library 2"
      },
      {
        "event_id": 1225,
        "provider": "Launch Library 2"
      }
    ],
    "detailed_news": "Crew Dragon C210 Endurance and the Crew-10 astronauts are preparing to return to Earth following over 140 days in orbit aboard the International Space Station. The mission, commanded by NASA astronaut Anne McClain, undocked from the Station on Friday, Aug. 8, at 22:15 UTC before its scheduled splashdown off the west coast of the United States the next day. Crew-11’s Zena Cardman, Michael Fincke, Kimiya Yui, and Oleg Platonov are taking over in place of McClain. The Japanese human presence on ISS will end, at least for the moment, when JAXA's Yui leaves the Station after a handover to Crew-12. SpaceX will have the recovery ship Shannon on site to retrieve Endurance and its crew. Endurance’s exact splashdown site will be off of either Oceanside, San Diego, or Long Beach, depending on exact conditions at the time of landing. Crew-10 is Endurance's fourth flight, following Crew-3, Crew-5, and Crew-7. Endurance will also take home critical science samples aboard the Polar portable cold storage facility."
  },
  {
    "id": 32512,
    "title": "Live coverage: SpaceX to launch 24 Amazon Project Kuiper satellites on Falcon 9 rocket from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/06/live-coverage-spacex-to-launch-24-amazon-project-kuiper-satellites-on-falcon-9-rocket-from-cape-canaveral/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250806_KF-02_rollout.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The mission, dubbed KF-02, is the fourth flight to date of Project Kuiper satellites. Liftoff from pad 40 at Cape Canaveral Space Force Station is scheduled for 10:01 a.m. EDT (1401 UTC).",
    "published_at": "2025-08-06T21:53:14Z",
    "updated_at": "2025-08-07T07:39:30.213611Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "594ae0c5-2039-4a1a-a6be-7b0940b2ed2c",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Amazon is back at the launch pad once again with more of its Project Kuiper broadband internet satellites. The tech giant is getting a lift to space on a SpaceX Falcon 9 rocket set to launch from Cape Canaveral Space Force Station. SpaceX first scrubbed a Thursday mission prior to the start of fueling and said on social media that it did so to allow time for “additional vehicle checkouts” ULA said its goal is to ramp up to a cadence of two launches per month between its Vulcan and Atlas rockets by the end of 2025. Amazon also has dozens of flights booked between Blue Origin, billionaire Jeff Bezos’ other major venture, and Arianespace. It remains uncertain as to when those companies may start launching missions for the tech giant."
  },
  {
    "id": 32511,
    "title": "NASA to Provide Live Coverage of Crew-10 Return, Splashdown",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-to-provide-live-coverage-of-crew-10-return-splashdown/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/crew-10-members-group-portrait.jpg",
    "news_site": "NASA",
    "summary": "NASA and SpaceX are targeting no earlier than 12:05 p.m. EDT, Thursday, Aug. 7, for the undocking of the agency’s SpaceX Crew-10 mission from the International Space Station. Pending weather conditions, splashdown is targeted at 11:58 a.m., Friday, Aug. 8. Crew-10 will be the first mission to splash down off the California coast for NASA’s […]",
    "published_at": "2025-08-06T21:39:57Z",
    "updated_at": "2025-08-07T07:38:58.729721Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "fb39ac94-5e74-4ee9-afc5-df19c4132b28",
        "provider": "Launch Library 2"
      }
    ],
    "events": [
      {
        "event_id": 1212,
        "provider": "Launch Library 2"
      },
      {
        "event_id": 1227,
        "provider": "Launch Library 2"
      },
      {
        "event_id": 1225,
        "provider": "Launch Library 2"
      }
    ],
    "detailed_news": "NASA and SpaceX are targeting no earlier than 6:05 p.m. EDT, Friday, Aug. 8, for the undocking of the agency’s SpaceX Crew-10 mission from the International Space Station. Pending weather conditions, splashdown is targeted at 11:33 a.m., Saturday, August. 9. NASA will distribute audio-only discussions between Crew- 10, the space station, and flight controllers during the transit away from the orbital complex."
  },
  {
    "id": 32514,
    "title": "Curiosity Blog, Sols 4622-4623: Kicking Off (Earth) Year 14 With an Investigation of Veins",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4622-4623-kicking-off-earth-year-14-with-an-investigation-of-veins/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04621_opgs_edr_ncam_NLB_807729449EDR_F1180372NCAM00282M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Abigail Fraeman, Deputy Project Scientist at NASA’s Jet Propulsion Laboratory Earth planning date: Wednesday, Aug. 6, 2025. Today was a very special day for Curiosity as the rover celebrated the start of a 14th year on Mars. Curiosity is currently exploring the mysterious boxwork formations. On Monday, the rover positioned itself at the […]",
    "published_at": "2025-08-06T21:01:00Z",
    "updated_at": "2025-08-07T09:10:10.328645Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Curiosity is currently exploring the mysterious boxwork formations on Mars. On Monday, the rover positioned itself at the side of one of the ridges. The team had spotted tantalizing hints of a complex network of razor-thin veins that may give insight into what is holding these ridges up."
  },
  {
    "id": 32510,
    "title": "Snapshot Wisconsin Celebrates 10 Years and 100 Million Photos Collected!",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/earth-science-division/snapshot-wisconsin-celebrates-10-years-and-100-million-photos-collected/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/citizen-science/highlights/2025/snapshot-wisconsin-deer.jpg",
    "news_site": "NASA",
    "summary": "The Snapshot Wisconsin project recently collected their 100 millionth trail camera photo! What’s more, this milestone coincides with the project’s 10-year anniversary. Congratulations to the team and everyone who’s participated!",
    "published_at": "2025-08-06T20:42:44Z",
    "updated_at": "2025-08-06T21:10:09.161374Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Snapshot Wisconsin recently collected their 100 millionth trail camera photo. This milestone coincides with the project’s 10-year anniversary. Snapshot Wisconsin was launched in 2013 with help from a NASA grant. You, too, can get involved by visiting the project's site on the Zooniverse crowdsourcing platform and helping classify their latest photo season."
  },
  {
    "id": 32509,
    "title": "As the end of the ISS nears, NASA shakes up program for commercial replacements",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/as-the-end-of-the-iss-nears-nasa-shakes-up-program-for-commercial-replacements/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/05/645af1f6b2f0b5dd845bf52e_VAST-Haven-1_Hero.jpg",
    "news_site": "Arstechnica",
    "summary": "\"Certain players are going to have to do a harder pivot.\"",
    "published_at": "2025-08-06T19:18:13Z",
    "updated_at": "2025-08-06T19:30:09.482523Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's new acting administrator has a new directive on commercial space stations. The agency has awarded about $500 million to four different companies to begin working on \"commercial\" stations. There are serious concerns about whether any of these replacement stations will be ready to go when the International Space Station falls into the drink. Vast's Haven-1 module is designed for four astronauts to spend two weeks in orbit. The company has a more straightforward pathway to building a station that would meet NASA's minimum requirements. The other companies had been planning larger stations that would have more permanence in orbit, which matched NASA's original desires."
  },
  {
    "id": 32507,
    "title": "NASA Supercomputers Take on Life Near Greenland’s Most Active Glacier",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/earth/nasa-supercomputers-take-on-life-near-greenlands-most-active-glacier/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/1-greenland-ecco.jpeg",
    "news_site": "NASA",
    "summary": "As Greenland’s ice retreats, it’s fueling tiny ocean organisms. To test why, scientists turned to a computer model out of JPL and MIT that’s been called a laboratory in itself. Runoff from Greenland’s ice sheet is kicking nutrients up from the ocean depths and boosting phytoplankton growth, a new NASA-supported study has found. Reporting in […]",
    "published_at": "2025-08-06T19:00:00Z",
    "updated_at": "2025-08-06T19:00:14.922930Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Runoff from Greenland’s ice sheet is kicking nutrients up from the ocean depths and boosting phytoplankton growth. During peak summer melt, more than 300,000 gallons of fresh water drain into the sea every second from beneath Jakobshavn Glacier. The meltwater plume is fresh and more buoyant than the surrounding saltwater. The team plans to extend their simulations to the whole Greenland coast and beyond. Some changes appear to be impacting the carbon cycle both positively and negatively. “We didn’t build these tools for one specific application. Our approach is applicable to any region, from the Texas Gulf to Alaska. Like a Swiss Army knife, we can apply it to lots of different scenarios”"
  },
  {
    "id": 32508,
    "title": "NASA’s Perseverance Rover Captures Mars Vista As Clear As Day",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/mars-2020-perseverance/perseverance-rover/nasas-perseverance-rover-captures-mars-vista-as-clear-as-day/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/1-pia26644-enhanced-web-16.jpg",
    "news_site": "NASA",
    "summary": "‘Float rocks,’ sand ripples, and vast distances are among the sights to see in the latest high-resolution panorama by the six-wheeled scientist. The imaging team of NASA’s Perseverance Mars rover took advantage of clear skies on the Red Planet to capture one of the sharpest panoramas of its mission so far. Visible in the mosaic, […]",
    "published_at": "2025-08-06T18:53:40Z",
    "updated_at": "2025-08-07T07:38:25.029609Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "c4db6995-f25f-4608-8eb9-ce95d5226af2",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "NASA’s Perseverance Mars rover took advantage of clear skies on the Red Planet to capture one of the sharpest panoramas of its mission so far. Visible in the mosaic are a rock that appears to lie on top of a sand ripple, a boundary line between two geologic units, and hills as distant as 40 miles (65 kilometers) away. Arizona State University leads the operations of the Mastcam-Z instrument, working in collaboration with Malin Space Science Systems in San Diego. For more about Perseverance: https://science.nasa.gov/mission/mars-2020-perseverance."
  },
  {
    "id": 32506,
    "title": "Duffy Approves Moving a Space Shuttle to Houston",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/duffy-approves-moving-a-space-shuttle-to-houston/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Discovery-at-NASM-209x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Acting NASA Administrator Sean Duffy has approved moving a space shuttle to Houston in accordance with language in the reconcilation act. NASA will only confirm that a decision was made, […]",
    "published_at": "2025-08-06T18:05:25Z",
    "updated_at": "2025-08-06T18:10:24.428825Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Acting NASA Administrator Sean Duffy has approved moving a space shuttle to Houston. NASA will only confirm that a decision was made, not what it is. Sen. John Cornyn (R-TX) introduced legislation to move Space Shuttle Discovery to Johnson Space Center. Discovery is currently at the Smithsonian’s National Air and Space Museum. Sen. Cruz is a co-sponsor of S. 1403. Rep. Randy Weber (R-TX) has an identical bill in the House. The two specially-built Shuttle Carrier Aircraft used to transport shuttle orbiters are decomissioned. A spokesperson for the National Air and Space Museum told SpacePolicyOnline.com today that they haven’t been contacted by NASA."
  },
  {
    "id": 32505,
    "title": "NASA Astronaut Barry “Butch” Wilmore Retires",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-astronaut-barry-butch-wilmore-retires/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/butch-wilmore.jpg",
    "news_site": "NASA",
    "summary": "After 25 years at NASA, flying in four different spacecraft, accumulating 464 days in space, astronaut and test pilot Butch Wilmore has retired from NASA. The Tennessee native earned a bachelor’s and a master’s degree in electrical engineering from Tennessee Technological University and a master’s degree in aviation systems from the University of Tennessee. Wilmoreis […]",
    "published_at": "2025-08-06T17:53:13Z",
    "updated_at": "2025-08-06T18:00:10.541561Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Butch Wilmore has retired after 25 years at NASA. He flew in four different spacecraft, accumulating 464 days in space. Wilmore completed three missions launching aboard the space shuttle Atlantis, Roscosmos Soyuz, and Boeing Starliner. He also conducted five spacewalks, totaling 32 hours outside the orbital laboratory."
  },
  {
    "id": 32504,
    "title": "Curiosity Looks Back Toward Its Landing Site",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/curiosity-looks-back-toward-its-landing-site/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/1-pia26632-curiositys-views-its-power-source-while-talking-to-an-orbiter-da5a52.png",
    "news_site": "NASA",
    "summary": "NASA’s Curiosity rover captured a view of its tracks on July 26, 2025. The robotic scientist is now exploring a region of lower Mount Sharp, a 3-mile-tall (5-kilometer-tall) mountain. The pale peak of the mountain can be seen at top right; the rim of Gale Crater, within which the mountain sits, is on the horizon […]",
    "published_at": "2025-08-06T16:15:45Z",
    "updated_at": "2025-08-07T07:35:57.559722Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "df8d4fdb-9add-4ce9-9f0e-aae1c61df212",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "NASA's Curiosity rover captured a view of its tracks on July 26, 2025. The rover is now exploring a region of lower Mount Sharp, a 3-mile-tall (5-kilometer-tall) mountain. Curiosity touched down on the crater floor 13 years ago."
  },
  {
    "id": 32503,
    "title": "Mississippi Attorney Serves NASA and the Nation",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/ms-attorney-nathan-jermyn-serves/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/s25-018-nathan-jermyn.jpg",
    "news_site": "NASA",
    "summary": "Before Nathan Jermyn could dig into the legal frameworks at NASA, he had to answer a different call. Jermyn participated in a one-day orientation in the summer of 2023 to begin work as an attorney-advisor supporting NASA’s Stennis Space Center and the NASA Shared Services Center near Bay St. Louis, Mississippi. However, the Biloxi, Mississippi, […]",
    "published_at": "2025-08-06T14:00:00Z",
    "updated_at": "2025-08-06T14:00:15.254326Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Nathan Jermyn is an attorney-advisor supporting NASA’s Stennis Space Center and the NASA Shared Services Center near Bay St. Louis, Mississippi. The decorated military veteran returned to NASA in January 2024 to fully immerse himself as a member of the contract and procurement practice group. “I wholeheartedly believe humanity is destined for the stars and NASA is in prime position to lead that charge,” he said."
  },
  {
    "id": 32502,
    "title": "DLR Completes Key Component for the Callisto Demonstrator’s Landing Legs",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/dlr-completes-key-component-for-the-callisto-demonstrators-landing-legs/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/DLR-Completes-Key-Component-for-the-Callisto-Demonstrators-Landing-Legs.webp",
    "news_site": "European Spaceflight",
    "summary": "The German aerospace agency DLR has completed the manufacturing of a key component of the thermal protection system for the landing legs of its Callisto reusable booster demonstrator. The Callisto project is a trilateral initiative between DLR, the French space agency CNES, and the Japanese space agency JAXA. The primary aim of the project is […]\nThe post DLR Completes Key Component for the Callisto Demonstrator’s Landing Legs appeared first on European Spaceflight.",
    "published_at": "2025-08-06T13:36:56Z",
    "updated_at": "2025-08-06T13:40:15.763445Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "German aerospace agency DLR has completed the manufacturing of a key component of the thermal protection system for its Callisto reusable booster demonstrator. The component measures 180 by 90 centimetres and is designed to reduce thermal stress on the landing legs during final approach and landing. An initial hop test flight of the completed Callistos booster is expected to lift off from the Guiana Space Centre in 2026."
  },
  {
    "id": 32500,
    "title": "Impulse Space unveils upgraded Mira spacecraft, expanding capabilities beyond LEO",
    "authors": [
      {
        "name": "Ryan Caton",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/impulse-upgraded-mira-spacecraft-expanding-capabilities/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-06-04-30-40-880.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Impulse Space, the aerospace firm founded by Tom Mueller—the engineering mastermind behind SpaceX’s Merlin and…\nThe post Impulse Space unveils upgraded Mira spacecraft, expanding capabilities beyond LEO appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-06T13:00:42Z",
    "updated_at": "2025-08-06T13:10:24.120250Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Impulse Space has announced significant upgrades to its Mira spacecraft. Mira serves as an orbital workhorse, akin to a tow truck or delivery van in space. Designed to transport payloads like satellites or scientific experiments between orbits, it also enables in-space services such as repositioning, refueling, or debris removal. Impulse Space is gearing up for LEO Express-3 later this year, incorporating these upgrades. Mira can now achieve 900 meters per second of velocity change, dramatically expanding its reach. Impulse’s upcoming Helios kickstage will complement Mira as a “long-haul” tug."
  },
  {
    "id": 32501,
    "title": "Watch: MetOp-SG-A1 and Sentinel-5 launch",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Meteorological_missions/MetOp_Second_Generation/Watch_MetOp-SG-A1_and_Sentinel-5_launch",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/07/metop_second_generation_a-type_satellite/26807625-1-eng-GB/MetOp_Second_Generation_A-type_satellite_card_full.jpg",
    "news_site": "ESA",
    "summary": "Europe’s first MetOp Second Generation, MetOp-SG-A1, weather satellite – which hosts Copernicus Sentinel-5 as part of its instrument package – is set for liftoff on an Ariane 6 rocket from Europe’s Spaceport in Kourou, French Guiana, on 13 August 2025 at 02:37 CEST (12 August 21:37 Kourou time).",
    "published_at": "2025-08-06T12:54:00Z",
    "updated_at": "2025-08-06T13:21:44.390589Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "1b9bed2f-7e00-4d95-b5d1-7b71c36a4ab1",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Europe's first MetOp Second Generation, MetOp-SG-A1, weather satellite is set for liftoff on an Ariane 6 rocket from Europe’s Spaceport in Kourou, French Guiana, on 13 August 2025. Watch live on ESA Web TV One . Follow the launch live on Wednesday 13 August 2025 (all times in CEST) Ariane 6 is Europe's heavy launcher and a key element of ESA's efforts to ensure autonomous access to space for Europe’s citizens. Its modular and versatile design allows it to launch all missions from low-Earth orbit into deep space. Standing over 60 metres tall, Ariane 6 can weigh almost 900 tonnes when launched with a full payload."
  },
  {
    "id": 32499,
    "title": "First asteroid sightings push Hera’s camera to the limit",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Space_Safety/Hera/First_asteroid_sightings_push_Hera_s_camera_to_the_limit",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/asteroid_18805_kellyday/26825840-1-eng-GB/Asteroid_18805_Kellyday_card_full.gif",
    "news_site": "ESA",
    "summary": "ESA’s Hera mission has captured images of asteroids (1126) Otero and (18805) Kellyday. Though distant and faint, the early observations serve as both a successful instrument test and a demonstration of agile spacecraft operations that could prove useful for planetary defence.",
    "published_at": "2025-08-06T12:00:00Z",
    "updated_at": "2025-08-06T13:03:54.732926Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "e1ffdd01-c146-44d0-a250-b845dc2eb20d",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "ESA’s Hera mission has captured images of asteroids (1126) Otero and (18805) Kellyday. Though distant and faint, the early observations serve as both a successful instrument test and a demonstration of agile spacecraft operations. Hera is currently travelling through space on its way to a binary asteroid system. The object, named 3I/ATLAS , will pass close to Mars later this year. The scientific community is currently assessing whether any spacecraft at the Red Planet may be able to observe it at the time. “By demonstrating that we can safely and efficiently command Hera to observe a new target on short notice, we are building confidence for the mission’s science phase,\" says Moresco."
  },
  {
    "id": 32498,
    "title": "When martian ground falls apart",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Mars_Express/When_martian_ground_falls_apart",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/mars_express_views_acheron_fossae_s_western_fringes/26827568-1-eng-GB/Mars_Express_views_Acheron_Fossae_s_western_fringes_card_full.jpg",
    "news_site": "ESA",
    "summary": "In its latest postcard from Mars, the European Space Agency’s Mars Express returns to Acheron Fossae: a dramatic network of chasms carved into the surface of the Red Planet.",
    "published_at": "2025-08-06T09:00:00Z",
    "updated_at": "2025-08-06T09:10:20.350958Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "In April we highlighted the eastern end of the Acheron Fossae region of Mars – an amazingly diverse mix of rugged and smooth terrain covered in ancient ditches, craters, and solidified lava. Today we head back to show the region’s western edge, where the features are equally diverse: deep cracks, valleys, and meandering channels sculpted and filled by slow-moving flows of ice and rock. The Mars Express High Resolution Stereo Camera was developed and is operated by the German Aerospace Center. The systematic processing of the camera data took place at the DLR Institute of Planetary Research in Berlin-Adlershof. The working group of Planetary Science and Remote Sensing at Freie Universität Berlin used the data to create the image products shown here."
  }
]