[
  {
    "id": 33283,
    "title": "Hubble Captures Puzzling Galaxy",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-captures-puzzling-galaxy/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/spiral/Hubble_NGC2775_potw2538a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image features a galaxy that’s hard to categorize. The galaxy in question is NGC 2775, which lies 67 million light-years away in the constellation Cancer (the Crab). NGC 2775 sports a smooth, featureless center that is devoid of gas, resembling an elliptical galaxy. It also has a dusty ring with […]",
    "published_at": "2025-09-26T11:00:00Z",
    "updated_at": "2025-09-26T11:46:29.214250Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "9d2a03ff-1fb2-4519-bcdb-ba9f84e61d3d",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33284,
    "title": "Redefining space diplomacy for the 21st century: from orbits to outcomes",
    "authors": [
      {
        "name": "Elif Yüksel",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/redefining-space-diplomacy-for-the-21st-century-from-orbits-to-outcomes/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/health-wagon.webp?fit=1024%2C538&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nWhile the world tracks the diplomatic rivalry between the United States-led Artemis Accords (which, with Senegal’s recent signing, is now at 56 member nations) and the China-led International Lunar Research Station partnership, at risk of being overshadowed is the international diplomatic and humanitarian work that’s already happening, enabled by the space community, thanks to state […]\nThe post Redefining space diplomacy for the 21st century: from orbits to outcomes appeared first on SpaceNews.",
    "published_at": "2025-09-26T11:00:00Z",
    "updated_at": "2025-09-26T11:10:24.726187Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33281,
    "title": "ESA shares stage with international partners at IAC 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Exhibitions/ESA_shares_stage_with_international_partners_at_IAC_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/the_international_convention_centre_in_sydney_australia/26887001-1-eng-GB/The_International_Convention_Centre_in_Sydney_Australia_card_full.jpg",
    "news_site": "ESA",
    "summary": "The European Space Agency (ESA) is participating in the 76th International Astronautical Congress (IAC), which will open its doors on Monday 29 September and last until Friday 3 October in Sydney, Australia. Over 8000 participants from 90 countries are expected to attend the event at the at the International Convention Centre (ICC) under the theme “Sustainable Space: Resilient Earth”.",
    "published_at": "2025-09-26T09:00:00Z",
    "updated_at": "2025-09-26T09:40:13.265628Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33280,
    "title": "Earth from Space: Northeast Greenland National Park",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/Earth_from_Space_Northeast_Greenland_National_Park",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/earth_from_space_northeast_greenland_national_park/26886182-1-eng-GB/Earth_from_Space_Northeast_Greenland_National_Park_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-26T08:00:00Z",
    "updated_at": "2025-09-26T08:20:13.784405Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33279,
    "title": "NASA’s contract overhaul puts Dream Chaser’s ISS future in jeopardy",
    "authors": [
      {
        "name": "Ryan Caton and Chris Bergin",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/nasas-contract-overhaul-dream-chasers-jeopardy/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/NSF-2025-09-26-04-15-29-579.jpg",
    "news_site": "NASASpaceflight",
    "summary": "NASA has announced significant modifications to its contract with Sierra Space for the Dream Chaser…\nThe post NASA’s contract overhaul puts Dream Chaser’s ISS future in jeopardy appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-26T03:23:48Z",
    "updated_at": "2025-09-26T03:30:15.076127Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA has announced significant modifications to its contract with Sierra Space for the Dream Chaser spacecraft. This development raises serious questions about whether the long-awaited ‘baby shuttle’ will ever fulfill its original promise of delivering cargo to the orbiting laboratory. The Dream Chaser, a winged reusable spacecraft designed for atmospheric reentry and runway landings, has been plagued by delays. Sierra Space's Dream Chaser spacecraft has been in development since the 1990s. The first flight-ready vehicle, DC-101 Tenacity, arrived at Kennedy Space Center in May 2024 for final pre-launch preparations. With the ISS scheduled for deorbiting in 2031, the window for completing seven missions was already narrowing. Sierra Space is working with NASA on a demo of the Dream Chaser spacecraft. The shuttle-like craft could be used for resupply missions to the ISS. Sierra Space is also contributing hardware to Orbital Reef, a project led by Blue Origin. The company hopes the demo will get Dream Chaser off the ground."
  },
  {
    "id": 33278,
    "title": "Dream Chaser Slips to End of 2026 for Free-Flyer Demo Only",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/dream-chaser-slips-to-end-of-2026-for-free-flyer-demo-only/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2023/05/Dream-Chaser-Armstrong-Nov-11-2017-NASA-300x200.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "NASA said today they are requiring Sierra Space to conduct a free flyer demonstration of the Dream Chaser spacecraft before the first cargo mission to the International Space Station. The […]",
    "published_at": "2025-09-26T00:58:49Z",
    "updated_at": "2025-09-26T01:00:22.514440Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Dream Chaser has yet to make a spaceflight after more than a decade of development and the demonstration flight is not even expected until the end of 2026. The contractual requirement that NASA buy seven cargo flights is also eliminated. Sierra Space called the changes a “strategic transition.” Sierra Space called it a “strategic transition” as they seek “to preserve the exceptional potential of Dream Chaser as a national asset” They added the changes aim ‘to provide Sierra Space with flexibility to address the nation’s most pressing National Security Space challenges’"
  },
  {
    "id": 33277,
    "title": "NASA modifies Dream Chaser ISS cargo contract as Sierra Space shifts to defense work",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-modifies-dream-chaser-iss-cargo-contract-as-sierra-space-shifts-to-defense-work/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/dreamchaser-sept25.jpeg?fit=1024%2C585&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSierra Space and NASA have sharply revised a contract to use the company’s Dream Chaser vehicle to deliver cargo to the ISS as the company pivots to defense applications.\nThe post NASA modifies Dream Chaser ISS cargo contract as Sierra Space shifts to defense work appeared first on SpaceNews.",
    "published_at": "2025-09-26T00:09:32Z",
    "updated_at": "2025-09-26T00:10:35.511511Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Sierra Space will fly a single \"free flight demonstration\" mission, scheduled for late 2026. The contract no longer specifies a set number of cargo missions to the station. The company has recently emphasized defense work, including satellites for the Space Development Agency. Sierra Space was one of three companies that won contracts in 2016 to deliver cargo to the ISS. NASA has obligated $1.43 billion to Sierra Space under CRS-2 to date. That compares to $3.21 billion for Northrop Grumman and $ 3.37 billion for SpaceX. A NASA spokesperson declined to disclose the current value of Sierra Space’s contract."
  },
  {
    "id": 33276,
    "title": "Sierra’s Dream Chaser is starting to resemble a nightmare",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/sierras-dream-chaser-is-starting-to-resemble-a-nightmare/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/dcart1.jpeg",
    "news_site": "Arstechnica",
    "summary": "\"Development of new space transportation systems is difficult.\"",
    "published_at": "2025-09-25T22:00:43Z",
    "updated_at": "2025-09-25T22:10:05.800258Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Dream Chaser spaceplane has been under development for two decades. On Thursday, NASA said the first flight of the winged spacecraft will no longer berth with the International Space Station. Rather, the space agency said, the Dream Chaser program would be \"best served\" by a free flight demonstration. Ars is a trusted source in a sea of information. You don’t need to know everything, only what’s important. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, we can help you understand the world around you."
  },
  {
    "id": 33275,
    "title": "NASA Flights Study Cosmic Ray Effects for Air, Future Space Travelers",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/langley/nasa-flights-study-cosmic-ray-effects-for-air-future-space-travelers/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/img-3900.jpg",
    "news_site": "NASA",
    "summary": "Recent airborne science flights to Greenland are improving NASA’s understanding of space weather by measuring radiation exposure to air travelers and validating global radiation maps used in flight path planning. This unique data also has value beyond the Earth as a celestial roadmap for using the same instrumentation to monitor radiation levels for travelers entering […]",
    "published_at": "2025-09-25T21:34:55Z",
    "updated_at": "2025-09-25T21:40:06.577500Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33274,
    "title": "Live coverage: SpaceX to launch 24 Starlink satellites on Falcon 9 rocket from Vandenberg",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/25/live-coverage-spacex-to-launch-24-starlink-satellites-on-falcon-9-rocket-from-vandenberg-2/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/04/20250401_Starlink_G9_10_Vertical_Sunset.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 17-11 mission includes the 475th launch of a flight-proven booster. SpaceX is targeting liftoff from pad 4E at Vandenberg Space Force Base at 9:17 p.m. PDT (12:17 a.m. EDT / 0417 UTC). ",
    "published_at": "2025-09-25T20:52:39Z",
    "updated_at": "2025-09-25T21:00:32.690820Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing to launch its third Falcon 9 rocket in less than 41 hours. On deck is the flight of the Starlink 17-11 mission, which will take off from Vandenberg Space Force Base. The rocket will deploy 24 of SpaceX’s Starlink V2 Mini broadband internet satellites into low Earth orbit."
  },
  {
    "id": 33273,
    "title": "SpaceX, Blue Origin, Stoke, and others make major progress on Cape launch facilities",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/ksc-flyover-091925/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/AB7C64E3-1FE2-4D03-B2A1-4C18C8C08DC6.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "The two spaceport launch facilities in the Cape Canaveral area — NASA’s Kennedy Space Center…\nThe post SpaceX, Blue Origin, Stoke, and others make major progress on Cape launch facilities appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-25T20:08:30Z",
    "updated_at": "2025-09-25T20:10:13.652508Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The two spaceport launch facilities in the Cape Canaveral area are on the verge of even bigger changes than have been seen in the last few years. SpaceX is making significant progress on its Starship program facilities. Blue Origin is showing signs of progress toward launching its second New Glenn rocket. Stoke Space, based in the Pacific Northwest, and Relativity, headquartered in Long Beach, California, plan to join SpaceX and Blue Origin in the spaceflight market with their own reusability-enabled launch vehicles. SpaceX NSF’s flyover imagery shows Starship-related progress underway at multiple sites. The Roberts Road facility is where pad items, both large and small, are fabricated or delivered. Five Starship tower segments were spotted at Roberts Road, with four of them completed, a fifth nearing completion, and work started on a sixth. SpaceX continues to make progress on the massive Giga Bay, which will be about half the size of NASA’s Vehicle Assembly Building (VAB) Workers have poured a large amount of concrete and are installing four tower cranes in what will be the transfer aisles. SpaceX is also busy with changes to its existing Falcon 9 launch pad at SLC-40. Blue Origin Exploration Park is undergoing continued work and expansion. New Glenn Transporter was seen moving past the VAB on Sept. 21, which could indicate a possible rollout of New Glenn Flight 2’s Glenn Stage 1 first stage as soon as Oct. 5. Workers have conducted launch checkouts at LC-36 with the New Glenn Simulator in the meantime. Blue Origin also recently assembled and tested a large deployable sunshield at Lunar Plant 1, which will protect both Lunar Transporter and the Blue Moon Mk2 crewed lunar lander. NSF also showed progress on the NASA Artemis program’s ML2 parked by the VAB. The ML2 will not be used for the next two Artemis missions but will be needed for Artemis IV and subsequent missions, if these missions are flown. The SLS rocket for Artemis II is almost completely stacked with validation and checkouts complete, but still requires stacking of the Orion spacecraft and its launch abort system tower."
  },
  {
    "id": 33272,
    "title": "Artemis 2 could launch as soon as February",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/artemis-2-could-launch-as-soon-as-february/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/07/jsc2025e016291large.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA’s Artemis 2 mission around the moon could launch as soon as early February, as both agency officials and the mission’s four-person crew say they are ready for the flight.\nThe post Artemis 2 could launch as soon as February appeared first on SpaceNews.",
    "published_at": "2025-09-25T19:09:11Z",
    "updated_at": "2025-09-25T19:10:19.208711Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's Artemis 2 mission around the moon could launch as soon as early February. Officials reaffirmed the current schedule, which calls for a launch no later than April 2026. Artemis 2 will be a roughly 10-day mission, beginning with a day in an elliptical Earth orbit. Four American and Canadian astronauts flying on Artemis 2 say they are ready for the mission. “There is no frustration in what we would perceive, from the outside looking in, as delays,” mission commander Reid Wiseman said. The crew also announced the Orion spacecraft’s name: Integrity."
  },
  {
    "id": 33271,
    "title": "L3Harris looks to scale production of hybrid satcom radios after successful Air Force tests",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/l3harris-looks-to-scale-production-of-hybrid-satcom-radios-after-successful-air-force-tests/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Gy0Ut7RXYAAkHFp.jpeg?fit=1024%2C536&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nUnder a partnership with Amazon’s Kuiper, L3Harris would bring the broadband service to military users\nThe post L3Harris looks to scale production of hybrid satcom radios after successful Air Force tests appeared first on SpaceNews.",
    "published_at": "2025-09-25T18:54:09Z",
    "updated_at": "2025-09-25T19:00:42.703269Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "L3Harris says it has successfully demonstrated a satellite-based radio system. The system allows military aircraft to tap commercial space broadband services. The radios are in limited use with a handful of military customers. L3Harris is working with Amazon’s Project Kuiper, which is building a broadband constellation. Enter the code we sent to your email. Use the magic link in the email to sign in. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent toyour email."
  },
  {
    "id": 33270,
    "title": "NASA Opens 2026 Human Lander Challenge for Life Support Systems, More",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/esdmd/artemis-campaign-development-division/human-landing-system-program/human-lander-challenge/nasa-opens-2026-human-lander-challenge-for-life-support-systems-more/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/2026-hulc-graphic-banner-image.png",
    "news_site": "NASA",
    "summary": "NASA’s 2026 Human Lander Challenge is seeking ideas from college and university students to help evolve and transform technologies for life support and environmental control systems. These systems are critical for sustainable, long-duration human spaceflight missions to the Moon, Mars, and beyond. The Human Lander Challenge supports NASA’s efforts to foster innovative solutions to a […]",
    "published_at": "2025-09-25T18:00:18Z",
    "updated_at": "2025-09-25T18:10:09.085726Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33269,
    "title": "NASA, Sierra Space Modify Commercial Resupply Services Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/nasa-sierra-space-modify-commercial-resupply-services-contract/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/20240131-207a0543.png",
    "news_site": "NASA",
    "summary": "In 2016, NASA awarded a Commercial Resupply Services-2 contract to Sierra Space, formerly part of Sierra Nevada Corporation, to resupply the International Space Station with its Dream Chaser spaceplane and companion Shooting Star cargo module. As part of its contract, Sierra Space was awarded a minimum seven flights, and the agency previously issued firm-fixed price task orders for […]",
    "published_at": "2025-09-25T18:00:03Z",
    "updated_at": "2025-09-25T18:00:07.610921Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33268,
    "title": "3-in-1 Launch",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/3-in-1-launch/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/ksc-20250924-ph-kls01-0018orig.jpg",
    "news_site": "NASA",
    "summary": "A SpaceX Falcon 9 rocket lifts off from NASA’s Kennedy Space Center in Florida on Sept. 24, 2025, carrying three missions that will investigate the Sun’s influence across the solar system. NASA’s IMAP (Interstellar Mapping and Acceleration Probe), the agency’s Carruthers Geocorona Observatory, and National Oceanic and Atmospheric Administration’s (NOAA) Space Weather Follow On–Lagrange 1 (SWFO-L1) […]",
    "published_at": "2025-09-25T17:37:39Z",
    "updated_at": "2025-09-25T17:40:13.279633Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33267,
    "title": "NASA-ISRO Satellite Sends First Radar Images of Earth’s Surface",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-isro-satellite-sends-first-radar-images-of-earths-surface/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/nisar-lead-image-sept-25-.jpg",
    "news_site": "NASA",
    "summary": "The NISAR (NASA-ISRO Synthetic Aperture Radar) Earth-observing radar satellite’s first images of our planet’s surface are in, and they offer a glimpse of things to come as the joint mission between NASA and ISRO (Indian Space Research Organisation) approaches full science operations later this year. “Launched under President Trump in conjunction with India, NISAR’s first […]",
    "published_at": "2025-09-25T17:22:02Z",
    "updated_at": "2025-09-25T17:30:12.159365Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33266,
    "title": "NASA & STEM Learning Ecosystems: Opportunities & Benefits for Everyone",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/learning-resources/for-professionals/nasa-stem-learning-ecosystems-opportunities-benefits-for-everyone/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/3_STEM_Eco_mtg_networking-Rae_Ostman.jpg",
    "news_site": "NASA",
    "summary": "STEM learning ecosystems are intentionally designed, community-wide partnerships that enable all Americans to actively participate in science, technology, engineering, and math (STEM) throughout their lifetimes. Lifelong STEM learning helps people build critical knowledge and skills, access economic opportunities, drive innovation, and make informed decisions in a changing world. STEM learning ecosystems draw on expertise and […]",
    "published_at": "2025-09-25T16:36:36Z",
    "updated_at": "2025-09-25T17:10:06.422602Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33265,
    "title": "NASA Astronaut Chris Williams to Discuss Upcoming Launch, Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-astronaut-chris-williams-to-discuss-upcoming-launch-mission/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/chris-williams-portrait.jpg",
    "news_site": "NASA",
    "summary": "NASA will host a news conference at 2 p.m. EDT Wednesday, Oct. 1, from the agency’s Johnson Space Center in Houston to highlight the upcoming mission of astronaut Chris Williams to the International Space Station. The news conference will stream live on NASA’s website and YouTube channel. Learn how to watch NASA content through a […]",
    "published_at": "2025-09-25T16:07:08Z",
    "updated_at": "2025-09-25T16:10:14.942204Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33264,
    "title": "R-Space Selects Isar Aerospace to Launch First Two GreenBox Satellites",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/r-space-selects-isar-aerospace-to-launch-first-two-greenbox-satellites/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/R-Space-Selects-Isar-Aerospace-to-Launch-First-Two-GreenBox-Satellites.webp",
    "news_site": "European Spaceflight",
    "summary": "Isar Aerospace has signed a launch contract with R-Space to carry the company’s first two GreenBox satellites into orbit aboard the German rocket builder’s two-stage Spectrum rocket. R-Space was founded in 2021 to provide an all-in-one solution for in-orbit demonstration and validation. Its GreenBox service lets customers integrate their technology into a standardised, box-shaped payload […]\nThe post R-Space Selects Isar Aerospace to Launch First Two GreenBox Satellites appeared first on European Spaceflight.",
    "published_at": "2025-09-25T15:17:09Z",
    "updated_at": "2025-09-25T15:20:13.281325Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33263,
    "title": "NASA awards Katalyst Space contract to reboost Swift spacecraft",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-awards-katalyst-space-contract-to-reboost-swift-spacecraft/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/katalyst-swift.jpeg?fit=1024%2C410&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA has awarded a $30 million contract to a startup to attempt to boost the orbit of an astronomy satellite before it reenters next year.\nThe post NASA awards Katalyst Space contract to reboost Swift spacecraft appeared first on SpaceNews.",
    "published_at": "2025-09-25T15:02:42Z",
    "updated_at": "2025-09-25T15:10:22.729380Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33282,
    "title": "Pulse: ESA’s new approach to flying satellites",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Operations/Pulse_ESA_s_new_approach_to_flying_satellites",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/pulse_key_visual/26887947-1-eng-GB/Pulse_key_visual_card_full.png",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-25T14:43:00Z",
    "updated_at": "2025-09-26T09:40:13.437336Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33262,
    "title": "NASA Selects Proteus Space for Novel Rapid Spacecraft Conceptual Design Study",
    "authors": [
      {
        "name": "Proteus Space",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/nasa-selects-proteus-space-for-novel-rapid-spacecraft-conceptual-design-study/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Proteus-LI-Logo.jpg?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nLOS ANGELES, CA – September 25, 2025 – Proteus Space, a leading innovator in rapid satellite design, digital modeling, AI&T, flight and operations solutions, has been selected by NASA for […]\nThe post NASA Selects Proteus Space for Novel Rapid Spacecraft Conceptual Design Study appeared first on SpaceNews.",
    "published_at": "2025-09-25T14:42:14Z",
    "updated_at": "2025-09-25T14:50:22.145862Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33261,
    "title": "Inside ispace Europe and the race to explore the moon",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/inside-ispace-europe-and-the-race-to-explore-the-moon/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/lamamy-ispace-europe-ceo-series-spaceminds-2000-1500-1-scaled.jpg?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIn this week's episode of Space Minds SpaceNews editor Mike Gruss talks with Julien Lamamy, Managing Director of ispace Europe from the World Space Business Week in Paris.\nThe post Inside ispace Europe and the race to explore the moon appeared first on SpaceNews.",
    "published_at": "2025-09-25T14:04:05Z",
    "updated_at": "2025-09-25T14:10:25.066462Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33260,
    "title": "Astra’s Chris Kemp woke up one recent morning and chose violence",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/astras-chris-kemp-woke-up-one-recent-morning-and-chose-violence/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1241184763.jpg",
    "news_site": "Arstechnica",
    "summary": "\"We bought the engine from them, and it was garbage.\"",
    "published_at": "2025-09-25T13:14:17Z",
    "updated_at": "2025-09-25T13:20:03.812918Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33259,
    "title": "NASA Glenn Reinforces Role in Aerospace Innovation During Ohio Space Week",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/nasa-glenn-reinforces-role-in-aerospace-innovation-during-ohio-space-week/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/grc-2025-c-06803.jpg",
    "news_site": "NASA",
    "summary": "Ohio Space Week, Sept. 8–13, highlighted the state’s aerospace legacy and the role NASA’s Glenn Research Center has in advancing space technology.  The week kicked off with the American Astronautical Society’s Glenn Space Technology Symposium, Sept. 8–10, hosted by Case Western Reserve University. Experts, students, and industry leaders gathered to discuss emerging space technologies. NASA […]",
    "published_at": "2025-09-25T12:58:40Z",
    "updated_at": "2025-09-25T13:00:14.462837Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33256,
    "title": "NASA Glenn’s AeroSpace Frontiers Newsletter Takes a Bow",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/nasa-glenns-aerospace-frontiers-newsletter-takes-a-bow/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2023/01/masthead-white-800x540-1.jpg",
    "news_site": "NASA",
    "summary": "Since April 1999, the AeroSpace Frontiers (AF) newsletter has shared information monthly on NASA Glenn Research Center’s people, projects, and progress. If you were looking for news on any of these topics, there was a good chance you could read all about them in AF each month.  The newsletter has evolved in the last 26 […]",
    "published_at": "2025-09-25T12:44:32Z",
    "updated_at": "2025-09-25T12:50:04.850146Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33257,
    "title": "Glenn Highlights Space Exploration at Minnesota State Fair",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/glenn-highlights-space-exploration-at-minnesota-state-fair/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/grc-2025-cn-00024.jpg",
    "news_site": "NASA",
    "summary": "NASA brought the excitement of space exploration to the Minnesota State Fair from Aug. 21–24, offering exhibits and interactive experiences for the whole family. Led by NASA’s Glenn Research Center in Cleveland, the agency showcased the future of space exploration and the technologies making it possible — from next-generation spacesuits to the Artemis missions that […]",
    "published_at": "2025-09-25T12:44:17Z",
    "updated_at": "2025-09-25T12:50:04.913992Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33258,
    "title": "NASA Names Glenn’s Steven Sinacore to Lead Fission Surface Power",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/nasa-names-glenns-steven-sinacore-to-lead-fission-surface-power/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/01/sinacore-steven-flag-portrait-2025.jpg",
    "news_site": "NASA",
    "summary": "NASA leadership has named NASA Glenn Research Center’s Steven A. Sinacore as the agency’s program executive for Fission Surface Power with Lindsay Kaldon as deputy program executive.  Sinacore will lead a team within the Exploration Systems Development Mission Directorate dedicated to advancing fission surface power technology in support of lunar exploration, providing high power energy […]",
    "published_at": "2025-09-25T12:44:06Z",
    "updated_at": "2025-09-25T12:50:04.928265Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33255,
    "title": "SatNews and SpaceNews Partner to Launch EU Space Defence Track at SmallSat Europe 2026",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/satnews-and-spacenews-partner-to-launch-eu-space-defence-track-at-smallsat-europe-2026/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/SSE-SpaceNews-2.jpg?fit=1024%2C812&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nWashington, D.C and Sonoma, Calif. – September 25 – SatNews, the team behind Silicon Valley Space Week, the SmallSat Symposium, and SmallSat Europe, which together welcome more than 3,500 attendees […]\nThe post SatNews and SpaceNews Partner to Launch EU Space Defence Track at SmallSat Europe 2026 appeared first on SpaceNews.",
    "published_at": "2025-09-25T12:00:22Z",
    "updated_at": "2025-09-25T12:10:26.932549Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33253,
    "title": "Live coverage: ULA to launch fifth batch of Amazon’s Project Kuiper satellites from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/25/live-coverage-ula-to-launch-fifth-batch-of-amazons-project-kuiper-satellites-from-cape-canaveral/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/09/20250925_Kuiper_sunrise.jpg",
    "news_site": "Spaceflight Now",
    "summary": "This is the third time that United Launch Alliance will launch these broadband satellites, but it’s the fifth batch heading to orbit overall for the constellation. Liftoff is scheduled for 8:09 a.m. EDT (1230 UTC). ",
    "published_at": "2025-09-25T11:39:03Z",
    "updated_at": "2025-09-25T11:40:28.221098Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Onboard are the next 27 Project Kuiper satellites from Amazon. ULA is targeting liftoff from Space Launch Complex 41 at 8:09 a.m. EDT (1209 UTC) Once deployed, Amazon will have 129 satellites in low Earth orbit. NROL-70 with be the 389th Delta launch since 1960 and 45th Delta 4 rocket."
  },
  {
    "id": 33254,
    "title": "Redwire to provide solar arrays for Axiom space station module",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/redwire-to-provide-solar-arrays-for-axiom-space-station-module/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/axiomstation.jpeg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nAxiom Space has awarded a contract to Redwire to provide solar arrays for the first module of Axiom’s planned commercial space station.\nThe post Redwire to provide solar arrays for Axiom space station module appeared first on SpaceNews.",
    "published_at": "2025-09-25T11:30:00Z",
    "updated_at": "2025-09-25T11:40:28.437335Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Axiom Space has awarded a contract to Redwire to provide solar arrays for the first module of Axiom’s planned commercial space station. The companies announced Sept. 25 that Redwire will provide a version of its Roll-Out Solar Array. The partnership comes as NASA revises plans to support development of commercial stations. Pakistan chose instead to partner with China. Axiom has signed countries such as Hungary, India and Poland for private astronaut missions. “We will and must avoid a space station gap in LEO to ensure that America is at least equal to Chinese capabilities in this incredibly important field of endeavor”"
  },
  {
    "id": 33252,
    "title": "Ariane 6 Selected to Launch German Military Communications Satellites",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/ariane-6-selected-to-launch-german-military-communications-satellites/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/Ariane-6-Selected-to-Launch-German-Military-Communications-Satellites.webp",
    "news_site": "European Spaceflight",
    "summary": "Airbus Defence and Space has awarded Arianespace a contract to launch a pair of SATCOMBw-3 communications satellites for the German Armed Forces. In July 2024, the German Armed Forces awarded Airbus Defence and Space a €2.1 billion contract for the SATCOMBw-3 programme. Under the programme, Airbus has been tasked with developing and deploying a next-generation […]\nThe post Ariane 6 Selected to Launch German Military Communications Satellites appeared first on European Spaceflight.",
    "published_at": "2025-09-25T08:36:38Z",
    "updated_at": "2025-09-25T08:40:11.100594Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Arianespace has been awarded a contract to launch a pair of SATCOMBw-3 communications satellites for the German Armed Forces. The contract covers the development of the two geostationary satellites, the associated ground segment, the launch of the satellites (which is expected to occur before the end of the decade), and the operation of the constellation."
  },
  {
    "id": 33251,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/25/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-13/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/06/20250605_Falcon-9_night_pad_file.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-15 mission comes a day after SpaceX launched a trio of spacecraft to study the effects of the Sun. Liftoff from pad 40 at Cape Canaveral Space Force Station is scheduled for 4:39 a.m. EDT (0839 UTC).",
    "published_at": "2025-09-25T07:10:32Z",
    "updated_at": "2025-09-25T09:57:29.177406Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "c717d2b5-e39c-45a3-9f89-ce73526852eb",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "SpaceX launched its Falcon 9 rocket from pad 40 at Cape Canaveral Space Force Station. The Starlink 10-15 flight will add another 28 Starlink V2 Mini satellites to the growing megaconstellation of more than 8,400 currently on orbit. Forecasters predict mostly clear skies and light winds at the surface and aloft for Monday’s launch."
  },
  {
    "id": 33250,
    "title": "Artemis II Crew Ready to Fly Around the Moon on “Integrity”",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/artemis-ii-crew-ready-to-fly-around-the-moon-on-integrity/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/Artemis-II-crew-presser-Sep-24-25-300x107.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Today the four Artemis II crew members announced the name they have chosen for their Orion capsule — Integrity. During an hour-long news conference, they conveyed readiness for their mission […]",
    "published_at": "2025-09-25T03:46:37Z",
    "updated_at": "2025-09-25T03:50:15.693407Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " Artemis II crew members announced the name they have chosen for their Orion capsule — Integrity. The goal is to fly around the Moon, but the spacecraft and life support systems first must pass tests in Earth orbit before NASA decides to execute the Trans-Lunar Injection (TLI) burn. The crew said today enabling Artemis III is their measure of success. Space weather is caused by coronal mass ejections (CMEs) from the Sun. CMEs create breathtaking auroras on Earth, but also can disrupt electrical systems and orbiting satellites. Artemis II crew can shelter in Orion’s storage compartments if there is a CME during their 10-day flight."
  },
  {
    "id": 33249,
    "title": "NASA Awards Atmosphere Research Support Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-atmosphere-research-support-contract/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
    "news_site": "NASA",
    "summary": "NASA has selected Science and Technology Corp. of Columbia, Maryland, to support atmospheric science research and development at the agency’s Goddard Space Flight Center in Greenbelt, Maryland. The Atmosphere Support is a cost-plus-fixed-fee, single-award indefinite-delivery/indefinite-quantity contract with a maximum ordering value of $163.1 million. The contract will have an effective date of Monday, Nov. 3, […]",
    "published_at": "2025-09-24T21:11:29Z",
    "updated_at": "2025-09-24T21:20:08.905957Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33248,
    "title": "Next chapter in space defense: Satellites that never stop moving",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/next-chapter-in-space-defense-satellites-that-never-stop-moving/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/04/orbittfab-shuttle.jpg?fit=1024%2C697&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nConcepts like ‘dynamic space operations’ and ‘sustained space maneuver’ refer not only to extending the life of satellites but also to allowing them to ‘take action’\nThe post Next chapter in space defense: Satellites that never stop moving appeared first on SpaceNews.",
    "published_at": "2025-09-24T20:53:52Z",
    "updated_at": "2025-09-24T21:00:25.743441Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33247,
    "title": "ESCAPADE launch on New Glenn planned for late October or early November",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/escapade-launch-on-new-glenn-planned-for-late-october-or-early-november/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/escapade-cape-sept2025.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe second launch of Blue Origin’s New Glenn rocket, carrying a NASA smallsat mission to Mars, is now expected in late October or early November.\nThe post ESCAPADE launch on New Glenn planned for late October or early November appeared first on SpaceNews.",
    "published_at": "2025-09-24T20:44:30Z",
    "updated_at": "2025-09-24T20:50:18.984491Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33246,
    "title": "NASA Awards Company to Attempt Swift Spacecraft Orbit Boost",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-company-to-attempt-swift-spacecraft-orbit-boost/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/sci-award-release-swift-orbit-boost-sept-24.jpg",
    "news_site": "NASA",
    "summary": "Driving rapid innovation in the American space industry, NASA has awarded Katalyst Space Technologies of Flagstaff, Arizona, a contract to raise a spacecraft’s orbit. Katalyst’s robotic servicing spacecraft will rendezvous with NASA’s Neil Gehrels Swift Observatory and raise it to a higher altitude, demonstrating a key capability for the future of space exploration and extending […]",
    "published_at": "2025-09-24T20:22:18Z",
    "updated_at": "2025-09-24T20:30:05.450703Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33244,
    "title": "NASA Highlights Space Innovation, Exploration at Space Conference",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-highlights-space-innovation-exploration-at-space-conference/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/iac-2025-advisory-sept-24.jpg",
    "news_site": "NASA",
    "summary": "Led by acting NASA Administrator Sean Duffy, an agency delegation will participate in the International Astronautical Congress (IAC) in Sydney, Australia, from Sunday, Sept. 28 to Friday, Oct. 3. The IAC, organized by the International Astronautical Federation (IAF), is hosted this year by the Space Industry Association of Australia. During the congress, NASA will highlight […]",
    "published_at": "2025-09-24T19:16:55Z",
    "updated_at": "2025-09-24T19:20:06.692178Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33245,
    "title": "NASA’s Astrobee Robots Advance Through Strategic Partnership",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-astrobee-robots-advance-through-strategic-partnership/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2023/03/iss059e038084.jpg",
    "news_site": "NASA",
    "summary": "NASA is continuing the Astrobee mission through a collaboration with Arkisys, Inc., of Los Alamitos, California, who was awarded a reimbursable Space Act Agreement to sustain and maintain the robotic platform aboard the International Space Station. As the agency returns astronauts to the Moon, robotic helpers like Astrobee could one day take over routine maintenance […]",
    "published_at": "2025-09-24T19:12:18Z",
    "updated_at": "2025-09-24T19:20:06.737581Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33243,
    "title": "NASA Lab Builds New Aircraft to Support Complex Flight Research",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasa-lab-builds-new-aircraft-to-support-complex-flight-research/",
    "image_url": "https://images-assets.nasa.gov/image/AFRC2025-0148-03/AFRC2025-0148-03~large.jpg",
    "news_site": "NASA",
    "summary": "NASA’s Armstrong Flight Research Center in Edwards, California, is building a new subscale aircraft to support increasingly complex flight research, offering a more flexible and cost-effective alternative to crewed missions. The aircraft is being built by Justin Hall, chief pilot at NASA Armstrong’s Dale Reed Subscale Flight Research Laboratory, and Justin Link, a small uncrewed […]",
    "published_at": "2025-09-24T18:55:05Z",
    "updated_at": "2025-09-24T19:00:06.419359Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33242,
    "title": "Space Forge and United Semiconductors to collaborate on space-based semiconductor manufacturing",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/space-forge-and-united-semiconductors-to-collaborate-on-space-based-semiconductor-manufacturing/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/inspa.png?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSAN FRANCISCO – British startup Space Forge and U.S.-based United Semiconductors announced an agreement Sept. 23 to develop capabilities for space-based manufacturing of semiconductors used in electromagnetic sensors and quantum computing. The memorandum of understanding (MoU) follows more than a year of collaboration between the two companies and comes less than a week after Northrop Grumman’s […]\nThe post Space Forge and United Semiconductors to collaborate on space-based semiconductor manufacturing appeared first on SpaceNews.",
    "published_at": "2025-09-24T18:09:13Z",
    "updated_at": "2025-09-24T18:10:19.554492Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33241,
    "title": "NASA Aircraft Coordinate Science Flights to Measure Air Quality",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/earth/nasa-aircraft-coordinate-science-flights-to-measure-air-quality/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/articles/2025/A90%20NASA%20Chesapeake%20Shawn%20Serbin.jpeg",
    "news_site": "NASA",
    "summary": "Magic is in the air. No wait… MAGEQ is in the air, featuring scientists from NASA centers across the country who teamed up with the National Oceanic and Atmospheric Administration (NOAA), the University of Maryland Baltimore County, and several other university and government partners and collaborators. This summer, six planes collectively flew more than 400 […]",
    "published_at": "2025-09-24T18:00:00Z",
    "updated_at": "2025-09-24T18:10:06.402277Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33240,
    "title": "NASA Data Powers New Tool to Protect Water Supply After Fires",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/earth/nasa-data-powers-new-tool-to-protect-water-supply-after-fires/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/articles/2025/hydroflame_banner.jpg",
    "news_site": "NASA",
    "summary": "When wildfires scorch a landscape, the flames are just the beginning. NASA is helping U.S. communities foresee and prepare for what can follow: mudslides, flash flooding, and contaminated water supplies.",
    "published_at": "2025-09-24T17:00:00Z",
    "updated_at": "2025-09-24T17:10:05.014422Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33239,
    "title": "Help Map the Moon’s Molten Flows!",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/get-involved/citizen-science/help-map-the-moons-molten-flows/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/citizen-science/highlights/2025/lunar-melt-lunar-surface.png",
    "news_site": "NASA",
    "summary": "When asteroids hit the Moon, the impacts carve out craters and with enough energy and pressure, melt parts of the rocky surface. Often, the white hot, gooey melt (it’s like lava, except that it doesn’t erupt from underground) sloshes around the new crater and surrounding regions. The molten rock cools and hardens into vast rock […]",
    "published_at": "2025-09-24T16:00:37Z",
    "updated_at": "2025-09-24T16:15:10.477254Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33238,
    "title": "Airplane Aerobatics",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/airplane-aerobatics/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/54783045945-682fa4ee3b-o.jpg",
    "news_site": "NASA",
    "summary": "NASA astronaut Nick Hague watches as Robert Schmidle Pitts Aerobatics perform, Friday, Sept. 12, 2025, at Joint Base Andrews in Prince George’s County, Maryland. Hague spent 171 days aboard the International Space Station as part of Expedition 72. While aboard the orbital laboratory, Hague and fellow NASA astronauts Suni Williams and Butch Wilmore completed more […]",
    "published_at": "2025-09-24T15:59:51Z",
    "updated_at": "2025-09-24T16:00:14.877763Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33234,
    "title": "NASA’s Webb Explores Largest Star-Forming Cloud in Milky Way",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/webb/nasas-webb-explores-largest-star-forming-cloud-in-milky-way/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/09/STScI-01K4T8XYNBJ9A93DJ9KYQJE2WF.png",
    "news_site": "NASA",
    "summary": "NASA’s James Webb Space Telescope has revealed a colorful array of massive stars and glowing cosmic dust in the Sagittarius B2 molecular cloud, the most massive and active star-forming region in our Milky Way galaxy.  “Webb’s powerful infrared instruments provide detail we’ve never been able to see before, which will help us to understand some […]",
    "published_at": "2025-09-24T14:00:00Z",
    "updated_at": "2025-09-24T16:15:00.771800Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "d0fa4bb2-80ea-4808-af08-7785dde53bf6",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  }
]