[
  {
    "id": 33436,
    "title": "FCC launches ‘Space Month’ to fast-track satellite licensing and spectrum reforms",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/fcc-launches-space-month-to-fast-track-satellite-licensing-and-spectrum-reforms/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/FCC-chairman-scaled.jpeg?fit=1024%2C704&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nFCC Chairman Brendan Carr vowed Oct. 6 to accelerate satellite regulatory reforms, declaring October as “Space Month” at the U.S. regulator to overhaul licensing and spectrum rules amid mounting competition from China.\nThe post FCC launches ‘Space Month’ to fast-track satellite licensing and spectrum reforms appeared first on SpaceNews.",
    "published_at": "2025-10-06T21:51:17Z",
    "updated_at": "2025-10-06T22:00:29.998482Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "FCC Chairman Brendan Carr vows to accelerate satellite regulatory reforms. He declares October as “Space Month’ at the U.S. regulator to overhaul licensing and spectrum rules. Carr outlined two main proposals that the FCC is preparing to vote on. Since January, Carr said streamlining efforts have already helped the FCC process half of the Earth station applications. Jason Rainbow has spent more than a decade covering the global space industry as a business journalist. Previously, he was Group Editor-in-Chief for Finance Information Group. More by Jason Rainbow all dispatches >> all jobs >> Back to top   Enter the code sent to your email. Sign in by entering the code we sent to , or clicking the magic link in the email."
  },
  {
    "id": 33435,
    "title": "Launch Roundup: Falcon 9 to launch five times, Blue Origin to launch crew",
    "authors": [
      {
        "name": "Aaron McCrea",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/10/launch-roundup-100625/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2024/11/Booster-1062-became-the-first-booster-to-complete-a-21st-launch-and-landing-May-2024-Credit-Julia-Bergeron-NSF-scaled.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX is set to dominate the launch manifest for the first whole week of October…\nThe post Launch Roundup: Falcon 9 to launch five times, Blue Origin to launch crew appeared first on NASASpaceFlight.com.",
    "published_at": "2025-10-06T21:47:52Z",
    "updated_at": "2025-10-06T21:50:12.168757Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is set to dominate the launch manifest for the first whole week of October with five Falcon 9 missions. All five of these missions will launch satellites into internet constellations, with four launching into SpaceX’s Starlink constellation and the fifth launching into Amazon's Project Kuiper constellation. China will launch another unknown payload atop its Chang Zheng 8A rocket. Blue Origin also looks to join the launch schedule by launching six people to suborbital space on its New Shepard vehicle. Blue Origin is set to launch another six-person crew to suborbital space on New Shepard’s 36th mission. NS-36 is expected to launch on Wednesday, Oct. 8, at 8:00 AM CDT (13:00 UTC), carrying Jeff Elgin, Danna Karagussova, Dr. Clint Kelly III, Aaron Newman, Vitalii Ostrovsky, and an undisclosed sixth crew member. The booster, which remains unknown at this time, will attempt a propulsive landing at the North Landing Pad, while the crew capsule, also currently unknown, will land under parachutes in the Texas Desert.  NASASpaceflight.com will be taking part in the 25th anniversary of the first space shuttle mission in 2025. The space shuttle program is scheduled to begin in 2025 and end in 2025. The mission will take place in 2023, 2024, 2025, 2023 and 2025."
  },
  {
    "id": 33434,
    "title": "Laying the foundation for America’s space future",
    "authors": [
      {
        "name": "Joshua Levine and Prineha Narang",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/laying-the-foundation-for-americas-space-future/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/IMG_4120-scaled.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThere really is no terrestrial parallel to space exploration. While American pioneers pushed westward with minimal government oversight, the space age began with government funds and directives. Today, what was once the domain of nation-states is now (theoretically) accessible to upstarts and dreamers. While the United States and peer nations maintain government-directed space programs, the […]\nThe post Laying the foundation for America’s space future appeared first on SpaceNews.",
    "published_at": "2025-10-06T21:07:03Z",
    "updated_at": "2025-10-06T21:10:18.253524Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The promise of the “space economy’ is becoming reality. Reusable rocket technology is driving launch costs lower even in the face of regulatory hurdles. China launched more than 60 orbital missions in 2024. Europe is streamlining regulations in hopes of competing in this new era of space competition. FCC has already cut its satellite application backlog in half since January 2025. Prineha Narang and Joshua Levine: U.S. companies face months of delays while foreign competitors move at startup speed. Levine and Narang: Streamlined licensing, faster approvals and regulatory clarity are prerequisites for American competitiveness. From Oct. 6-10: Save $25 on any new subscription with code SAVE25 Cancel anytime. Sales tax may apply. No refunds. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By creating a SpaceNews.com account, you acknowledge that you have read our privacy policy and agree to our terms and conditions."
  },
  {
    "id": 33433,
    "title": "Live coverage: SpaceX to launch Falcon 9 rocket on 90th Starlink mission of 2025",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/10/06/live-coverage-spacex-to-launch-falcon-9-rocket-on-90th-starlink-mission-of-2025/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/06/20250605_Falcon-9_night_pad_file-678x416.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-59 mission will add 28 broadband internet satellites into the growing megaconstellation. SpaceX is targeting liftoff from pad 40 at Cape Canaveral Space Force Station during a launch window that opens at 12:10 a.m. EDT (0410 UTC). ",
    "published_at": "2025-10-06T20:55:37Z",
    "updated_at": "2025-10-06T21:00:24.296107Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for its first Falcon 9 rocket launch from Florida in more than a week. The Starlink 10-59 mission will add 28 more broadband internet satellites into the growing megaconstellation. SpaceX will use the Falcon 9 first stage booster B1090, which will launch for an eighth time. If successful, this will be the 127th landing on this vessel."
  },
  {
    "id": 33432,
    "title": "ESA to Procure ISS Cargo Service to Meet Common Cost Obligations",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/esa-to-procure-iss-cargo-service-to-meet-common-cost-obligations/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/10/ESA-to-Procure-ISS-Cargo-Service-to-Meet-Common-Cost-Obligations.webp",
    "news_site": "European Spaceflight",
    "summary": "The European Space Agency (ESA) has issued a call for proposals outlining its intention to purchase commercial cargo transportation services to the International Space Station (ISS). The mission, which must be completed by the fourth quarter of 2028, is intended to meet the agency’s obligations under the ISS Common System Operations Costs (CSOC) framework from […]\nThe post ESA to Procure ISS Cargo Service to Meet Common Cost Obligations appeared first on European Spaceflight.",
    "published_at": "2025-10-06T14:50:22Z",
    "updated_at": "2025-10-06T15:00:14.803372Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency (ESA) has issued a call for proposals to purchase commercial cargo transportation services to the International Space Station. The mission, which must be completed by the fourth quarter of 2028, is intended to meet the agency’s obligations under the ISS Common System Operations Costs (CSOC) framework."
  },
  {
    "id": 33437,
    "title": "Large Space Simulator gets a digital twin",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Space_Engineering_Technology/Large_Space_Simulator_gets_a_digital_twin",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/10/the_cavernous_chamber_of_the_large_space_simulator/26906957-1-eng-GB/The_cavernous_chamber_of_the_Large_Space_Simulator_card_full.jpg",
    "news_site": "ESA",
    "summary": "The Large Space Simulator, Europe’s largest vacuum chamber, routinely reproduces space conditions on Earth to test spacecraft before they fly into orbit. The facility is complex, and the current process of training a new operator is lengthy and complicated. To make it easier, the space simulator now has a digital twin – the most realistic virtual model of the facility yet, developed for the European Space Agency (ESA) by the Spanish engineering company Empresarios Agrupados.",
    "published_at": "2025-10-06T14:13:00Z",
    "updated_at": "2025-10-07T09:20:17.227414Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33431,
    "title": "Cubic targets military satcom market with ‘Vector’ terminals",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/cubic-targets-military-satcom-market-with-vector-terminals/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/22AFA001_R7_1-scaled-e1759685306489.jpg?fit=1024%2C589&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe company says its terminals can seamlessly switch between satellite constellations while withstanding electronic warfare threats\nThe post Cubic targets military satcom market with ‘Vector’ terminals appeared first on SpaceNews.",
    "published_at": "2025-10-06T13:30:00Z",
    "updated_at": "2025-10-06T13:40:18.251032Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Cubic Defense is pursuing military customers for its flat-panel satellite communications terminal. The terminal is designed to operate across multiple orbits and networks. Flat-panel antennas connect to multiple satellites simultaneously without mechanical steering. The highly competitive satcom terminal market is populated by defense and commercial players. Save $25 on any new subscription with code SAVE25 Cancel anytime. Sales tax may apply. No refunds. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. You acknowledge that you have read our privacy policy and agree to our terms and conditions."
  },
  {
    "id": 33430,
    "title": "Utilize the ISS as a resource: a common sense, fiscally responsible plan leveraging the International Space Station",
    "authors": [
      {
        "name": "Greg Vialle",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/utilize-the-iss-as-a-resource-a-common-sense-fiscally-responsible-plan-leveraging-the-international-space-station/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/07/International-Space-Station-in-2021-scaled.webp?fit=1024%2C569&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA plans to spend approximately $1 billion of taxpayer money to destroy the International Space Station (ISS) in 2030. The ISS contains over $1.5 billion worth of space-grade materials already in orbit. Instead of throwing this asset away, we should redirect that funding to develop the technology to recycle it. This approach saves a valuable […]\nThe post Utilize the ISS as a resource: a common sense, fiscally responsible plan leveraging the International Space Station appeared first on SpaceNews.",
    "published_at": "2025-10-06T13:00:00Z",
    "updated_at": "2025-10-06T13:00:23.403200Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA plans to destroy the International Space Station (ISS) in 2030. The ISS contains over $1.5 billion worth of space-grade materials already in orbit. Instead of throwing this asset away, we should redirect that funding to recycle it. This approach saves a valuable asset, prevents wasteful spending and seeds a new, American-led industry in space. Congress should direct NASA to stop focusing solely on deorbiting the ISS. Instead analyze and fund pathways for utilizing it as an uncrewed demonstration logistics and manufacturing hub. Greg Vialle is the founder of Lunexus Space, a Colorado startup seeking to power the circular economy in space by turning debris into orbital resources. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Use the Daily Discussion to help people understand today's featured news stories. The Daily Discussion also helps people understand the news stories that have been featured on CNN.com. For more information on how to help CNN.co.uk readers, click here."
  },
  {
    "id": 33429,
    "title": "Navigating through interference at Jammertest",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Satellite_navigation/Navigating_through_interference_at_Jammertest",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/10/esa_testbed_van_in_norway/26903585-1-eng-GB/ESA_testbed_van_in_Norway_card_full.jpg",
    "news_site": "ESA",
    "summary": "Satellite navigation is essential to everything from tracking your morning jog to landing air ambulances. But as reliance on satellite navigation grows, so do the risks associated with its interruption, natural or intentional. In its pursuit of strengthening European resilience in navigation, the European Space Agency (ESA) took part in Jammertest.",
    "published_at": "2025-10-06T11:11:00Z",
    "updated_at": "2025-10-06T11:30:13.502964Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33428,
    "title": "Firefly to acquire defense contractor SciTec in $855 million deal",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/firefly-to-acquire-defense-contractor-scitec-in-855-million-deal/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/f074f55c798cf7d74f5f252b50a80213.png?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe acquisition would expand Firefly’s footprint in the defense market, where Firefly is trying to capture opportunities in the Golden Dome program\nThe post Firefly to acquire defense contractor SciTec in $855 million deal appeared first on SpaceNews.",
    "published_at": "2025-10-05T21:33:41Z",
    "updated_at": "2025-10-05T21:40:17.816887Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Firefly Aerospace announced Oct. 5 it plans to acquire defense contractor SciTec. The deal marks an expansion into the defense sector for Firefly. Firefly develops launch vehicles, lunar landers and in-space transportation vehicles. The acquisition is intended to expand Firefly’s footprint in the defense market.  Firefly and SciTec are working to return its Alpha launch vehicle to flight. The rocket is currently grounded after the first stage booster for its upcoming Flight 7 mission was destroyed in an explosion. “I have full confidence in our Alpha team to return to flight safely,” Kim said."
  },
  {
    "id": 33427,
    "title": "ESA inaugurates new deep space antenna in Australia",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/esa-inaugurates-new-deep-space-antenna-in-australia/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/newnorcia3.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe European Space Agency has inaugurated a new deep space antenna in Australia as part of efforts to strengthen ties between Europe and Australia in space.\nThe post ESA inaugurates new deep space antenna in Australia appeared first on SpaceNews.",
    "published_at": "2025-10-05T20:39:25Z",
    "updated_at": "2025-10-05T20:40:18.190709Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency has inaugurated a new deep space antenna in Australia. It is part of efforts to strengthen ties between Europe and Australia in space. The antenna, called New Norcia 3, will support communications with ESA spacecraft. It includes upgrades such as cryocooling of the receiver to reduce noise. Get unlimited access to SpaceNews.com now. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent to your email. Enter your password. Sign in to an existing account."
  },
  {
    "id": 33426,
    "title": "What’s Happening in Space Policy October 5-11, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-october-5-11-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2024/11/John-Thune-240x300.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of October 5-11, 2025 and any insight we can offer about them. The Senate is in session this week. […]",
    "published_at": "2025-10-05T18:10:28Z",
    "updated_at": "2025-10-05T18:20:14.350810Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The government shutdown that began on Wednesday, October 1, continues. The Senate will try again tomorrow, Monday, for the fifth time to pass the Continuing Resolution (CR) that cleared the House on September 19. The Planetary Society and a coalition of partners will be on Capitol Hill holding a “Day of Action to Save NASA Science” Three space-related committees of the National Academies of Sciences, Engineering, and Medicine are meeting this week. Blue Origin will launch another six-person crew from their West Texas launch site on a 10-minute flight above the imaginary line that separates air and space. The Mars Society holds its 28th annual convention Thursday-Saturday at the University of Southern California."
  },
  {
    "id": 33425,
    "title": "SpaceX to launch 4 Falcon Heavy rockets as part of newest U.S. national security missions award",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/10/04/spacex-to-launch-4-falcon-heavy-rockets-as-part-of-newest-u-s-national-security-missions-award/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2023/12/20231229-FH-Moon-Landscape.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The U.S. Space Force’s Space Systems Command announced that SpaceX and ULA would launch five and two missions respectively as part of the latest round of National Security Space Launch contract assignments. ",
    "published_at": "2025-10-04T15:41:06Z",
    "updated_at": "2025-10-04T15:50:19.816688Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The latest missions carrying payloads for the U.S. Space Force (USSF) and the National Reconnaissance Office (NRO) were announced on Friday. SpaceX was tasked with five missions and United Launch Alliance (ULA) received two. This is the second order year (OY2) for the National Security Space Launch (NSSL) Phase 3 Lane 2 contract, which was awarded to Blue Origin, SpaceX and ULA. A $210 million NASA mission to improve air pollution monitoring over North America is set to launch Thursday. Intelsat communications satellite blasting off on a SpaceX Falcon 9 rocket from Cape Canaveral. Blue Origin aims to launch its first mission before the end of 2024. It will carry the company’s Blue Ring technology as its primary payload."
  },
  {
    "id": 33424,
    "title": "SpaceX lands majority of U.S. national security launches awarded for fiscal year 2026",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/spacex-lands-majority-of-u-s-national-security-launches-awarded-for-fiscal-year-2026/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/Screenshot-2025-08-21-at-11.50.18-PM.png?fit=1024%2C553&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSpaceX was assigned five of seven National Security Space Launch (NSSL) Phase 3 Lane 2 missions. United Launch Alliance got two.\nThe post SpaceX lands majority of U.S. national security launches awarded for fiscal year 2026 appeared first on SpaceNews.",
    "published_at": "2025-10-04T10:36:03Z",
    "updated_at": "2025-10-04T10:40:18.205394Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The U.S. Space Force assigned SpaceX five of seven national security missions budgeted in fiscal year 2026. United Launch Alliance (ULA) will fly the remaining two missions, while Blue Origin will have to wait until 2027. The awards mark the second round of launch assignments under the National Security Space Launch (NSSL) Phase 3 Lane 2 contract. Enter the code we sent to your email. Use the magic link in the email to sign in. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent toyour email."
  },
  {
    "id": 33423,
    "title": "ESA inaugurates deep space antenna in Australia",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Operations/ESA_inaugurates_deep_space_antenna_in_Australia",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/esa_s_fourth_deep_space_antenna_in_new_norcia_australia/26878142-1-eng-GB/ESA_s_fourth_deep_space_antenna_in_New_Norcia_Australia_card_full.jpg",
    "news_site": "ESA",
    "summary": "The European Space Agency (ESA) has expanded its capability to communicate with scientific, exploration and space safety missions across our Solar System with the inauguration of a new 35-m diameter deep space antenna – the fourth for Estrack, ESA’s deep space tracking network.",
    "published_at": "2025-10-04T09:45:00Z",
    "updated_at": "2025-10-04T09:40:12.498329Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "New 35-m diameter deep space antenna is the fourth for Estrack, ESA’s deep space tracking network. Located in New Norcia, about 115 km north of Perth, Western Australia, the ‘New Norcia 3’ antenna will help meet the agency's fast-increasing data download needs and secure Europe's independence and leadership in space. The new antenna has an estimated construction cost of EUR 62.3 million. Construction was led by European industry, with Thales Alenia Space (France) and Schwartz Hautmont Construcciones Metálicas (Spain) as co-prime contractors. Once the new addition is made operational, New Norcia will become ESA’s first ground station equipped with two deep space antennas."
  },
  {
    "id": 33422,
    "title": "SpaceForest Aims to Capture 70% of European Demand for Suborbital Flights",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/spaceforest-aims-to-capture-70-of-european-demand-for-suborbital-flights/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/10/SpaceForest-Aims-to-Capture-70-Percent-of-European-Demand-for-Suborbital-Flights.webp",
    "news_site": "European Spaceflight",
    "summary": "Polish rocket builder SpaceForest has set an ambitious goal of capturing up to 70% of the European demand for suborbital flights. SpaceForest conducted the first two flights of its 11.5-metre-tall suborbital PERUN rocket in 2023, both of which were aborted mid-flight after encountering anomalies. In October 2024, the company received €2.4 million in co-funding from […]\nThe post SpaceForest Aims to Capture 70% of European Demand for Suborbital Flights appeared first on European Spaceflight.",
    "published_at": "2025-10-04T06:54:31Z",
    "updated_at": "2025-10-04T07:00:35.453443Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Polish rocket builder SpaceForest has set an ambitious goal of capturing up to 70% of the European demand for suborbital flights. The company conducted the first two flights of its 11.5-metre-tall PERUN rocket in 2023, both of which were aborted mid-flight after encountering anomalies. If successful, the company will look to complete a second flight in 2025, this one reaching an altitude of 80 kilometres. Help European Spaceflight continue to go after stories that are too often overlooked. You can donate from as little as €1. Every cent goes to fueling our mission. Back to the page you came from. Follow us on Twitter @ESpaceflight and @EuropeanSpaceflight."
  },
  {
    "id": 33421,
    "title": "Shutdown Continues With No Immediate End in Sight",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/shutdown-continues-with-no-immediate-end-in-sight/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/10/Thune-Johnson-Oct-3-25-300x166.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "The Senate again failed to pass a Continuing Resolution today to reopen government agencies like NASA that are closed due to a lapse in appropriations. They plan to try again […]",
    "published_at": "2025-10-03T22:42:10Z",
    "updated_at": "2025-10-03T22:50:13.715674Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Senate again failed to pass a Continuing Resolution to reopen government agencies like NASA that are closed due to a lapse in appropriations. House Speaker Mike Johnson decided this afternoon to keep the House out of session next week as a further attempt to force the Senate to agree to the House-passed CR. If the Senate does not agree to his CR, the shutdown cannot end at least until the House returns to approve any changes. The House will meet in pro forma sessions next week as it did this week. Once she is sworn in, there will be 214 Democrats, giving them a slighter edge. Voters in Texas and Tennessee will soon fill two other vacancies. The longest shutdown was 35 days during President Trump’s first term."
  },
  {
    "id": 33420,
    "title": "Gilmour Space plans return to flight next year",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/gilmour-space-plans-return-to-flight-next-year/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/07/eris-tf1-liftoff.jpeg?fit=940%2C616&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nDespite its first orbital launch attempt lasting only a few seconds, Gilmour Space Technologies is satisfied with the attempt and moving ahead to return to the launch pad next year.\nThe post Gilmour Space plans return to flight next year appeared first on SpaceNews.",
    "published_at": "2025-10-03T22:39:32Z",
    "updated_at": "2025-10-03T22:40:19.167093Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Gilmour Space Technologies' first orbital launch attempt lasted only a few seconds. The rocket lifted off the pad but drifted away from the pad and fell back to the ground. Video of the launch appeared to show at least one of the four hybrid rocket engines had malfunctioned. The company expects to return Eris to flight next year. Get unlimited access to SpaceNews.com for as low as $5 per week. Register now to get 2 more free articles every month. You’ll also receive our weekly SpaceNews This Week newsletter every Friday. By submitting this form, you agree to the SpaceNews privacy policy and terms and conditions."
  },
  {
    "id": 33419,
    "title": "Peter Beck discusses Neutron development as maiden flight nears",
    "authors": [
      {
        "name": "Sean Yoder",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/10/beck-neutron-update/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/Neutron-selected-for-NASAs-VADR-contract.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Rocket Lab’s ambitious push to launch its Neutron medium-lift rocket before the end of the…\nThe post Peter Beck discusses Neutron development as maiden flight nears appeared first on NASASpaceFlight.com.",
    "published_at": "2025-10-03T21:21:43Z",
    "updated_at": "2025-10-03T21:30:12.764744Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Rocket Lab’s ambitious push to launch its Neutron medium-lift rocket before the end of the year is entering the home stretch. CEO Sir Peter Beck tells NSF that his team is “literally sleeping in the factories” to meet the aggressive timeline. The 141-foot-tall reusable launch vehicle has passed several critical milestones in recent months. Neutron's modular first stage splits into a boost section containing engines and pressurization systems. A boost module might fly 20 times before retirement, while an upper module could reach 50-100 flights. Neutron offers three mission profiles: return-to-launch-site (RTLS) for propulsive landings back at Wallops’ Launch Complex 3. Neutron will follow Electron’s flight cadence philosophy: one launch in the first year, three in the second, then five, scaling from there. Rocket Lab won a $24 million Space Force contract to develop the upper stage. A confidential commercial satellite operator has booked two Neutron missions."
  },
  {
    "id": 33418,
    "title": "EchoStar clears key regulatory step for spectrum sale to SpaceX",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/echostar-clears-key-regulatory-step-for-spectrum-sale-to-spacex/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/hero-launch.webp?fit=1024%2C512&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nEchoStar said Oct. 3 it has met regulatory conditions needed to maintain rights to the global S-band spectrum it is selling to SpaceX in a deal worth more than $17 billion.\nThe post EchoStar clears key regulatory step for spectrum sale to SpaceX appeared first on SpaceNews.",
    "published_at": "2025-10-03T19:27:38Z",
    "updated_at": "2025-10-03T19:30:20.425117Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "EchoStar says it has met regulatory conditions to maintain rights to global S-band spectrum. The U.S.-based operator said the Lyra-4 satellite launched in June has successfully operated in low Earth orbit for at least 90 days. SpaceX plans to use the spectrum to enable a 20-fold increase in throughput for its direct-to-device (D2D) services. Jason Rainbow writes about satellite telecom, finance and commercial markets for SpaceNews. He has spent more than a decade covering the global space industry as a business journalist. Biweekly news and analysis on business, politics and technology in the Chinese space industry. Delivered Wednesdays."
  },
  {
    "id": 33417,
    "title": "The real space war is being fought in cyberspace",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/the-real-space-war-is-being-fought-in-cyberspace/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/05/Screenshot-2025-05-14-at-3.48.27%E2%80%AFPM.png?fit=1024%2C581&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\n“The cost of admission is relatively cheap in the cyber area,” Scolese said. “So we remain very much concerned about that.”\nThe post The real space war is being fought in cyberspace appeared first on SpaceNews.",
    "published_at": "2025-10-03T15:00:00Z",
    "updated_at": "2025-10-03T15:10:18.574664Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Christopher Scolese, director of the agency in charge of U.S. spy satellites, says he's worried about hackers. The worry is justified, and the attack surface is vast. A well-placed digital intrusion could cascade through an entire satellite network. The challenges are magnified by the rapid commercialization of space. War-gaming and red-teaming exercises that simulate cyber intrusions are not luxuries but necessities. The NRO’s decision to shift toward proliferated constellations of smaller satellites is one way to hedge. Redundancy in space is resilience against both kinetic and cyber threats."
  },
  {
    "id": 33416,
    "title": "NASA’s newest astronauts will have to be willing to wait",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasas-newest-astronauts-will-have-to-be-willing-to-wait/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/54794976900_9e0ca8169c_k.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nLauren Edgar thought she had missed out on becoming an astronaut again. Earlier this year, friends at the Johnson Space Center gave Edgar, a planetary scientist at the U.S. Geological Survey who had applied to be an astronaut, a heads-up: NASA would be calling the people selected for the latest astronaut class that day. But […]\nThe post NASA’s newest astronauts will have to be willing to wait appeared first on SpaceNews.",
    "published_at": "2025-10-03T14:00:00Z",
    "updated_at": "2025-10-03T14:10:19.527066Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Lauren Edgar, a planetary scientist at the U.S. Geological Survey, applied to be an astronaut. Edgar and the nine other members of the newest astronaut class, formally called Group 24, were announced Sept. 23. With six women, Group 24 was the first in which women outnumbered men. With limited mission opportunities for the foreseeable future, astronauts can’t be too choosy about what they want to do. “Everything in NASA’s portfolio right now sounds pretty exciting,” she said. The most important attribute a contemporary astronaut can have is patience, be it waiting for a phone call — or a flight assignment."
  },
  {
    "id": 33415,
    "title": "Week in images: 29 September - 3 October 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_29_September_-_3_October_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/iaf_global_space_leaders_summit/26894103-1-eng-GB/IAF_Global_Space_Leaders_Summit_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 29 September - 3 October 2025",
    "published_at": "2025-10-03T13:10:00Z",
    "updated_at": "2025-10-03T13:10:11.759692Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 33413,
    "title": "Rocket Report: Alpha explodes on test stand; Europe wants a mini Starship",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/10/rocket-report-alpha-explodes-on-test-stand-europe-wants-a-mini-starship/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/52360635711_25f1f1ff62_c.jpg",
    "news_site": "Arstechnica",
    "summary": "\"We are trying to find a partner that is willing to invest.\"",
    "published_at": "2025-10-03T11:00:19Z",
    "updated_at": "2025-10-03T11:15:05.249793Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The booster stage for Firefly Aerospace's next Alpha rocket was destroyed Monday. The European Space Agency signed a contract with Avio to begin designing a reusable upper stage. Synspective, a Japanese company developing a constellation of radar imaging satellites, has signed a deal with Rocket Lab. Germany to invest $41 billion in space-related defense projects by 2030. Blue Origin mulling expansion of New Shepard program beyond West Texas. China's Galactic Energy raises $336 million in funding for new rockets. Next Nuri rocket launch set for November 28; main payload will be aurora and magnetic field. Blue Origin seeks to reuse next New Glenn booster. Senators seek to halt the move of space shuttle Discovery to Houston. SpaceX's next Starship test flight is scheduled for October 13. The fate of a NASA science mission to study Mars's upper atmosphere hinges on a successful launch. Sens. John Cornyn and Ted Cruz want to remove Discovery from its 13-year home at the National Air and Space Museum's Steven F. Udvar-Hazy Center in Chantilly, Virginia. In the letter, the senators asked that committee chair Susan Collins (R-Maine) and vice chair Patty Murray (D-Wash.) block funding for Discovery 's relocation."
  },
  {
    "id": 33414,
    "title": "SERVIR lives on through concerted global campaign",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/servir-lives-on-through-concerted-global-campaign/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Glacier_Dynamics_in_Afghanistan2-scaled.png?fit=1024%2C528&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nLeaders of SERVIR gathered at NASA headquarters in February to mark the 20th anniversary of the NASA–U.S. Agency for International Development (USAID) program, which helps developing nations tackle environmental challenges using Earth observation data. “We had a birthday cake and a big celebration,” said David Saah, director of the University of California Geospatial Analysis Lab […]\nThe post SERVIR lives on through concerted global campaign appeared first on SpaceNews.",
    "published_at": "2025-10-03T11:00:00Z",
    "updated_at": "2025-10-03T11:10:17.507488Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The SERVIR program helps developing nations tackle environmental challenges using Earth observation data. The program relied on Earth-observation satellites and data gathered in space to help communities on the ground manage environmental challenges. NASA and USAID have spent tens of millions of dollars building regional hubs and providing communities with computers, software and expertise. USAID told SERVIR partners and NASA that all contracts and agreements would end on March 30. NASA’s SERVIR Applied Sciences Teams trained nearly 10,000 professionals to use remote-sensing data. Plans for the new regional hub in Costa Rica were canceled because of USAID objectives. Get unlimited access to SpaceNews.com for as low as $5 per week. You’ll also receive our weekly SpaceNews This Week newsletter every Friday. Opt-out at any time. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options."
  },
  {
    "id": 33412,
    "title": "Tracking satellites at the speed of light",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/10/Tracking_satellites_at_the_speed_of_light",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/10/tracking_satellites_at_the_speed_of_light/26900925-1-eng-GB/Tracking_satellites_at_the_speed_of_light_card_full.png",
    "news_site": "ESA",
    "summary": "2025 marks a landmark year for Europe’s ‘bridge between Earth and space’. The European Space Agency’s Estrack satellite tracking network turns 50.",
    "published_at": "2025-10-03T10:00:00Z",
    "updated_at": "2025-10-03T09:50:13.081256Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " 2025 marks a landmark year for Europe’s ‘bridge between Earth and space’ Estrack has grown into a strategic asset for Europe, enabling communication with spacecraft, transmitting commands and receiving scientific data. The network keeps an eye on satellites no matter their location: tracking them across Earth orbit, voyaging to comets or asteroids. It even keeps tabs on European launchers as they soar into orbit, ensuring no rocket is ever out of reach."
  },
  {
    "id": 33410,
    "title": "Earth from Space: Kilauea lava lake, Hawaii",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/10/Earth_from_Space_Kilauea_lava_lake_Hawaii",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/10/earth_from_space_kilauea_lava_lake_hawaii/26898432-1-eng-GB/Earth_from_Space_Kilauea_lava_lake_Hawaii_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-10-03T08:00:00Z",
    "updated_at": "2025-10-03T08:20:12.500527Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "This Copernicus Sentinel-2 image captures an active lava lake on the Kilauea volcano on Hawaii’s Big Island. Located in the central Pacific Ocean, Big Island is the southeastern-most island in the US state of Hawaii and, as its name suggests, the largest in the archipelago."
  },
  {
    "id": 33411,
    "title": "Sample processing",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/10/Sample_processing",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/10/sample_processing/26898643-1-eng-GB/Sample_processing_card_full.png",
    "news_site": "ESA",
    "summary": "The intricate mechanisms of the most sophisticated laboratory on Mars are revealed in Episode 4 of the ExoMars Rosalind Franklin series, called “Sample processing.”",
    "published_at": "2025-10-03T08:00:00Z",
    "updated_at": "2025-10-03T08:50:11.493717Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "26881916-98e7-40bc-954c-88ad6ac7a050",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The Rosalind Franklin rover’s drill has a maximum reach of two metres – deeper than any other mission has ever attempted on the Red Planet. This depth allows access to well-preserved organic material from four billion years ago, when conditions on the surface of Mars were more like those on infant Earth."
  },
  {
    "id": 33409,
    "title": "MaiaSpace Received €180M in Advance Payments in 2024",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/maiaspace-received-e180m-in-advance-payments-in-2024/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/10/MaiaSpace-Received-180M-Euros-in-Advance-Payments-in-2024.webp",
    "news_site": "European Spaceflight",
    "summary": "According to public filings submitted in July, MaiaSpace reported €180 million in advance payments in 2024, alongside a €45 million equity injection from its parent company ArianeGroup. Founded in 2021 as a wholly owned subsidiary of ArianeGroup, MaiaSpace is developing a two-stage rocket called Maia. The rocket will feature a reusable first stage and is […]\nThe post MaiaSpace Received €180M in Advance Payments in 2024 appeared first on European Spaceflight.",
    "published_at": "2025-10-03T07:30:24Z",
    "updated_at": "2025-10-03T07:40:10.816370Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "MaiaSpace reported €180 million in advance payments in 2024, alongside a €45 million equity injection from its parent company ArianeGroup. The company is developing a two-stage rocket called Maia. The rocket will feature a reusable first stage and is designed to be capable of delivering 500 kilograms to low Earth orbit when the first stage is being recovered. \"Every cent goes to fueling our mission. Every cent,\" he says. \"We're here to help people. We're not here to take anything away from people.\" \"We don't want to take away anything from anyone,\" he adds. \"It's just about helping people. It's not about taking anything away.\""
  },
  {
    "id": 33408,
    "title": "Starlab partners unveil full-scale mockup of commercial space station",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/starlab-partners-unveil-full-scale-mockup-of-commercial-space-station/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_1aa-p1030060-1.jpg?fit=879%2C494&ssl=1",
    "news_site": "SpaceNews",
    "summary": "SYDNEY, Australia – Starlab Space unveiled a full-scale mockup of the commercial space station at the International Astronautical Congress here. “We’re showing how large the station is going to be — 100% of the capacity of ISS,” Matt Magaña, president of space, defense and national security for Voyager Techogies, the majority partner in the Starlab […]\r\nThe post Starlab partners unveil full-scale mockup of commercial space station appeared first on SpaceNews.",
    "published_at": "2025-10-03T06:47:24Z",
    "updated_at": "2025-10-03T08:51:45.892849Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "17b75859-1630-481b-9985-6eef21dcc9a8",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Starlab Space unveiled a full-scale mockup of the commercial space station at the International Astronautical Congress. “We’re showing how large the station is going to be — 100% of the capacity of ISS,” says Voyager Techogies. Voyager is leading development of the 7.8-meter-diameter Starlab in a joint venture with international partners. Use the weekly Newsquiz to test your knowledge of stories you saw on SpaceNews.com. Use the Daily Discussion to help students understand today's featured news stories. The Daily Discussion also offers the chance to win a $200 gift card. Use this week's Newsquizz to testyour knowledge of events you saw in the news. Back to the Mail Online home."
  },
  {
    "id": 33407,
    "title": "HEO looks to expand satellite imaging beyond low Earth orbit",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/heo-looks-to-expand-satellite-imaging-beyond-low-earth-orbit/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/heo-tiangong.jpeg?fit=1024%2C649&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nAn Australian company that is a leader in taking images of spacecraft in low Earth orbit is seeking to widen its aperture to monitor higher orbits, and even beyond.\nThe post HEO looks to expand satellite imaging beyond low Earth orbit appeared first on SpaceNews.",
    "published_at": "2025-10-03T01:35:24Z",
    "updated_at": "2025-10-03T01:40:32.592644Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Australian company is a leader in taking images of spacecraft in low Earth orbit. It is seeking to widen its aperture to monitor higher orbits, and even beyond. HEO has conducted 4,000 “missions,” which is what the company calls a flyby by an imaging satellite. HEO estimates that at least 30 asteroids more than 19 meters across will pass ‘really close’ to the GEO belt. Such imagery could be used for scientific purposes or even resource extraction. “This is an opportunity that is too good to miss,” HEO says."
  },
  {
    "id": 33406,
    "title": "The spreadsheet behind the Golden Dome sticker shock",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/the-spreadsheet-behind-the-golden-dome-sticker-shock/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/Western-US.jpg.webp?fit=1024%2C476&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nTodd Harrison demonstrates the ‘Defense Futures Simulator’ that calculated eye-watering missile defense costs — and invites critics to prove him wrong with their own numbers.\nThe post The spreadsheet behind the Golden Dome sticker shock appeared first on SpaceNews.",
    "published_at": "2025-10-02T21:54:10Z",
    "updated_at": "2025-10-02T22:00:26.170583Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Trump in May said it would cost $175 billion over three years. Congressional Budget Office projected between $161 billion and $542 billion over two decades. Todd Harrison’s “robust all-threat defense’ scenario came in at $3.6 trillion. The cost of Golden Dome should not exceed a quarter of the U.S. defense budget. Harrison pinpointed the Trump administration’s focus on boost-phase intercept as a key reason costs balloon to such heights. If the goal shifted to midcourse defense, interceptors would have more time to fire and coast through space to reach their targets."
  },
  {
    "id": 33405,
    "title": "At IAC, global space cooperation meets American space dominance",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/at-iac-global-space-cooperation-meets-american-space-dominance/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/duffy-iac25.jpeg?fit=1024%2C669&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nAs the global space community gathered to discuss exploration and cooperation, one theme emerged: how countries are adapting to changes in policies, budgets and leadership at NASA.\nThe post At IAC, global space cooperation meets American space dominance appeared first on SpaceNews.",
    "published_at": "2025-10-02T21:31:54Z",
    "updated_at": "2025-10-02T21:40:19.650939Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The International Astronautical Congress was held in Sydney this week. It was the first opportunity for leaders of space agencies to meet with NASA's acting administrator. NASA and Sean Duffy emphasized U.S. leadership in space, almost aggressively. Many space agencies have been scrambling to adjust to changes at NASA. Australia signed a framework agreement with the United States to deepen cooperation in space and aeronautics. At the same time, the Australian government announced it would begin negotiations with ESA on a cooperative agreement. That could allow Australian companies and organizations to participate directly in ESA programs, giving Australia a status similar to Canada's within the agency."
  },
  {
    "id": 33404,
    "title": "Wide-field surveys versus precise infrared observations: how Rubin compares to JWST",
    "authors": [
      {
        "name": "Sean Yoder",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/10/rubin-vs-jwst/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/10/webb-rubin-lead.png",
    "news_site": "NASASpaceflight",
    "summary": "Earlier this year, the new Vera C. Rubin Observatory in Chile officially began scientific operations,…\nThe post Wide-field surveys versus precise infrared observations: how Rubin compares to JWST appeared first on NASASpaceFlight.com.",
    "published_at": "2025-10-02T20:35:05Z",
    "updated_at": "2025-10-02T20:40:14.397076Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Earlier this year, the new Vera C. Rubin Observatory in Chile officially began scientific operations, becoming the world’s largest and most advanced ground-based telescope. Meanwhile, situated at the L2 Lagrange point is the James Webb Space Telescope. Both telescopes represent different technological solutions to mapping and analyzing the cosmos. Together they are poised to reveal untold information about our universe. The Rubin Science Platform (RSP) provides cloud-based data access, eliminating the need for researchers to download massive datasets locally. Nightly operations generate approximately 20 terabytes of data, processed through automated systems. Real-time processing capabilities can generate up to 10 million alerts per night when changes to existing objects or the introduction of new objects are detected. The Rubin Observatory’s survey approach generates approximately 7.3 petabytes of data annually. JWST produces roughly 350 times less data than Rubin, but focuses on precision observations. Rubin functions as a wide-field reconnaissance system, systematically cataloging approximately 20 billion galaxies, 17 billion stars, and millions of asteroids across the southern sky. NASA's next round of space flights will take place between September 30, 2025 and April 11, 2025. The space agency's next series of flights will also take place in 2023, 2024 and 2025. NASA's next fleet of spaceflights will be the largest since the space shuttle program began in 1986."
  },
  {
    "id": 33403,
    "title": "Live coverage: SpaceX to launch 3rd consecutive Falcon 9 rocket from Vandenberg SFB, uninterrupted by a Cape mission",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/10/02/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/03/20240318-Starlink-Feature-Image.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 11-39 mission is scheduled to liftoff from pad 4E at Vandenberg Space Force Base at 6:21 a.m. PDT (9:21 a.m. EDT / 1321 UTC). The Falcon 9 rocket will fly on a south-easterly trajectory. ",
    "published_at": "2025-10-02T17:40:57Z",
    "updated_at": "2025-10-02T17:50:21.342045Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33402,
    "title": "DLR Prepares to Launch Small Reusable Space Transportation Demonstrator",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/dlr-prepares-to-launch-small-reusable-space-transportation-demonstrator/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/10/DLR-Prepares-to-Launch-Small-Reusable-Space-Transportation-Demonstrator.webp",
    "news_site": "European Spaceflight",
    "summary": "The German Aerospace Center (DLR) is preparing to launch its ATHEAt reusable space transportation demonstrator mission from Andøya Space in Norway. Initiated in January 2022, the Advanced Technologies for High Energetic Atmospheric Flight of Launcher Stages (ATHEAt) demonstrator programme is focused on testing key technologies for future reusable space vehicles, with a particular emphasis on […]\nThe post DLR Prepares to Launch Small Reusable Space Transportation Demonstrator appeared first on European Spaceflight.",
    "published_at": "2025-10-02T14:42:23Z",
    "updated_at": "2025-10-02T14:50:10.755898Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33401,
    "title": "Space security, threats and rapid innovation",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/space-security-threats-and-rapid-innovation/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/072525-space-minds-podcast-ISS-1920-1080-1.png?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIn this week’s episode of Space Minds, host David Aireosto speaks with Steve Kitay— former Deputy Assistant Secretary of Defense for Space Policy, former head of Microsoft’s space initiatives, and now Senior Vice President for Space Defense at True Anomaly.\nThe post Space security, threats and rapid innovation appeared first on SpaceNews.",
    "published_at": "2025-10-02T14:21:08Z",
    "updated_at": "2025-10-02T14:30:26.914473Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33399,
    "title": "China’s ‘near space’ legal warfare",
    "authors": [
      {
        "name": "Todd Pennington and Emmy Kanarowski",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/chinas-near-space-legal-warfare/",
    "image_url": "https://spacenews.com/wp-content/uploads/2025/10/G2ADD2LZBZFCTMIAZ4EVCJOE7Y.avif",
    "news_site": "SpaceNews",
    "summary": "\nIn February 2023, a United States Air Force fighter jet shot down a Chinese high-altitude balloon flying at about 60,000-65,000 feet (18-20 km) altitude in sovereign U.S. airspace. After the event, some commentary suggested that the incident raised questions about the supposedly ambiguous or unsettled legal status of high-altitude airspace, sometimes referred to as “near […]\nThe post China’s ‘near space’ legal warfare appeared first on SpaceNews.",
    "published_at": "2025-10-02T13:00:00Z",
    "updated_at": "2025-10-02T13:10:20.812152Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33398,
    "title": "Fly over Xanthe Terra with Mars Express",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/10/Fly_over_Xanthe_Terra_with_Mars_Express",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/10/fly_over_xanthe_terra_with_mars_express/26897957-1-eng-GB/Fly_over_Xanthe_Terra_with_Mars_Express_card_full.png",
    "news_site": "ESA",
    "summary": "ESA’s Mars Express takes us on another mesmerising flight over curving channels carved by water, islands that have resisted erosion, and a maze of hilly terrain.",
    "published_at": "2025-10-02T13:00:00Z",
    "updated_at": "2025-10-02T14:02:17.181402Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "db62cfa1-4d10-41d3-b25f-a58e138ce202",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33397,
    "title": "How America fell behind China in the lunar space race—and how it can catch back up",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/10/how-america-fell-behind-china-in-the-lunar-space-race-and-how-it-can-catch-back-up/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2020/09/46372736004_987b46af12_k.jpg",
    "news_site": "Arstechnica",
    "summary": "Thanks to some recent reporting, we've found a potential solution to the Artemis blues.",
    "published_at": "2025-10-02T11:30:59Z",
    "updated_at": "2025-10-02T11:40:04.502006Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's interim administrator, Sean Duffy, has been giving interviews and speeches around the world. Many people within the space industry, and even at NASA, acknowledge that the US space agency appears to be holding a losing hand. The purpose of this article is to articulate how NASA ended up falling behind China, and how the Western world could realistically retake the lead. NASA lost a decade, spending billions of dollars a year developing \"exploration\" systems for humans. The program's only achievement was to enrich the legacy space contractors. The new leader of NASA, Jim Bridenstine, managed to ditch the Journey to Mars and establish a lunar program. SpaceX's Starship program is not ready to land humans on the Moon. The company's goal is to send humans to Mars. The complexity of the mission will require multiple launches from Earth. Blue Origin's Mark 1 lander could be the answer, but it's not rated for humans. Blue Origin has a contract with NASA to develop the Mark 2 lander. The Mark 2 will not be ready until sometime in the 2030s. A modified version of the Mark 1 lander could be part of an architecture to land humans on the Moon this decade. It would involve \"multiple\" landers to carry crew down to the lunar surface."
  },
  {
    "id": 33396,
    "title": "Preparations on track for second New Glenn launch",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/preparations-on-track-for-second-new-glenn-launch/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/01/NG1-Liftoff-Horizontal.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nPreparations for the second launch of Blue Origin’s New Glenn rocket, carrying a NASA Mars mission, remain on track for liftoff in the next few weeks.\nThe post Preparations on track for second New Glenn launch appeared first on SpaceNews.",
    "published_at": "2025-10-02T11:12:34Z",
    "updated_at": "2025-10-02T11:20:16.733299Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The second launch of Blue Origin’s New Glenn rocket is on track for liftoff in the next few weeks. The rocket itself is also in advanced stages of preparation. The twin ESCAPADE spacecraft arrived in Florida in mid-September and will be fueled in the coming weeks. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. By creating a SpaceNews.com account, you acknowledge that you have read our privacy policy and agree to our terms of terms and conditions. Select an option to continue:"
  },
  {
    "id": 33395,
    "title": "Will Pentagon procurement reforms really stick this time?",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/will-pentagon-procurement-reforms-really-stick-this-time/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/G0WRW6jbAAEIz4P-scaled.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nA mix of executive orders, new contracting approaches and closer ties between defense leaders and investors has some experts believing this latest reform drive may be different from the past.\nThe post Will Pentagon procurement reforms really stick this time? appeared first on SpaceNews.",
    "published_at": "2025-10-02T11:00:00Z",
    "updated_at": "2025-10-02T11:10:18.523388Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "U.S. Space Force procurement chief tours Blue Origin and Vast Space. The outreach to the private sector comes as the Pentagon is scrambling to overhaul its procurement system. President Donald Trump signed an executive order pressing the department to expand its use of commercial technology. Congress is weighing companion legislation that would cut red tape for defense programs. The Space Force has a $40 billion fiscal 2026 request fueled by the Golden Dome missile-defense program. Instead of commissioning a handful of bespoke satellites, the Space Force plans to buy fleets of smaller spacecraft from multiple vendors. The logic is redundancy. If one satellite is disabled in orbit, dozens more can pick up the slack. Space station developer Vast believes commercial infrastructure could one day provide the backbone for a U.S. military presence in space. The Space Force’s plans for rapid innovation hinge on an industrial base that is both financially sound and broad enough to support those aspirations. The lower tiers of the supply chain remain fragile, Teague noted. The challenge will be sustaining momentum. If Congress waters down reform bills or if the Pentagon reverts to its cautious habits, the window could close. Purdy is pressing his officers to get out of the office, into factories and onto venture capital pitch decks. “The Space Force is creating massive opportunities for companies,” Teague says."
  },
  {
    "id": 33394,
    "title": "University of Western Australia unveils optical ground network",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/university-of-western-australia-unveils-optical-ground-network/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_across_australia_diagram_tn2_-_v30.jpg?fit=879%2C412&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – The University of Western Australia (UWA) announced the completion Oct. 2 of TeraNet, which it calls “the first operational optical ground station network in the Southern Hemisphere.” “TeraNet demonstrates the innovation and impact that results from investing in science and technology,” Enrico Palermo, Australian Space Agency head, said in a statement released […]\nThe post University of Western Australia unveils optical ground network appeared first on SpaceNews.",
    "published_at": "2025-10-02T07:02:13Z",
    "updated_at": "2025-10-02T07:10:21.416286Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "TeraNet is comprised of three interconnected optical ground stations. It is the first operational optical ground station network in the Southern Hemisphere. TeraNet will enhance Australia’s reputation as a trusted and capable partner in the global space sector. The network will enhance our ability to connect with spacecraft and future lunar missions."
  },
  {
    "id": 33393,
    "title": "The Exploration Company still studying Mission Possible reentry",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/the-exploration-company-still-studying-mission-possible-reentry/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/06/t14-upperstack.jpeg?fit=1024%2C649&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe Exploration Company is still studying what happened in the final phases of a test flight three months ago that resulted in the loss of the spacecraft.\nThe post The Exploration Company still studying Mission Possible reentry appeared first on SpaceNews.",
    "published_at": "2025-10-02T03:46:03Z",
    "updated_at": "2025-10-02T03:50:27.912997Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Exploration Company launched Mission Possible, a test of a reentry capsule. The 1,600-kilogram spacecraft survived reentry, but contact was lost. The company is moving ahead with its full-scale Nyx cargo vehicle. Nyx is slated for a demonstration mission to the International Space Station in 2028. Get unlimited access to SpaceNews.com for as low as $5 per week. You’ll also receive our weekly SpaceNews This Week newsletter every Friday. Opt-out at any time. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options."
  },
  {
    "id": 33392,
    "title": "China and U.S. take initial steps toward space-traffic coordination",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-and-u-s-take-initial-steps-toward-space-traffic-coordination/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/03/CZ8-Qianfan-group6-HICAL-11march2025-CASC.jpg?fit=1024%2C653&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – Yesterday, the China National Space Agency (CNSA) contacted NASA about a potential on-orbit collision. The CNSA message read, “We would like to recommend you hold still and we’ll do the maneuver,” Alvin Drew, NASA Space Sustainability director and former astronaut, said Oct. 2 at a panel on space sustainability at the International […]\nThe post China and U.S. take initial steps toward space-traffic coordination appeared first on SpaceNews.",
    "published_at": "2025-10-02T03:38:47Z",
    "updated_at": "2025-10-02T03:40:21.484356Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "After decades of operating satellites alongside one another with very little communication, China is beginning to share information with western space powers. Messages also are starting to be shared between Chinese and western commercial satellite operators. Growing number of megaconstellations destined for low-Earth orbit will require “real-time information sharing across all of our agencies,” NASA says. Use the weekly Newsquiz to test your knowledge of stories you saw on SpaceNews.com. Use the Daily Discussion to help students understand today's featured news stories. The Daily Discussion also offers the chance to win a $200 gift card. Use this week's Newsquizz to testyour knowledge of events you saw in the news. Back to the Mail Online home."
  },
  {
    "id": 33391,
    "title": "Meet the Arc spacecraft: it aims to deliver cargo anywhere in the world in an hour",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/10/meet-the-arc-spacecraft-it-aims-to-deliver-cargo-anywhere-in-the-world-in-an-hour/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/Arc-On-Orbit-1.jpg",
    "news_site": "Arstechnica",
    "summary": "\"The key discriminator is, does this make a difference in the moment it's needed?\"",
    "published_at": "2025-10-02T02:00:27Z",
    "updated_at": "2025-10-02T02:10:06.346300Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Inversion, a Los Angeles-based spacecraft company, unveiled its new \"on demand\" delivery vehicle Wednesday. The company said it is building the Arc spacecraft to provide a capability to the US military to deliver as much as 500 pounds (225 kg) of supplies almost anywhere in the world, almost instantaneously. Inversion was founded in early 2021 by two former students of Boston University. Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information. You don’t need to know everything, only what’s important."
  },
  {
    "id": 33390,
    "title": "ExLabs wins Space Force contract for reconfigurable space platform",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/exlabs-wins-space-force-contract-for-reconfigurable-space-platform/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_pressrelease-notext.png?fit=879%2C502&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – The U.S. Space Force has awarded a $1.9 million contract to Southern California startups ExLabs for development of its reconfigurable spacecraft platform. Under the Direct-to-Phase 2 Small Business Innovation Research contract from the Space Force Space Systems Command, ExLabs will develop SERVSAM, “a heavy-class, reconfigurable spacecraft designed for flexible mission profiles in […]\nThe post ExLabs wins Space Force contract for reconfigurable space platform appeared first on SpaceNews.",
    "published_at": "2025-10-01T23:48:07Z",
    "updated_at": "2025-10-01T23:50:18.426176Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33389,
    "title": "States have an obligation to warn satellite operators of cyber threats — IAC paper",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/states-have-an-obligation-to-warn-satellite-operators-of-cyber-threats-iac-paper/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/rsz_maxar_imagery_showed_an_armored_convoy_approaching_kyiv_in_february_2022_.jpg?fit=879%2C476&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSYDNEY, Australia – States have a responsibility to inform citizens, including commercial spacecraft operators, of cyber threats, Diane Howard, former commercial space policy director for the White House National Space Council, said at the International Astronautical Congress here. “States do have a duty to warn, to share credible threat intelligence proactively and to take all […]\nThe post States have an obligation to warn satellite operators of cyber threats — IAC paper appeared first on SpaceNews.",
    "published_at": "2025-10-01T23:08:26Z",
    "updated_at": "2025-10-01T23:10:19.336323Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Diane Howard is former commercial space policy director for the White House National Space Council. Howard: States have a responsibility to inform citizens, including commercial spacecraft operators, of cyber threats. Howard’s research stemmed from her experience working in the U.S. government during the 2022 Russian invasion of Ukraine. SpaceNews.com is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Sign in by entering the code we sent to , or clicking the magic link in the email. You acknowledge that you have read our privacy policy and agree to our terms and conditions."
  }
]