[
  {
    "id": 32803,
    "title": "Katie Bisci: Resourcing for Big Science",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/goddard/katie-bisci-resourcing-for-big-science/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/k-bisci-portraits-0002.jpg",
    "news_site": "NASA",
    "summary": "Deputy Project Manager for Resources – Goddard Space Flight Center How are you helping set the stage for the Roman mission? I’m a deputy project manager for resources on the Nancy Grace Roman Space Telescope team, sharing the role with Kris Steeley. Together, we oversee the business team, finance, outreach, scheduling, and more. I focus […]",
    "published_at": "2025-08-28T12:00:00Z",
    "updated_at": "2025-08-28T12:00:11.230767Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Nancy Grace Roman Space Telescope deputy project manager. Her job is to help along the technical parts of the mission, while supporting cost and schedule control. The Roman team is amazing, and those relationships are what keep me excited to come to work every day. She says the best part about Roman is the people. I’ve learned about how the Hubble Space Telescope , Webb, and Roman all build on each other during my time on this project. It’s really fulfilling to be a small part of something so big. I’m usually at their sports games or chauffeuring them around to one event or another."
  },
  {
    "id": 32802,
    "title": "Izaña-2 joins the laser game to track space debris",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/Izana-2_joins_the_laser_game_to_track_space_debris",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/izana-2_joins_the_laser_game_to_track_space_debris/26850289-3-eng-GB/Izana-2_joins_the_laser_game_to_track_space_debris_card_full.jpg",
    "news_site": "ESA",
    "summary": "In Tenerife, Spain, stands a unique duo: ESA’s Izaña-1 and Izaña-2 laser-ranging stations. Together, they form an optical technology testbed of the European Space Agency that takes the monitoring of space debris and satellites to a new level while maturing new technologies for commercialisation.  ",
    "published_at": "2025-08-28T08:00:00Z",
    "updated_at": "2025-08-28T08:50:15.674979Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Space debris is a threat to satellites and is rapidly becoming a daily concern for satellite operators. The Space Safety Programme helps develop new technologies to detect and track debris. One of these efforts takes place at the Izaña station in Tenerife. There, ESA and partner companies are testing how to deliver precise orbit data on demand with laser-based technologies."
  },
  {
    "id": 32801,
    "title": "Over Soroya Ridge & Onward!",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/over-soroya-ridge-onward/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/mars2020/2025/perseverance-rover-updates/august-2025/Mars_Perseverance_NLF_1597_0808718560_880ECM_N0783588NCAM14597_04_195J.png",
    "news_site": "NASA",
    "summary": "Written by Eleanor Moreland, Ph.D. Student Collaborator at Rice University Perseverance has continued exploring beyond the rim of Jezero crater, spending time last week at Parnasset conducting a mini-campaign on aeolian bedforms. After wrapping up that work, three separate drives brought Perseverance further southeast to an outcrop named Soroya. Soroya was first picked out from […]",
    "published_at": "2025-08-27T21:33:42Z",
    "updated_at": "2025-08-27T22:10:13.746022Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Perseverance spent last week at Parnasset conducting a mini-campaign on aeolian bedforms. Three separate drives brought Perseverance further southeast to an outcrop named Soroya. Soroya was first picked out from orbital images as a target of interest because, as can be seen in the above image, it appears as a much lighter color compared to the surroundings."
  },
  {
    "id": 32800,
    "title": "Live coverage: Record-breaking 30th flight planned for SpaceX Falcon 9 booster as it launches Starlink satellites",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/27/live-coverage-record-breaking-30th-flight-for-spacex-falcon-9-booster-as-it-launches-starlink-satellites/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/04/20250411-Starlink-12-17-Pad-Feature-Image.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-11 mission features the first launch of a booster on its 30th flight. SpaceX is targeting liftoff of its Falcon 9 rocket from Launch Complex 39A at 1:27 a.m. EDT (0527 UTC). ",
    "published_at": "2025-08-27T20:15:16Z",
    "updated_at": "2025-08-27T20:20:20.474781Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " SpaceX second Starlink launch in 24 hours will see the flight of a Falcon 9 booster for a record-setting 30th time. Liftoff from pad 39A at NASA’s Kennedy Space Center is scheduled for 1:27 a.m. EDT (0527 UTC) Thursday. Starlink 10-11 mission will place another 28 Starlink V2 Mini broadband internet satellites into the low Earth orbit constellation."
  },
  {
    "id": 32798,
    "title": "Russia’s state-run human spaceflight company may be near bankruptcy",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/russias-state-run-human-spaceflight-company-may-be-near-bankruptcy/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-1747269738.jpg",
    "news_site": "Arstechnica",
    "summary": "\"A significant part of the team has lost motivation and a sense of shared responsibility.\"",
    "published_at": "2025-08-27T19:54:54Z",
    "updated_at": "2025-08-27T20:00:07.153842Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Igor Maltsev, chief of RSC Energia, says his corporation is in a \"critical\" state. He says the company is struggling to pay wages and deliver products it is contracted to build. \"A significant part of the team has lost motivation and a sense of shared responsibility,\" he says. Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information. After all, you don’t need to know everything, only what’s important."
  },
  {
    "id": 32799,
    "title": "Patagonia Glacier retreat, Chile",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/earth/patagonia-glacier-retreat-chile/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/multimedia/images-of-change/Patagonia_Retreat_Comb_2.jpg",
    "news_site": "NASA",
    "summary": "Patagonia, Chile. Left: September 18, 1986. Right: August 5, 2002. The 1986 image shows the region prior to a major retreat of the glaciers. The 2002 image shows a retreat of nearly 10 kilometers (6.2 miles) of the glacier on the left side. The smaller glacier on the right has receded more than 2 kilometers (1.2 miles). In front of the smaller glacier, two ribbon lakes have formed behind the debris left by the glacier’s advance. Scientists and government managers are using satellite imagery like this to monitor the retreat of the glaciers and the impact on water bodies caused by the changes in the glaciers’ size and direction.",
    "published_at": "2025-08-27T19:24:14Z",
    "updated_at": "2025-08-27T20:10:15.454745Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. NASA Earth Science helps Americans respond to challenges and societal needs — such as wildland fires, hurricanes, and water supplies. Explore Earth Science data at: http://www.nasa.gov/earth."
  },
  {
    "id": 32797,
    "title": "The Starship Program rises from the ashes of Block 2 with Ship 37",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/starship-rises-ashes-block-2-ship-37/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/08-26-25_Starship_Flight_10_5D3-9688-4-wmarked-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Going into Flight 10, SpaceX was having a down year with the Starship program. Following…\nThe post The Starship Program rises from the ashes of Block 2 with Ship 37 appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-27T19:13:16Z",
    "updated_at": "2025-08-27T19:20:10.877941Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has completed Flight 10 of the Starship program. The first attempt was scrubbed due to problems with the supply line for LOX. Crews used a motorized winch at the top of the tower to reinstall a new supply hose. Flight 10 ended with both vehicles performing controlled splashdowns in the water. SpaceX's Starship Flight 10 took off from Pad 1 (A) at 6:30:00 p.m. Central Daylight Time. This was the second-to-last flight of a Block 2 booster with Booster 15-2 slated to be the last one to fly. The SpaceX logistics team brought in around 38 Liquid Nitrogen (LN2) tankers and around 40 LOX tankers. Ship 37 made it through reentry with no major problems. The aft flaps partially came apart, possibly due to hot-staging damage, and then early reentry tore them both open. The port or left side engine chill lines ruptured under the aft flap fairing and punched a hole into the ship’s drive section skirt."
  },
  {
    "id": 32796,
    "title": "SpaceX completes 400th Falcon booster landing on a drone ship",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/27/spacex-completes-400th-falcon-booster-landing-on-a-drone-ship/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250827_B1095-2_JRTI_landing.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The accomplishment came during Wednesday’s flight of the Starlink 10-56 mission from Cape Canaveral Space Force Station. The touchdown was also SpaceX’s 494th overall successful booster landing. ",
    "published_at": "2025-08-27T18:56:28Z",
    "updated_at": "2025-08-27T19:00:27.846095Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A Falcon 9 rocket placed another 28 Starlink satellites into orbit shortly after sunrise on Wednesday. The B1095 first stage booster, making its second flight, touched down on the drone ship ‘Just Read the Instructions’ (JRTI) stationed in the Atlantic Ocean east of the Carolinas. The majority of the 400 aquatic landings have occurred on SpaceX’s drone ship, ‘Of Course I Still Love You’ SpaceX released a new batch of photos showing the Feb. 6 liftoff of the company’s first Falcon Heavy rocket from pad 39A at the Kennedy Space Center in Florida. Liftoff from Space Launch Complex 40 happened at 8:32 p.m. EDT (0032 UTC) The crucial pre-launch engine test has been repeatedly delayed."
  },
  {
    "id": 32795,
    "title": "Meet NASA’s Artemis II Moon Mission Masterminds",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/artemis/artemis-2/meet-nasas-artemis-ii-moon-mission-masterminds/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/launchcontrolteam3.jpg",
    "news_site": "NASA",
    "summary": "As four astronauts venture around the Moon on NASA’s Artemis II test flight in 2026, many people will support the journey from here on Earth. Teams directing operations from the ground include the mission management team, launch control team, flight control team, and the landing and recovery team, each with additional support personnel who are […]",
    "published_at": "2025-08-27T18:25:26Z",
    "updated_at": "2025-08-27T18:30:08.113979Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Four astronauts will venture around the Moon on NASA’s Artemis II test flight in 2026. Teams directing operations from the ground include the mission management team, launch control team, flight control team and the landing and recovery team. The teams have managed every aspect of the test flight and ensure NASA is prepared. Orion will reenter Earth’s atmosphere at roughly 25,000 mph to about 20 mph for a parachute-assisted splashdown. Rick Henfling and the team will monitor weather forecasts for landing. Landing and recovery team will be in the hands of Lili Villarreal, who served as deputy flow director for Artemis I."
  },
  {
    "id": 32794,
    "title": "Strap In! NASA Aeroshell Material Takes Extended Space Trip",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/langley/strap-in-nasa-aeroshell-material-takes-extended-space-trip/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/hiadstrap.jpg",
    "news_site": "NASA",
    "summary": "Components of a NASA technology that could one day help crew and cargo enter harsh planetary environments, like that of Mars, are taking an extended trip to space courtesy of the United States Space Force. On Aug. 21, several pieces of webbing material, known as Zylon, which comprise the straps of the HIAD (Hypersonic Inflatable […]",
    "published_at": "2025-08-27T17:01:32Z",
    "updated_at": "2025-08-27T17:10:15.561115Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Several pieces of webbing material, known as Zylon, comprise the straps of the HIAD (Hypersonic Inflatable Aerodynamic Decelerator) aeroshell developed by NASA. The HIAD technology could allow larger spacecraft to safely descend through the atmospheres of celestial bodies like Mars, Venus, and even Saturn’s moon, Titan."
  },
  {
    "id": 32793,
    "title": "NASA Seeks Volunteers to Track Artemis II Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/humans-in-space/commercial-space/nasa-seeks-volunteers-to-track-artemis-ii-mission/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2023/03/art001e001999_orig.jpg",
    "news_site": "NASA",
    "summary": "NASA seeks volunteers to passively track the Artemis II Orion spacecraft as the crewed mission travels to the Moon and back to Earth. The Artemis II test flight, a launch of the agency’s SLS (Space Launch System) rocket and Orion spacecraft, will send NASA astronauts Reid Wiseman, Victor Glover, and Christina Koch, along with CSA […]",
    "published_at": "2025-08-27T15:37:12Z",
    "updated_at": "2025-08-27T15:42:13.455656Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "41699701-2ef4-4b0c-ac9d-6757820cde87",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": " Artemis II test flight will send NASA astronauts Reid Wiseman, Victor Glover, and Christina Koch, along with CSA (Canadian Space Agency) astronaut Jeremy Hansen, on an approximately 10-day mission around the Moon. The mission, targeted for no later than April 2026, will rely on NASA’s Near Space Network and Deep Space Network for primary communications and tracking support."
  },
  {
    "id": 32792,
    "title": "Portrait of an Astronaut",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/portrait-of-an-astronaut/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/54434141863-7757af4db2-o.jpg",
    "news_site": "NASA",
    "summary": "NASA astronaut Zena Cardman poses for a portrait in a photography studio on March 22, 2024, at NASA’s Johnson Space Center in Houston, Texas. Cardman is currently aboard the International Space Station, where she perform research, technology demonstrations, and maintenance activities. Recently, she took a robotics test on a computer for the portion of the […]",
    "published_at": "2025-08-27T15:10:11Z",
    "updated_at": "2025-08-27T15:42:03.703551Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronaut Zena Cardman is currently aboard the International Space Station. Cardman launched to the space station on NASA’s SpaceX Crew-11 mission. Members of Crew- 11 will contribute to NASA's Artemis program by simulating Moon landing scenarios that future crews may encounter near the lunar South Pole."
  },
  {
    "id": 32791,
    "title": "Algae bloom chlorophyll South Australia",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/Algae_bloom_chlorophyll_South_Australia",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/algae_bloom_chlorophyll_south_australia/26850185-1-eng-GB/Algae_bloom_chlorophyll_South_Australia_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-27T13:18:00Z",
    "updated_at": "2025-08-27T15:41:51.667071Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Chlorophyll-a is a key indicator of the presence of algae in the ocean. The bloom, first detected in mid-March 2025 around the Fleurieu Peninsula, is caused by the marine dinoflagellate Karenia mikimotoi. While the algae is not classified as toxic to humans, it can irritate the skin and eyes."
  },
  {
    "id": 32789,
    "title": "ESA and JAXA advance potential Apophis mission collaboration",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Space_Safety/Planetary_Defence/ESA_and_JAXA_advance_potential_Apophis_mission_collaboration",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/07/esa_s_ramses_mission_at_the_asteroid_apophis/26824036-1-eng-GB/ESA_s_Ramses_mission_at_the_asteroid_Apophis_card_full.jpg",
    "news_site": "ESA",
    "summary": "The Japan Aerospace Exploration Agency (JAXA) has requested funding to participate in the European Space Agency’s (ESA) Rapid Apophis Mission for Space Safety (Ramses).",
    "published_at": "2025-08-27T12:00:00Z",
    "updated_at": "2025-08-27T15:42:32.100037Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "03756d3f-98c2-42b6-942f-db3960c96274",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Japan Aerospace Exploration Agency ( JAXA ) has requested funding to participate in the European Space Agency’s (ESA) Rapid Apophis Mission for Space Safety ( Ramses) Ramses is ESA's proposed mission to rendezvous with the 375 m asteroidApophis and accompany it through a safe but exceptionally close flyby of Earth in 2029. Researchers would use the data gathered by Ramses to improve our ability to defend our planet from any asteroids."
  },
  {
    "id": 32788,
    "title": "Webb investigates complex heart of a cosmic butterfly",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_investigates_complex_heart_of_a_cosmic_butterfly",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/butterfly_nebula_ngc_6302_hubble_webb_alma_images/26848710-1-eng-GB/Butterfly_Nebula_NGC_6302_Hubble_Webb_ALMA_images_card_full.jpg",
    "news_site": "ESA",
    "summary": "The NASA/ESA/CSA James Webb Space Telescope has revealed new details in the core of the Butterfly Nebula, NGC 6302. From the dense, dusty torus that surrounds the star hidden at the centre of the nebula to its outflowing jets, the Webb observations reveal many new discoveries that paint a never-before-seen portrait of a dynamic and structured planetary nebula.",
    "published_at": "2025-08-27T08:00:00Z",
    "updated_at": "2025-08-27T08:00:18.946284Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Butterfly Nebula is located about 3400 light-years away in the constellation Scorpius. It is one of the best-studied planetary nebulas in our galaxy. This stunning nebula was previously imaged by the NASA/ESA Hubble Space Telescope. Now, Webb has captured a new view of this nebula. Team also spotted light emitted by carbon-based molecules known as polycyclic aromatic hydrocarbons. They form flat, ring-like structures, much like the honeycomb shapes found in beehives. This may be the first-ever evidence of PAHs forming in a oxygen-rich planetary nebula."
  },
  {
    "id": 32675,
    "title": "Aurora Australis over Concordia station",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/Aurora_Australis_over_Concordia_station",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/aurora_australis_over_concordia_station/26843757-1-eng-GB/Aurora_Australis_over_Concordia_station_card_full.jpg",
    "news_site": "ESA",
    "summary": "The Aurora Australis, photographed over Concordia station in July 2025, during the ongoing solar activity maximum, the peak of the Sun's 11-year cycle. ",
    "published_at": "2025-08-27T08:00:00Z",
    "updated_at": "2025-08-20T08:50:11.122359Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Aurora Australis appears when charged particles from the Sun are guided by Earth’s magnetic field towards the polar regions. Concordia station, perched high on Antarctica’‘Dome C plateau, is one of the most remote research outposts on Earth. Each year, ESA sponsors a medical doctor to live and work at Concordia."
  },
  {
    "id": 32787,
    "title": "Avio and Isar Aerospace Win ESA Flight Ticket Initiative Launch Contracts",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/avio-and-isar-aerospace-win-esa-flight-ticket-initiative-launch-contracts/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Avio-and-Isar-Aerospace-Win-ESA-Flight-Ticket-Initiative-Launch-Contracts.webp",
    "news_site": "European Spaceflight",
    "summary": "The European Space Agency has awarded launch service contracts to Avio and Isar Aerospace under its Flight Ticket Initiative. Announced in October 2023, the Flight Ticket Initiative is a programme run jointly by ESA and the European Union that offers subsidised flight opportunities for European companies and organisations seeking to demonstrate new satellite technologies in […]\nThe post Avio and Isar Aerospace Win ESA Flight Ticket Initiative Launch Contracts appeared first on European Spaceflight.",
    "published_at": "2025-08-27T07:24:13Z",
    "updated_at": "2025-08-27T07:30:11.219749Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "European Space Agency has awarded launch service contracts to Avio and Isar Aerospace under its Flight Ticket Initiative. The contracts will support the launches of the ISISpace Cassini and Infinite Orbits Tom & Jerry missions, both set to fly aboard Isar aerospace rockets from 2026 onwards. Each launch opportunity would carry a maximum award of €5 million."
  },
  {
    "id": 32786,
    "title": "Flight Ticket Initiative: first five missions secured with Avio and Isar Aerospace",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Space_Transportation/Boost/Flight_Ticket_Initiative_first_five_missions_secured_with_Avio_and_Isar_Aerospace",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/flight_ticket_initiative/26849504-2-eng-GB/Flight_Ticket_Initiative_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-27T06:35:00Z",
    "updated_at": "2025-08-27T07:10:11.102608Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Flight Ticket Initiative is a collaboration between the European Space Agency (ESA) and the European Commission. It allows European companies and institutions to test and prove new products and applications in space. It encourages the use of new European launchers. Testing prototypes in space provides valuable insight for research projects and unlocks the market potential of commercial applications."
  },
  {
    "id": 32785,
    "title": "SpaceX successfully launches Super Heavy-Starship on critical test flight",
    "authors": [
      {
        "name": "William Harwood",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/27/spacex-successfully-launches-super-heavy-starship-on-critical-test-flight/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250826_Starship_Flight-10_liftoff.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "While re-entry heating damaged a protective \"skirt\" around the the engine bay of the upper stage Starship, along with partially melting a control flap near its hinge, the vehicle remained under control throughout and made it all the way to a powered splashdown in the Indian Ocean as planned. ",
    "published_at": "2025-08-27T05:49:30Z",
    "updated_at": "2025-08-27T05:50:17.623932Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX launches its Super Heavy-Starship rocket for the 10th time. The rocket is the most powerful ever built, with 16 million pounds of thrust. A launch try Sunday was called off because of trouble with ground equipment. A second attempt Monday was blocked by cloudy weather. SpaceX's Starship rocket is designed to fly itself back to a launch gantry for mid-air capture. SpaceX has not yet attempted a return-to-launch-site with a Starship. The company fired up nine Merlin main engines at the bottom of a previously-flown Falcon 9 booster. A United Launch Alliance Atlas 5 rocket is set to roll to its launch pad Wednesday. The launch of a SpaceX Falcon 9 rocket with a Spanish communications satellite is expected to be shuffled after the Atlas 5 flight. The mission marked the 200th Falcon 9 launch from pad 40 at Cape Canaveral Space Force Station."
  },
  {
    "id": 32784,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/27/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-10/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/06/20250605_Falcon-9_night_pad_file.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The mission is poised to feature the 400th successful booster landing on a droneship. Liftoff from pad 40 at Cape Canaveral Space Force Station is scheduled for 7:10 a.m. EDT (1110 UTC). ",
    "published_at": "2025-08-27T05:36:49Z",
    "updated_at": "2025-08-27T05:40:23.271578Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Starlink 10-56 mission will add another 28 Starlink V2 Mini satellites into low Earth orbit roughly an hour after launch. Liftoff from Space Launch Complex 40 is scheduled for 7:10 a.m. EDT (1110 UTC) SpaceX will use the Falcon 9 first stage booster, tail number 1095, to launch this mission, which will fly for a second time."
  },
  {
    "id": 32783,
    "title": "A Great Day for Starship",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/a-great-day-for-starship/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Starship-with-dimensions-IFT10-276x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "SpaceX got some much needed good news today with a successful Starship flight test. After three failures in a row, tonight’s suborbital Integrated Flight Test-10 seemed to be flawless with […]",
    "published_at": "2025-08-27T02:24:01Z",
    "updated_at": "2025-08-27T02:30:15.977153Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "After three failures in a row, tonight’s suborbital Integrated Flight Test-10 seemed to be flawless with launch, payload deployment, in-space engine relight, and soft landings of the booster in the Gulf and the ship in the Indian Ocean. The previous three tests in January, March, and May ended in RUDs — Rapid Unscheduled Disassemblies. Under the $2.9 billion contract with NASA, SpaceX must first fly an uncrewed demonstration flight that lands on the Moon’s South Pole and lifts off again. If he misses that November-December 2026 window, he’ll have to wait another 26 months before the Earth and Mars are properly aligned to try again."
  },
  {
    "id": 32781,
    "title": "Inside NASA’s New Orion Mission Evaluation Room for Artemis II",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/artemis/orion/inside-nasas-new-orion-mission-evaluation-room-for-artemis-ii/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/jsc2025e070712.jpg",
    "news_site": "NASA",
    "summary": "As NASA’s Orion spacecraft is carrying crew around the Moon on the Artemis II mission, a team of expert engineers in the Mission Control Center at NASA’s Johnson Space Center in Houston will be meticulously monitoring the spacecraft along its journey. They’ll be operating from a new space in the mission control complex built to […]",
    "published_at": "2025-08-26T20:46:20Z",
    "updated_at": "2025-08-26T20:50:05.787438Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Orion Mission Evaluation Room will be monitoring the spacecraft during the Artemis II mission. The room is staffed around the clock throughout the nearly 10 day mission, up until the spacecraft has been safely secured inside the U.S. Navy ship that will recover it after splashdown. The evaluation room will operate in three daily shifts, beginning about 48 hours prior to liftoff. Asteroid Bennu will be sampled by NASA’s OSIRIS-REx mission in 2020. Bennu is a mixture of dust that could be used to study the solar system. NASA explores the unknown in air and space, innovates for the benefit of humanity."
  },
  {
    "id": 32782,
    "title": "Live coverage: SpaceX tries for third time to launch Starship Flight 10 from Starbase, Texas",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/26/live-coverage-spacex-tries-for-third-time-to-launch-starship-flight-10-from-starbase-texas/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250826_Starship_Flight-10_sunset.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX will make its latest attempt following scrubs due to ground systems issues and then poor weather. Liftoff from Pad A at Starbase is scheduled for 6:30 p.m. CDT (7:30 p.m. EDT / 2330 UTC). ",
    "published_at": "2025-08-26T20:46:02Z",
    "updated_at": "2025-08-26T20:50:15.355974Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is hoping to launch its massive Starship rocket on its third launch attempt on Tuesday evening. SpaceX will not attempt to catch the Super Heavy booster, tail number B16. Instead, SpaceX plans to preform a controlled water landing in the Gulf and demonstrate that it can safely land in an off-nominal scenario."
  },
  {
    "id": 32780,
    "title": "Live coverage: SpaceX to launch Falcon 9 rocket on rideshare mission from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/26/live-coverage-spacex-to-launch-falcon-9-rocket-on-rideshare-mission-from-vandenberg-sfb/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The mission features OHB Italia’s NAOS satellite along with seven other secondary satellites. SpaceX is targeting liftoff from pad 4E at Vandenberg Space Force Base at 11:53 a.m. PDT (2:53 p.m. EDT / 1853 UTC). ",
    "published_at": "2025-08-26T16:36:51Z",
    "updated_at": "2025-08-26T16:40:34.080511Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for its 37th Falcon 9 rocket launch from Vandenberg. The orbital flight features an Italian defense satellite along with nine other rideshare payloads. The mission featuring OHB Italia’s NAOS (National Advanced Optical System) spacecraft will fly on a southerly trajectory after taking off from Space Launch Complex 4 East. SpaceX’s Falcon 9 rocket disintegrated shortly after launch from Cape Canaveral on Sunday. This was the second of two back-to-back overnight launches. “We’re proud to continue enabling fast, reliable access to space for industry leaders like Capella Space, Pixxel and more,” Dhruva Space said."
  },
  {
    "id": 32779,
    "title": "Launch Roundup: Starship, NS-35, and Falcon 9 launches planned",
    "authors": [
      {
        "name": "Aaron McCrea",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/launch-roundup-08-25-25/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Gy7aFPMXMAAkg8X.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "Eight launches are scheduled this week by SpaceX, Blue Origin, and CSNA. CSNA will kick…\nThe post Launch Roundup: Starship, NS-35, and Falcon 9 launches planned appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-26T16:13:40Z",
    "updated_at": "2025-08-26T16:20:11.110850Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 10th flight of Starship is expected to liftoff on Aug. 26 at 6:30 PM CDT (23:30 UTC) The week’s first batch of Starlink satellites is launching into LEO on a Falcon 9. Blue Origin is scheduled to launch New Shepard on the NS-35 mission on August 27. Starlink Group 10-14 is launching on Aug. 30 at 7:38 AM EDT (11:38 UTC) from SLC-40 at CCSFS. This mission will carry 28 Starlink v2 Mini satellites to a LEO with a 53.16-degree inclination. The booster, B1077, will attempt to land on SpaceX’s autonomous droneship, Just Read the Instructions."
  },
  {
    "id": 32769,
    "title": "Reaching Out",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/reaching-out/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/msh1552-lg.jpg",
    "news_site": "NASA",
    "summary": "This image released on Aug. 20, 2025, combines new radio data from the Australia Telescope Compact Array with X-ray data from NASA’s Chandra X-ray Observatory. Chandra first released an image of this pulsar and its surrounding hand-shaped nebula in 2009. The new data provides a fresh view of this exploded star and its environment, which […]",
    "published_at": "2025-08-26T16:08:59Z",
    "updated_at": "2025-08-26T16:10:05.711054Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Image released on Aug. 20, 2025, combines new radio data from the Australia Telescope Compact Array with X-ray data from NASA. Chandra first released an image of this pulsar and its surrounding hand-shaped nebula in 2009. The new data provides a fresh view of this exploded star and its environment."
  },
  {
    "id": 32768,
    "title": "Google’s AI model just nailed the forecast for the strongest Atlantic storm this year",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/science/2025/08/googles-ai-model-just-nailed-the-forecast-for-the-strongest-atlantic-storm-this-year/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20252281710_GOES19-ABI-taw-GEOCOLOR-1800x1080-1.jpg",
    "news_site": "Arstechnica",
    "summary": "If they improve further, AI weather models may very well become the gold standard.",
    "published_at": "2025-08-26T14:43:41Z",
    "updated_at": "2025-08-26T14:50:13.036968Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Google unveiled a new model designed specifically to forecast the tracks and intensity of tropical cyclones. The \"Weather Lab\" model for cyclones was a bit of an unknown for meteorologists at its launch. Google's model beat the \"official\" track forecast from the National Hurricane Center. The fact that Google's model beat the consensus models is significant. From a forecast standpoint, the period of three to five days out is the most important. This is when important decisions about evacuations and other hurricane preparations need to be made. If these models improve further, they may very well become the gold standard for certain types of weather prediction."
  },
  {
    "id": 32766,
    "title": "The Exploration Company’s Nyx Spacecraft Passes Initial ISS Safety Review",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/the-exploration-companys-nyx-spacecraft-passes-initial-iss-safety-review/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/The-Exploration-Companys-Nyx-Spacecraft-Passes-Initial-ISS-Safety-Review.webp",
    "news_site": "European Spaceflight",
    "summary": "The Exploration Company’s reusable Nyx Earth spacecraft has passed Phase 1 of the International Space Station Safety Review, confirming that the spacecraft’s preliminary design meets all hazard-control requirements for visiting vehicles. Nyx Earth is being developed to ferry cargo and, eventually, crew, to and from low Earth orbit destinations. The company’s first mission to the […]\nThe post The Exploration Company’s Nyx Spacecraft Passes Initial ISS Safety Review appeared first on European Spaceflight.",
    "published_at": "2025-08-26T14:05:00Z",
    "updated_at": "2025-08-26T14:10:23.603558Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Exploration Company’s reusable Nyx Earth spacecraft has passed Phase 1 of the International Space Station Safety Review. Nyx is being developed to ferry cargo and, eventually, crew, to and from low Earth orbit destinations. The company's first mission to the ISS in 2028 will deliver 2,600 kilograms of supplies."
  },
  {
    "id": 32770,
    "title": "NASA Test Deploys Roman Space Telescope Solar Panels, ‘Visor’",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasa-test-deploys-roman-space-telescope-solar-panels-visor/",
    "image_url": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2023/01/nasa-logo-web-rgb.png",
    "news_site": "NASA",
    "summary": "On Aug. 7 and 8, NASA’s Nancy Grace Roman Space Telescope team assessed the observatory’s solar panels and a visor-like sunshade called the deployable aperture cover — two components that will be stowed for launch and unfold in space. Engineers confirmed their successful operation during a closely monitored sequence in simulated space-like conditions. On the […]",
    "published_at": "2025-08-26T14:00:00Z",
    "updated_at": "2025-08-26T16:10:05.751085Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Nancy Grace Roman Space Telescope team assessed observatory's solar panels and sunshade. Roman slated to launch no later than May 2027. Engineers confirmed successful operation during a closely monitored sequence in simulated space-like conditions. On the first day, Roman’s outer solar panels were deployed one at a time."
  },
  {
    "id": 32771,
    "title": "NASA Stennis Provides Ideal Setting for Range Operations",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/stennis/an-ideal-setting-for-range-operations/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2016/06/dsc-0992-range-airspace-operations-drone.jpg",
    "news_site": "NASA",
    "summary": "Think of NASA’s Stennis Space Center, and one likely thinks of rocket propulsion testing. The site has a long history of testing to support the nation’s space efforts, including the current Artemis program to send astronauts to the Moon to prepare for future human exploration of Mars. However, NASA Stennis also is working to become […]",
    "published_at": "2025-08-26T14:00:00Z",
    "updated_at": "2025-08-26T16:10:05.769362Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA Stennis has its own protected airspace, similar to how airports control the skies around them. It operates two main airspace zones – a propulsion testing area extending from ground level up to 12,000 feet for safely testing rocket engines. The centerpiece of the NASA Stennis marine range is its extensive 7.5-mile canal system. The NASA Stennis federal city already hosts more than 50 federal, state, academic, public, and private aerospace, technology, and research organizations. “NASA Stennis is open for business, and we want to provide a user-friendly range for operators to test vehicles,” Peterson said."
  },
  {
    "id": 32767,
    "title": "Four laser links over 300 million kilometres: ESA concludes daring optical communication campaign",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Operations/Four_laser_links_over_300_million_kilometres_ESA_concludes_daring_optical_communication_campaign",
    "image_url": "https://www.esa.int/extension/pillars/design/pillars/images/nebula.jpg",
    "news_site": "ESA",
    "summary": "Over the summer, the European Space Agency ran an optical communication demonstration campaign using two observatories on Earth and NASA’s Psyche mission. All four optical links were successful.",
    "published_at": "2025-08-26T13:38:00Z",
    "updated_at": "2025-08-26T15:04:59.757773Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "66133437-db31-4098-8e3e-cf34c8125f9b",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots of the U.S. for next week. Visit CNN.com/Travel each week for a new gallery of snapshots. Visit www.dailymail.co.uk/travel for the latest."
  },
  {
    "id": 32790,
    "title": "ESA wraps up 300-million-kilometre optical communication campaign",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Operations/ESA_wraps_up_300-million-kilometre_optical_communication_campaign",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/esa_s_ground_laser_transmitter_shooting_lasers_at_nasa_s_psyche_sped_up_1000_times/26849687-2-eng-GB/ESA_s_Ground_Laser_Transmitter_shooting_lasers_at_NASA_s_Psyche_sped_up_1000_times_card_full.gif",
    "news_site": "ESA",
    "summary": "Over the summer, the European Space Agency ran an optical communication demonstration campaign using two observatories on Earth and NASA’s Psyche mission. All four optical links were successful.",
    "published_at": "2025-08-26T13:38:00Z",
    "updated_at": "2025-08-27T15:42:19.651960Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "66133437-db31-4098-8e3e-cf34c8125f9b",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "ESA successfully completed a series of four increasingly complex deep-space optical communication links with NASA’s Deep Space Optical Communications (DSOC) experiment aboard the Psyche spacecraft. Each link demanded greater accuracy, longer distances, and more refined operations, culminating in a final transmission that pushed the boundaries of what's possible in interplanetary laser communications. Helmos Observatory in Greece was ESA’s main operations hub. Team coordinated every pass, including interface between GLR, GLT and JPL. Data will undergo detailed analysis to evaluate performance of each system. A GLR-twin is now under development to be paired with larger telescopes, with a validation campaign planned in Chile in 2026."
  },
  {
    "id": 32765,
    "title": "Time moves fast when you are preparing for liftoff!",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/Time_moves_fast_when_you_are_preparing_for_liftoff",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/time_moves_fast_when_you_are_preparing_for_liftoff/26847605-1-eng-GB/Time_moves_fast_when_you_are_preparing_for_liftoff_card_full.png",
    "news_site": "ESA",
    "summary": " ",
    "published_at": "2025-08-26T09:50:00Z",
    "updated_at": "2025-08-26T10:50:10.631509Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "MetOp-SG-A1 was launched aboard an Ariane 6 rocket from the European spaceport in French Guiana, on 13 August at 02:37 CEST (12 August 21:37 Kourou time) This new weather satellite also carries the Copernicus Sentinel-5 mission to deliver daily global data."
  },
  {
    "id": 32764,
    "title": "Gaia proves our skies are filled with chains of starry gatherings",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Gaia/Gaia_proves_our_skies_are_filled_with_chains_of_starry_gatherings",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2019/08/stellar_families_in_gaia_s_sky/19677629-1-eng-GB/Stellar_families_in_Gaia_s_sky_card_full.jpg",
    "news_site": "ESA",
    "summary": "In the past decade, the European Space Agency’s Gaia mission has revealed the nature, history, and behaviour of billions of stars. Our pioneering stargazer has reshaped our view of the skies around us like no other, revealing that star clusters are more connected than expected over vast distances.",
    "published_at": "2025-08-26T08:00:00Z",
    "updated_at": "2025-08-26T08:12:23.768093Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "2044f8a1-4dad-4c8b-a3a9-5ecc7045c257",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The European Space Agency’s Gaia mission has revealed the nature, history, and behaviour of billions of stars. Since it opened its eyes in 2014, Gaia has mapped how different stars zip through space and pinpointed their whereabouts more precisely than ever. The telescope has watched whether they shrink and swell, spotted surprising ‘ starquakes ’, monitored how stars grow, evolve, and crystallise as they die. Gaia has revolutionised our view of the solar neighbourhood, allowing scientists to comprehensively map all the stars and interstellar ‘stuff’ near the Sun in a way they were unable to do before. Scientists have also applied Artificial Intelligence (AI) to Gaia data, using algorithms and machine learning approaches to pinpoint new cluster members and subgroups of stars. In this way, Gaia has pushed us to rethink how we hunt for stellar groups.  Gaia has shown that structures resembling streams, beads, strings, pearls, snakes, rings, or filaments of stars are reasonably common in young cluster formation. It has also revealed that large-scale galactic dynamics influence how young star clusters form in the first place. Thanks to Gaia, open clusters are no longer seen as isolated entities but as dynamically evolving structures, slowly dissolving into our galaxy. Gaia has now completed its sky-scanning observations and, as of March 2025, is quietly orbiting the Sun in its retirement orbit. The vast majority of data collected by the spacecraft is yet to be released, with a couple of huge data releases planned by the end of the decade. Scientists are already using Gaia’s treasure trove of released observations to explore billions of stars and objects in our galaxy and beyond."
  },
  {
    "id": 32772,
    "title": "Curiosity Blog, Sols 4638-4640: Imaging Extravaganza Atop a Ridge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4638-4640-imaging-extravaganza-atop-a-ridge/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04636_opgs_edr_ncam_NLB_809060540EDR_F1181752NCAM00254M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Conor Hayes, Graduate Student at York University Earth planning date: Friday, Aug. 22, 2025 Curiosity is continuing its winding path through the mysterious boxwork structures that have been a major focus of the last several months of the mission. After driving away from “Río Frío,” we are now parked on top of a […]",
    "published_at": "2025-08-26T04:38:45Z",
    "updated_at": "2025-08-26T16:10:05.785557Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "This weekend plan is packed with a lot of good science. The highlight of Mastcam’s work in this plan is the large 44-image mosaic of the north crater rim. ChemCam will be taking several RMI images of Mishe Mokwa and a distant outcrop. Mastcam also gets involved in the environmental fun with a tau to track the amount of dust in the air."
  },
  {
    "id": 32763,
    "title": "Weather Scrubs Second Starship IFT-10 Launch Attempt",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/weather-scrubs-second-starship-ift-10-launch-attempt/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/IFT10-webcast-9-Aug-25-25-218x300.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "SpaceX is still trying to get its 10th Starship Integrated Flight Test, IFT-10, off the ground.  Yesterday’s attempt was canceled because of a ground-side liquid oxygen leak. Today’s was scrubbed […]",
    "published_at": "2025-08-26T02:08:26Z",
    "updated_at": "2025-08-26T02:10:20.441778Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is still trying to get its 10th Starship Integrated Flight Test, IFT-10, off the ground. Yesterday’s attempt was canceled because of a ground-side liquid oxygen leak. SpaceX might try again tomorrow. Musk made a surprise appearance on the launch webcast sharing his views on the need for a multiplanetary species. NASA contracted with SpaceX in 2021 for a Starship Human Landing System (HLS) to put NASA astronauts on the lunar surface in 2024. SpaceX must perform an uncrewed lunar landing demonstration first and fire the engines to show it can lift off the surface. Getting American astronauts back on the Moon before China puts taikonauts there is a unifying goal of Republicans and Democrats."
  },
  {
    "id": 32762,
    "title": "ICEYE Secures €9.38M in Funding from Poland’s National Development Bank",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/iceye-secures-e9-38m-in-funding-from-polands-national-development-bank/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/ICEYE-Secures-E9.38M-in-Funding-from-Polands-National-Development-Bank.webp",
    "news_site": "European Spaceflight",
    "summary": "Earth observation data provider and satellite manufacturer ICEYE has secured over PLN 40 million (€9.38 million) in new funding from Vinci S.A., an investment vehicle of Bank Gospodarstwa Krajowego (BGK), Poland’s National Development Bank. As an investment vehicle for BGK, Vinci S.A. is tasked with investing in the commercialization and expansion of Polish startups. According […]\nThe post ICEYE Secures €9.38M in Funding from Poland’s National Development Bank appeared first on European Spaceflight.",
    "published_at": "2025-08-25T21:50:16Z",
    "updated_at": "2025-08-25T22:00:12.527446Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "ICEYE has secured over PLN 40 million (€9.38 million) in new funding from Vinci S.A. Vinci is an investment vehicle of Bank Gospodarstwa Krajowego (BGK), Poland’s National Development Bank."
  },
  {
    "id": 32761,
    "title": "Vulcan Begins Operational Missions",
    "authors": [
      {
        "name": "Nik Alexander",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/08/vulcan-begins-operational-missions/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/08/joebvulcan-scaled.jpg",
    "news_site": "Space Scout",
    "summary": "On August 12, 2025 at 8:56 p.m. EDT (0056 UTC), United Launch Alliance successfully launched its Vulcan Centaur VC4S vehicle from Space Launch Complex-41 at Cape Canaveral Space Force Station for the USSF-106 mission.",
    "published_at": "2025-08-25T17:20:40Z",
    "updated_at": "2025-08-25T17:30:22.638781Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "On August 12, 2025 at 8:56 p.m. EDT (0056 UTC), United Launch Alliance successfully launched its Vulcan Centaur VC4S vehicle. This was the third overall flight of the Vulcan rocket but its first to carry national security payloads. The ascent was nominal, despite an SRB nozzle anomaly on flight 2 which led to a lengthy stand down. Vulcan successfully launched USSF-106 from Cape Canaveral on April 4, 2025. The launch was part of the second round of the National Security Space Launch program. The program seeks to distribute vital government payloads across industry to prevent potential bottlenecks. The path to operational Vulcan flights has been marred with challenges, with the company encountering several key issues."
  },
  {
    "id": 32759,
    "title": "With a new Soyuz rocket, Russia seeks to break its Ukrainian dependency",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/with-a-new-soyuz-rocket-russia-seeks-to-break-its-ukrainian-dependency/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2202741417.jpg",
    "news_site": "Arstechnica",
    "summary": "Now you Zenit, now you don't",
    "published_at": "2025-08-25T17:17:20Z",
    "updated_at": "2025-08-25T17:20:05.930051Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Soyuz-5 will be Russia's new medium-lift rocket. The rocket has been in development since 2016 and largely repurposes older technology. It takes rocket elements formerly made in Ukraine and now manufactures them in Russia. Full operational service is not expected to begin until 2028. The vehicle's debut has been repeatedly pushed back, however, with Russia now expected to debut the vehicle no earlier than 2030. Ars Technica has been separating the signal from the noise for over 25 years. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, Ars is the trusted source in a sea of information."
  },
  {
    "id": 32760,
    "title": "Live coverage: SpaceX preps for Starship Flight 10 following Sunday scrub",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/25/live-coverage-spacex-preps-for-starship-flight-10-following-sunday-scrub/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250825_Starship_Flight-10.jpg",
    "news_site": "Spaceflight Now",
    "summary": "SpaceX Founder and Chief Engineer Elon Musk said on his social media site, X, that the scrub was caused by a “Ground side liquid oxygen leak (that) needs to be fixed.” The launch is scheduled for no earlier than Monday, Aug. 25, at 6:30 p.m. CDT (7:30 p.m. EDT / 2330 UTC). ",
    "published_at": "2025-08-25T17:12:46Z",
    "updated_at": "2025-08-25T17:20:18.614471Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for its second attempt to launch the 10th test flight of a Starship rocket from southern Texas as soon as Monday evening. Liftoff from Pad A at Starbase is scheduled for 6:30 p.m. CDT (7:30pm. EDT / 2330 UTC), which is the opening of the hour-long launch window. SpaceX announced on social media that it was scrubbing the Sunday launch attempt to “allow time to troubleshoot an issue with ground systems” SpaceX will perform a multi-hour experiment on the second stage of a Falcon 9 rocket after the launcher deploys a Dragon supply ship on the way to the International Space Station. Orbital ATK and SpaceX won Pentagon contracts worth a combined value of up to $241 million Wednesday."
  },
  {
    "id": 32773,
    "title": "From NASA Citizen Scientist to Astronaut Training: An Interview with Benedetta Facini",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/astrophysics/from-nasa-citizen-scientist-to-astronaut-training-an-interview-with-benedetta-facini/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/citizen-science/highlights/2025/Benedetta-facini.jpg",
    "news_site": "NASA",
    "summary": "Titans Space Industries, a commercial space company, selected a new cohort of astronaut candidates this spring – and among them is NASA citizen scientist, Benedetta Facini. She has participated in not one, but many NASA citizen science projects: Cloudspotting on Mars, Active Asteroids, Daily Minor Planet, GLOBE, Exoasteroids and International Astronomical Collaboration (IASC). We asked […]",
    "published_at": "2025-08-25T16:01:37Z",
    "updated_at": "2025-08-26T16:10:05.802018Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Benedetta Facini is a NASA citizen scientist. She has participated in not one, but many NASA citizen science projects. Facini was selected as an Astronaut Candidate by the commercial space company, Titans Space Industries. She shares her advice for other citizen scientists and people who want to become astronauts. For aspiring astronauts, my advice is to gain as much experience as possible. Academic results are important but hands-on skills, teamwork, adaptability, and real experiences are also important. Don’t be afraid to ask for help and interact with other colleagues because the goal of the NASA Citizen Science program is international collaboration."
  },
  {
    "id": 32774,
    "title": "NASA’s X-59 at Sunrise",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-x-59-at-sunrise/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/p25-056-49orig.jpg",
    "news_site": "NASA",
    "summary": "NASA’s X-59 quiet supersonic research aircraft sits on the ramp at sunrise before ground tests at Lockheed Martin’s Skunk Works facility in Palmdale, California, on July 18, 2025. Following completion of low-speed taxi tests in July 2025 in Palmdale, California, medium- and high-speed taxi tests mark the final steps before the aircraft takes to the skies for […]",
    "published_at": "2025-08-25T15:49:32Z",
    "updated_at": "2025-08-26T16:10:05.814943Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The X-59 is the centerpiece of NASA’s Quesst mission, which aims to demonstrate quiet supersonic flight. Low-speed taxi tests in July 2025 in Palmdale, California, mark the final steps before the aircraft takes to the skies for the first time."
  },
  {
    "id": 32775,
    "title": "Washington State Student Wins 2025 NASA Art Contest",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/langley/washington-state-student-wins-2025-nasa-art-contest/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/my-wonders-with-you-grand-prize-12th-grade-winner.jpg",
    "news_site": "NASA",
    "summary": "A Washington state high school student with a passion for art, space exploration, and a curiosity about the possibility of life on other planets earned the grand prize for the 2025 NASA Student Art Contest. Dahyun Jung’s winning piece, titled “My Wonders with You,” shows a child seated on the roof of a barn, their […]",
    "published_at": "2025-08-25T15:36:32Z",
    "updated_at": "2025-08-26T16:10:05.827903Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Dahyun Jung’s winning piece, titled “My Wonders with You,” shows a child seated on the roof of a barn, their arm draped around a dog, watching a space shuttle blast off in the distance. Jung used Procreate, a digital illustration and painting app, to create her award-winning work. Jung was one of more than 2,300 kindergarten through 12 th grade students who participated in the 2025 art contest. NASA Langley Research Center is located in Virginia. Langley is home to the Langley Institute for Space Studies. The Langley institute is a part of NASA Langley, which is based in Washington, D.C. It is also home to NASA's Langley Science Center."
  },
  {
    "id": 32776,
    "title": "Astronomers Map Stellar ‘Polka Dots’ Using NASA’s TESS, Kepler",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/tess/astronomers-map-stellar-polka-dots-using-nasas-tess-kepler/",
    "image_url": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2023/01/nasa-logo-web-rgb.png",
    "news_site": "NASA",
    "summary": "Scientists have devised a new method for mapping the spottiness of distant stars by using observations from NASA missions of orbiting planets crossing their stars’ faces. The model builds on a technique researchers have used for decades to study star spots. By improving astronomers’ understanding of spotty stars, the new model — called StarryStarryProcess — […]",
    "published_at": "2025-08-25T15:06:35Z",
    "updated_at": "2025-08-26T16:10:05.838976Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Scientists have devised a new method for mapping the spottiness of distant stars. Model builds on a technique researchers have used for decades to study star spots. By improving astronomers’ understanding of spotty stars, the new model — called StarryStarryProcess — can help discover more about planetary atmospheres and potential habitability. Astronomers think the planet is a gas giant about five times bigger than Earth and 32 times its mass. The StarryStarryProcess analysis suggests that the planet’s cool, dim star — called TOI 3384 — has concentrations of spots at its north pole. Pandora, a small satellite developed through NASA's Astrophysics Pioneers Program, will study the atmospheres of exoplanets."
  },
  {
    "id": 32777,
    "title": "NASA Accepts Proposals for 2026 Student Launch Challenge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/marshall/nasa-accepts-proposals-for-2026-student-launch-challenge/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/sl26-handbook-cover.png",
    "news_site": "NASA",
    "summary": "NASA is kicking off the 2026 Student Launch challenge, looking for new student teams to design, build, and launch high-powered rockets with a scientific or engineering payload next April.  The agency is seeking proposals until Monday, Sept. 22. Details about this year’s challenge are in the 2026 handbook, which outlines the requirements for middle school, high school, […]",
    "published_at": "2025-08-25T14:53:40Z",
    "updated_at": "2025-08-26T16:10:05.860637Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is looking for new student teams to design, build, and launch high-powered rockets with a scientific or engineering payload next April. Final launches are scheduled for April 25, at Bragg Farms in Toney, Alabama, near NASA’s Marshall Space Flight Center in Huntsville, Alabama. The Artemis II crew will be the first humans to test NASA’s Orion spacecraft. For the fourth year in a row, the American Association of Physics Teachers, a collaborator with NASA, is sponsoring the Student Launch Challenge. From January through June 2025, the Education Outreach… Learning Resources Marshall STEM Engagement How to Apply for the Student launch challenge."
  },
  {
    "id": 32778,
    "title": "Harmonized Landsat and Sentinel-2: Collaboration Drives Innovation",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/harmonized-landsat-and-sentinel-2-collaboration-drives-innovation/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-feature-article-banner.png",
    "news_site": "NASA",
    "summary": "Introduction Landsat, a joint program of NASA and the U.S. Geological Survey (USGS), has been an invaluable tool for monitoring changes in Earth’s land surface for over 50 years. Researchers use instruments on Landsat satellites to monitor decades-long trends, including urbanization and agricultural expansion, as well as short-term dynamics, including water use and disaster recovery. […]",
    "published_at": "2025-08-25T14:40:09Z",
    "updated_at": "2025-08-26T16:10:05.876171Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Harmonized Landsat and Sentinel-2 (HLS) project is a NASA initiative that created a seamless product from the Operational Land Imager (OLI) and Multi-Spectral Instrument (MSI) HLS Version 2.0 (V2.0) is the most recent version of these data and had a global median repeat frequency of 1.6 days in 2022. HLS data are available for download on NASA Earthdata: HLSL30v3.0 and HLSS30v4.0 . HLS V2.0 provides data at a spatial resolution of 30 m (98 ft) with near-global coverage from 2013 onward. HLS V1.4 covered about 30% of the global land area, providing data on North America and other select locations. The increased frequency of observations improved the ability of the scientific community to track disaster recovery. On average, DIST-ALERT is made available on LP DAAC within six hours of when new HLS data is available. Currently, the dataset does not provide attribution to disturbances. HLS V2.0 data are also better at identifying disturbances in cloudy ecosystems than other individual alert systems."
  },
  {
    "id": 32758,
    "title": "Cargo ship docks with International Space Station",
    "authors": [
      {
        "name": "William Harwood",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/25/cargo-ship-docks-with-international-space-station/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250825_crs33_docking.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "Launched Sunday from Cape Canaveral Space Force Station atop a Falcon 9 rocket, the cargo Dragon closed out a 28-hour rendezvous with an ahead-of-schedule docking at the lab's forward port at 7:05 a.m. EDT as the two spacecraft were passing 260 miles above the Ivory Coast of Africa. ",
    "published_at": "2025-08-25T13:45:43Z",
    "updated_at": "2025-08-25T17:10:18.859051Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Tortillas are a crumb-free bread substitute for crews dining in weightlessness. The Dragon also brought an add-on thruster kit to help boost the space station’s altitude. A Russian Soyuz rocket rolled out to a launch pad in Kazakhstan early Thursday in preparation for liftoff Saturday."
  },
  {
    "id": 32757,
    "title": "ESA data records help underpin climate change report",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Space_for_our_climate/ESA_data_records_help_underpin_climate_change_report",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/soil_moisture_anomalies_over_2024_compared_to_1991_2020/26846786-1-eng-GB/Soil_moisture_anomalies_over_2024_compared_to_1991_2020_card_full.gif",
    "news_site": "ESA",
    "summary": "According to the newly released 35th State of the Climate report, 2024 saw record highs in greenhouse gas concentrations, global land and ocean temperatures, sea levels, and ocean heat content. Glaciers also suffered their largest annual ice loss on record. Data records from ESA’s Climate Change Initiative helped underpin these findings.",
    "published_at": "2025-08-25T11:49:00Z",
    "updated_at": "2025-08-25T14:10:20.100605Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 35th State of the Climate report has been published by the Bulletin of the American Meteorological Society. 2024 saw record highs in greenhouse gas concentrations, global land and ocean temperatures, sea levels, and ocean heat content. Glaciers suffered their largest annual ice loss on record. Data records from ESA’s Climate Change Initiative helped underpin these findings. Permafrost stores nearly 1700 billion tonnes of frozen and thawing carbon. Anthropogenic warming threatens to release an unknown quantity of this carbon to the atmosphere. Sometimes permafrost can thaw rapidly, but scientists are unsure why and what these abrupt thaws mean in terms of feedback loops."
  }
]