[
  {
    "id": 33191,
    "title": "Quantum Space acquires Phase Four propulsion assets",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/quantum-space-acquires-phase-four-propulsion-assets/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/06/quantum-ranger.jpeg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nQuantum Space is acquiring propulsion technologies and facilities from Phase Four to support development of its Ranger maneuverable spacecraft.\nThe post Quantum Space acquires Phase Four propulsion assets appeared first on SpaceNews.",
    "published_at": "2025-09-22T10:52:29Z",
    "updated_at": "2025-09-22T11:00:37.061155Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33190,
    "title": "Live coverage: NRO, SpaceX to launch reconnaissance satellites on Falcon 9 rocket from Vandenberg SFB",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/22/live-coverage-nro-spacex-to-launch-reconnaissance-satellites-on-falcon-9-rocket-from-vandenberg-sfb/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/03/20250320_NROL_57_Vertical_small.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The NROL-48 mission will be the fifth mission this year supporting the National Reconnaissance Office’s expansive low Earth orbit statellite constellation it calls the proliferated architecture. Liftoff from pad 4E is scheduled for 10:38 a.m. PDT (1:38 p.m. EDT / 1738 UTC).",
    "published_at": "2025-09-22T10:25:49Z",
    "updated_at": "2025-09-22T11:14:40.814620Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "86d62815-9266-481b-951e-e53670d27341",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33189,
    "title": "Mars’s atmospheric mille-feuille",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/Mars_s_atmospheric_mille-feuille",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/mars_s_atmospheric_mille-feuille/26874563-1-eng-GB/Mars_s_atmospheric_mille-feuille_card_full.png",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-22T04:00:00Z",
    "updated_at": "2025-09-22T09:54:45.476733Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "0b675aa8-0a78-4ed6-bbca-6916c8a7206b",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33188,
    "title": "NASA Safety Panel Estimates Significant Delays for Starship HLS",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/nasa-safety-panel-estimates-significant-delays-for-starship-hls/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2024/05/Paul-Hill-225x300.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "NASA’s Aerospace Safety Advisory panel is warning that SpaceX’s Starship Human Landing System (HLS) could be “years late” for the Artemis III mission that is supposed to take place in […]",
    "published_at": "2025-09-22T03:52:13Z",
    "updated_at": "2025-09-22T04:00:18.992703Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA’s Aerospace Safety Advisory Panel is warning that SpaceX's Starship Human Landing System (HLS) could be “years late” for the Artemis III mission that is supposed to take place in mid-2027. The assessment comes after three ASAP members visited SpaceX's Starbase facility in Boca Chica, TX and met with top SpaceX officials. While they were quite impressed with SpaceX's manufacturing and operations tempo, they nonetheless found the schedule for HLS is “significantly challenged.  ASAP has been recommending since 2023 that NASA reevaluate the “high number of individual risks and mission firsts” associated with Artemis III. ASAP was created by Congress in 1968 following the 1967 Apollo 1 tragedy that killed NASA astronauts Virgil “Gus” Grissom, Ed White, and Roger Chaffee."
  },
  {
    "id": 33187,
    "title": "XRISM observes windy neutron star, Chandra studies a luminous quasar",
    "authors": [
      {
        "name": "Martijn Luinstra",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/gx131-racs-j03200-35/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/xrism_chandra_lead_image.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Using the joint Japan Aerospace Exploration Agency (JAXA), European Space Agency (ESA), and NASA X-Ray…\nThe post XRISM observes windy neutron star, Chandra studies a luminous quasar appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-21T22:52:24Z",
    "updated_at": "2025-09-21T23:00:19.023599Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Using the joint Japan Aerospace Exploration Agency (JAXA), European Space Agency (ESA), and NASA X-Ray Imaging and Spectroscopy Mission (XRISM), scientists uncovered a dense but surprisingly slow wind coming from a neutron star. Another team used NASA’s Chandra X-ray Observatory to study an ancient supermassive black hole growing at extreme rates. When the neutron star lit up, it exceeded its so-called Eddington limit. As matter falls into the object, it releases energy, and with more matter falling in, the amount of energy released increases as well. This energy pushes back on the material falling in and capping the rate at which matter can fall in. The intense radiation at the EdDington limit blows away the material surrounding the neutronstar, creating a cosmic wind. This phenomenon is also observed around supermassive black holes. RACS J0320−35 might hint at the nature of recently discovered “little red dots” found scattered throughout the early universe. These dots first showed up in 2022, in some of the first observations from the James Webb Space Telescope (JWST) Astronomers have since been looking for an explanation."
  },
  {
    "id": 33186,
    "title": "What’s Happening in Space Policy September 21-27, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-september-21-27-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2024/01/Artemis-II-crew-NASA-300x196.webp",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week of September 21-27, 2025 and any insight we can offer about them. The House and Senate are in recess […]",
    "published_at": "2025-09-21T16:19:08Z",
    "updated_at": "2025-09-21T16:20:16.177846Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The House and Senate are in recess this week except for pro forma sessions. NASA begins a three-day human spaceflight extravaganza at Johnson Space Center. Washington Post reporter Christian Davenport will talk about his new book at two events in D.C. this week. On Friday, the House passed a Republican version of a Continuing Resolution (CR) that would keep the government open through November 21. All but one Democrat opposed it, and all but two Republicans supported it. The Senate then defeated that bill as well as a Democratic alternative (through October 31) that insists on including a provision extending Affordable Health Care premium subsidies. Both votes were on largely partisan lines."
  },
  {
    "id": 33185,
    "title": "Shutdown Showdown September 2025: The State of Play 10 Days Out",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/shutdown-showdown-september-2025-the-state-of-play-10-days-out/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/cr-1-300x91.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Unless Congress and the President can reach agreement in the next 10 days, there will be a government shutdown on October 1. Both sides say they do not want that […]",
    "published_at": "2025-09-21T16:09:14Z",
    "updated_at": "2025-09-21T16:10:16.427413Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Congress has not passed the FY2026 appropriations bills needed to fund the government when the new fiscal year begins on October 1. A Continuing Resolution is needed to keep the government open until the 12 regular appropriations bills are signed into law. Agencies typically are kept at their current funding levels under a CR and new programs cannot begin nor existing programs terminated. CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel each week for a new gallery of snapshots. Visit http://www.dailymail.co.uk/travel/features/tourists-tourist-tours-takes-pictures.shtml."
  },
  {
    "id": 33184,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/09/20/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-12/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/02/20250211_Starlink_12-18_prelaunch.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-27 mission will be the 280th orbital launch for SpaceX from Cape Canaveral Space Force Station. Liftoff from Space Launch Complex 40 is scheduled for 6:53 a.m. EDT (1053 UTC). ",
    "published_at": "2025-09-20T23:19:41Z",
    "updated_at": "2025-09-20T23:20:18.104216Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing for a near sunrise Falcon 9 launch from Cape Canaveral on Sunday. The Starlink 10-27 mission will send 28 Starlink V2 Mini satellites into low Earth orbit. The rocket will head away from Florida’s Space Coast on a north-easterly trajectory. Spaceflight Now will have live coverage beginning about an hour prior to liftoff."
  },
  {
    "id": 33183,
    "title": "NASA safety panel warns Starship lunar lander could be delayed by years",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-safety-panel-warns-starship-lunar-lander-could-be-delayed-by-years/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/06/starshiphls.jpg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNASA safety advisers say they doubt the lunar lander version of SpaceX’s Starship will be ready to support the Artemis 3 mission as planned in 2027.\nThe post NASA safety panel warns Starship lunar lander could be delayed by years appeared first on SpaceNews.",
    "published_at": "2025-09-20T19:13:55Z",
    "updated_at": "2025-09-20T19:20:19.140654Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA safety advisers say they doubt the lunar lander version of SpaceX’s Starship will be ready to support the Artemis 3 mission as planned in 2027. Members of the Aerospace Safety Advisory Panel said they believed the Human Landing System, or HLS, version of Starship could be “years late” Get unlimited access to SpaceNews.com now. As low as $5 per week * Cancel anytime. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options   Enter the code sent to your email. Enter your password. Sign in to an existing account."
  },
  {
    "id": 33182,
    "title": "Ship 38 on Pad 1 for Static Fire testing as Masseys rebuild continues",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/09/ship-38-pad-1-static-fire-masseys-rebuild/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/09/Starbase-Texas-from-the-air-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "As SpaceX presses on with attempts to complete static fire testing with Ship 38 ahead…\r\nThe post Ship 38 on Pad 1 for Static Fire testing as Masseys rebuild continues appeared first on NASASpaceFlight.com.",
    "published_at": "2025-09-20T18:32:08Z",
    "updated_at": "2025-09-20T18:59:29.771232Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "41068e09-4097-448f-ac7c-421c19b6aab9",
        "provider": "Launch Library 2"
      }
    ],
    "events": [
      {
        "event_id": 1289,
        "provider": "Launch Library 2"
      }
    ],
    "detailed_news": "Following the anomaly with Ship 36, SpaceX has made significant progress in rebuilding the test stand. Crews have nearly rebuilt the entire Methane tank farm, upgrading storage capacity with the addition of a new horizontal tank. SpaceX is also using its own valve skids for both the Liquid Oxygen (LOX) and Liquid Methane (LCH4) sides of the tank farm. SpaceX has rolled test tank B18.3 out to Masseys. This test tank is designed to evaluate the hot stage truss, new grid fin cavities, and the rest of the forward section of the Block 3 booster. Gigabay construction has made significant progress, with crews completing seven concrete pours so far. Ship 38 has had two aborted attempts at a static fire. SpaceX needs permission to build on the wetlands, tidal flats, and uplands that they own south of the current launch site. To fly Block 3 and later from that location, SpaceX must upgrade the pad to the newer design. SpaceX is expected to have the required land swap credits by early 2026."
  },
  {
    "id": 33181,
    "title": "CNES Pushes FROG-H Reusable Rocket Demonstrator Debut to 2026",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/cnes-pushes-frog-h-reusable-rocket-demonstrator-debut-to-2026/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/CNES-Push-Frog-H-Reusable-Rocket-Demonstrator-Debut-to-2026.webp",
    "news_site": "European Spaceflight",
    "summary": "The French space agency CNES has confirmed to European Spaceflight that the debut of its upgraded FROG reusable rocket demonstrator has been pushed to 2026. The FROG-H vehicle had been expected to complete initial test flights in early 2025. The Rocket for GNC Demonstration (FROG) initiative was launched by the CNES Launch Vehicles Directorate in […]\nThe post CNES Pushes FROG-H Reusable Rocket Demonstrator Debut to 2026 appeared first on European Spaceflight.",
    "published_at": "2025-09-20T15:32:51Z",
    "updated_at": "2025-09-20T15:40:10.028945Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "French space agency CNES has confirmed that the debut of its upgraded FROG reusable rocket demonstrator has been pushed to 2026. The FROG-H vehicle had been expected to complete initial test flights in early 2025. In addition to FROG, CNES is also working on the Callisto reusable rocket programme."
  },
  {
    "id": 33180,
    "title": "NASA revives VIPER lunar rover mission with Blue Origin lander award",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/nasa-revives-viper-lunar-rover-mission-with-blue-origin-lander-award/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/viper-bluemoon.jpeg?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "NASA has revived a robotic lunar rover mission by selecting Blue Origin to deliver it to the moon’s south pole in 2027.\r\nThe post NASA revives VIPER lunar rover mission with Blue Origin lander award appeared first on SpaceNews.",
    "published_at": "2025-09-20T06:07:43Z",
    "updated_at": "2025-09-20T06:57:06.355196Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "c5ebc8b1-ae7f-4e8d-8619-99bbe0d8025a",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "NASA has revived a robotic lunar rover mission by selecting Blue Origin. Blue Origin will deliver it to the moon’s south pole in 2027. VIPER will search for water ice at the lunar south pole, including in permanently shadowed craters. In July 2024, NASA said it would cancel VIPER , citing cost overruns. Get unlimited access to SpaceNews.com for as low as $5 per week. You’ll also receive our weekly SpaceNews This Week newsletter every Friday. Opt-out at any time. Sales tax may apply. No refunds. (*Billed quarterly) See all subscription options."
  },
  {
    "id": 33179,
    "title": "The Ancient Mars Variety Show",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/the-ancient-mars-variety-show/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/mars2020/2025/perseverance-rover-updates/Mars_Perseverance_SIF_1620_0810758550_902EBY_N0790198SRLC02501_0000LMJ.png",
    "news_site": "NASA",
    "summary": "Written by Melissa Rice, Professor of Planetary Science at Western Washington University Perseverance accomplished something unusual this week: abrading two dramatically different rocks within the span of a few days. While exploring the Vernodden area along Jezero crater’s rim, the rover has been studying what might be “megablocks,” a variety of ancient crustal materials with […]",
    "published_at": "2025-09-19T23:09:16Z",
    "updated_at": "2025-09-20T00:10:15.156071Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Mars Perseverance rover abraded two dramatically different rocks within the span of a few days. While exploring the Vernodden area along Jezero crater's rim, the rover has been studying what might be \"megablocks\" The ancient fragments can help the Science Team reconstruct the complex geological processes that shaped early Mars billions of years ago."
  },
  {
    "id": 33178,
    "title": "VIPER Might Have A New Ride to the Moon on Blue Origin",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/viper-might-have-a-new-ride-to-the-moon-on-blue-origin/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/09/Blue-Moon-with-VIPER-BO-300x225.webp",
    "news_site": "SpacePolicyOnline.com",
    "summary": "NASA’s much-anticipated but imperiled VIPER lunar rover got some good news today. More than a year after NASA announced it was terminating the mission even though the rover is completely […]",
    "published_at": "2025-09-19T22:42:18Z",
    "updated_at": "2025-09-19T22:50:24.052849Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA awarded a contract to Blue Origin to take initial steps that, if successful, could lead to VIPER flying on Blue Origin’s Blue Moon MK1 lander. VIPER is an option and NASA won’t decide whether to exercise that option until step one is completed. Astrobotic had been awarded a fixed price contract of $323 million to deliver VIPER to the lunar surface through CLPS. The lunar science community and Congress reacted negatively to the decision and NASA decided to issue a call for expressions of interest by organizations that might want to take over the project. Astrobotic said in an emailed statement today they had decided not to submit a bid."
  },
  {
    "id": 33177,
    "title": "Amid budget uncertainty, NASA gets some good news: Use House funding levels",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/amid-budget-uncertainty-nasa-gets-some-good-news-use-house-funding-levels/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/12/GettyImages-1133641758-1.jpg",
    "news_site": "Arstechnica",
    "summary": "The House budget still cuts science at NASA, but not as deeply as the White House sought.",
    "published_at": "2025-09-19T22:38:10Z",
    "updated_at": "2025-09-19T22:50:14.026277Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Congress has not passed a final budget for fiscal year 2026, which begins on October 1. The White House proposed significant cuts to NASA's budget. The House budget proposes to keep funding levels nearly identical to the current fiscal year. This does not support full funding for NASA's science portfolio, but is far more beneficial than the cuts sought by the White House."
  },
  {
    "id": 33176,
    "title": "After a very slow start, Europe’s reusable rocket program shows signs of life",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/after-a-very-slow-start-europes-reusable-rocket-program-shows-signs-of-life/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/G1Mh6O7WAAApPeJ.jpg",
    "news_site": "Arstechnica",
    "summary": "Although Themis is making progress, the program is several years behind schedule.",
    "published_at": "2025-09-19T22:06:43Z",
    "updated_at": "2025-09-19T22:20:04.701236Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Themis is a prototype rocket that will test various landing technologies. Low-altitude hop tests, a precursor for developing a rocket's first stage that can vertically land after an orbital launch, could start late this year or early next. Although Themis is making progress, the program is several years behind schedule."
  },
  {
    "id": 33175,
    "title": "China promotes direct-to-device satellite services with new guidelines and licensing",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/china-promotes-direct-to-device-satellite-services-with-new-guidelines-and-licensing/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/Guowang-group10-CZ8A-HCSLC-25aug2025-ourspace1.jpg?fit=1024%2C589&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nChina has moved to promote direct-to-device (D2D) services through issuing guidelines and licensing a telecommunications firm, signaling a strategic push into a globally competitive arena.\nThe post China promotes direct-to-device satellite services with new guidelines and licensing appeared first on SpaceNews.",
    "published_at": "2025-09-19T21:10:47Z",
    "updated_at": "2025-09-19T21:20:22.816571Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33174,
    "title": "NASA Selects Blue Origin to Deliver VIPER Rover to Moon’s South Pole",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-selects-blue-origin-to-deliver-viper-rover-to-moons-south-pole/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/mk1-viper-render100.jpg",
    "news_site": "NASA",
    "summary": "As part of the agency’s Artemis campaign, NASA has awarded Blue Origin of Kent, Washington, a CLPS (Commercial Lunar Payload Services) task order with an option to deliver a rover to the Moon’s South Pole region. NASA’s VIPER (Volatiles Investigating Polar Exploration Rover) will search for volatile resources, such as ice, on the lunar surface […]",
    "published_at": "2025-09-19T20:24:02Z",
    "updated_at": "2025-09-19T20:30:04.928275Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA has awarded Blue Origin of Kent, Washington, a CLPS task order with an option to deliver a rover to the Moon’s South Pole region. VIPER (Volatiles Investigating Polar Exploration Rover) will search for volatile resources, such as ice, on the lunar surface. The VIPER rover will study the distribution and origin of volatiles across the solar system. It will also help us better understand the processes that have shaped our space environment. Through CLPS, American companies continue to demonstrate leadership in commercial space advancing capabilities and accomplishing NASA’s goal for a commercial lunar economy."
  },
  {
    "id": 33173,
    "title": "ArianeGroup Completes Themis Integration Ahead of Combined Tests",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/arianegroup-completes-themis-integration-ahead-of-combined-tests/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/ArianeGroup-Completes-Themis-Integration-Ahead-of-Combined-Tests.webp",
    "news_site": "European Spaceflight",
    "summary": "ArianeGroup has announced that the first Themis reusable rocket demonstrator has been fully integrated and is on its own four legs on a launch pad in Sweden. The demonstrator will now be put through a combined test campaign before an initial low-altitude hop test is performed. ESA Member States adopted the Themis programme in November […]\nThe post ArianeGroup Completes Themis Integration Ahead of Combined Tests appeared first on European Spaceflight.",
    "published_at": "2025-09-19T18:44:39Z",
    "updated_at": "2025-09-19T18:50:11.965487Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "ArianeGroup has completed the integration of the first Themis reusable rocket demonstrator. The demonstrator will now be put through a combined test campaign before an initial low-altitude hop test is performed. Themis programme is being funded by the European Space Agency and the European Union."
  },
  {
    "id": 33172,
    "title": "Live Event: The Space Investment Horizon",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/live-event-the-space-investment-horizon/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Space-Investment-Horizon-2000x1500-Webinar.png?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nFor more than six decades, the United States has pursued the promise of nuclear power in space — a technology capable of delivering energy where sunlight can’t reach and enabling missions beyond the limits of chemical propulsion. Yet since a brief reactor flight in 1965, no fission reactor has operated in orbit.\nThe post Live Event: The Space Investment Horizon appeared first on SpaceNews.",
    "published_at": "2025-09-19T18:33:33Z",
    "updated_at": "2025-09-19T18:40:26.416629Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Website owner? If you think you have reached this message in error, please contact support. You have been rate-limited for making too many requests in a short time frame. You may also want to consider switching to a different version of the site. For more information on how to switch to a new version, please visit the site's support page."
  },
  {
    "id": 33171,
    "title": "NASA’s Orion Spacecraft Secures Critical Abort System Hardware for Artemis II",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-orion-spacecraft-secures-critical-abort-system-hardware-for-artemis-ii/",
    "image_url": "https://images-assets.nasa.gov/image/KSC-20250917-PH-FMX01_0037/KSC-20250917-PH-FMX01_0037~large.jpg",
    "news_site": "NASA",
    "summary": "All the pieces are stacking up – literally – for NASA’s first crewed mission of the Artemis program coming in 2026. Teams are finishing integration of the Orion spacecraft for the Artemis II test flight with its launch abort system on Sept. 17 inside the Launch Abort System Facility at NASA’s Kennedy Space Center in […]",
    "published_at": "2025-09-19T17:56:44Z",
    "updated_at": "2025-09-19T18:00:11.024080Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33170,
    "title": "Shaping the new era of space",
    "authors": [
      {
        "name": "SpaceNews Editor",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/shaping-the-new-era-of-space/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/revillon-novaspace-ceo-series-spaceminds-2000-1500-scaled.jpg?fit=1024%2C768&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nIn this week’s special CEO Series edition of Space Minds, we're at the World Space Business Week in Paris. In today's episode, SpaceNews editor Mike Gruss talks with Pacome Revillon, CEO of Novaspace. \nThe post Shaping the new era of space appeared first on SpaceNews.",
    "published_at": "2025-09-19T15:53:42Z",
    "updated_at": "2025-09-19T16:00:25.696699Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33169,
    "title": "Novaspace Recognizes 2025 Excellence Award Winners in Satellite Connectivity, Earth Observation, and Startup Challenge at World Space Business Week",
    "authors": [
      {
        "name": "Novaspace",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/novaspace-recognizes-2025-excellence-award-winners-in-satellite-connectivity-earth-observation-and-startup-challenge-at-world-space-business-week/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/04/novaspace-square-1-scaled.png?fit=1024%2C1024&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nParis, September 19, 2025 – Novaspace proudly recognized the 2025 winners of its Annual Excellence Awards and the WSBW Startup Challenge during the 28th edition of the World Space Business […]\nThe post Novaspace Recognizes 2025 Excellence Award Winners in Satellite Connectivity, Earth Observation, and Startup Challenge at World Space Business Week appeared first on SpaceNews.",
    "published_at": "2025-09-19T14:54:51Z",
    "updated_at": "2025-09-19T15:00:31.830246Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33168,
    "title": "A Beacon to Space",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/a-beacon-to-space/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/1-pia26662-dsc4667-enhanced-nr-f100bb.jpg",
    "news_site": "NASA",
    "summary": "In this infrared photograph taken on June 2, 2025, the Optical Communications Telescope Laboratory at NASA’s Jet Propulsion Laboratory’s Table Mountain Facility near Wrightwood, California, beams its eight-laser beacon to the Deep Space Optical Communications (DSOC) flight laser transceiver aboard NASA’s Psyche spacecraft. At the time, when Psyche was about 143 million miles (230 million […]",
    "published_at": "2025-09-19T14:32:42Z",
    "updated_at": "2025-09-19T14:40:05.364376Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33167,
    "title": "Building Saudi Arabia’s space champion",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/building-saudi-arabias-space-champion/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/NSG_WSBW0003-scaled.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nNeo Space Group CEO Martijn Blanken explains how the Saudi-backed space services company is balancing sovereign demand with global ambitions.\nThe post Building Saudi Arabia’s space champion appeared first on SpaceNews.",
    "published_at": "2025-09-19T13:38:07Z",
    "updated_at": "2025-09-19T13:40:19.540310Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33166,
    "title": "Week in images: 15-19 September 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_15-19_September_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/earth_from_space_komodo_island_indonesia/26875244-1-eng-GB/Earth_from_Space_Komodo_Island_Indonesia_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 15-19 September 2025",
    "published_at": "2025-09-19T13:10:00Z",
    "updated_at": "2025-09-19T13:30:19.015344Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33165,
    "title": "American leadership at Apophis",
    "authors": [
      {
        "name": "Alexander MacDonald, Jim Bell and Dani Mendoza DellaGiustina",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/american-leadership-at-apophis/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/08/apophis-illus.jpeg?fit=1024%2C576&ssl=1",
    "news_site": "SpaceNews",
    "summary": "We are fewer than four years away from what may be the most significant near-Earth asteroid event of the 21st century. On April 13, 2029, the asteroid Apophis — named for the Egyptian god of chaos — will pass so close to Earth that it will be visible to the naked eye across much of […]\r\nThe post American leadership at Apophis appeared first on SpaceNews.",
    "published_at": "2025-09-19T13:00:00Z",
    "updated_at": "2025-09-19T15:01:03.417349Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33162,
    "title": "Rocket Report: European rocket reuse test delayed; NASA tweaks SLS for Artemis II",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/09/rocket-report-european-rocket-reuse-test-delayed-nasa-tweaks-sls-for-artemis-ii/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/LOW-RES_Spectrum-Lift-off-c-Isar-Aerospace-Brady-Kenniston-NASASpaceflight.com-2.jpg",
    "news_site": "Arstechnica",
    "summary": "\"There’s a lot of interest because of the fear that there’s just not a lot of capacity.\"",
    "published_at": "2025-09-19T11:00:51Z",
    "updated_at": "2025-09-19T11:10:04.610266Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Rocket Lab plans to raise up to $750 million by selling common shares. Astra targets mid-2026 for the first flight of its Rocket 4 vehicle. Avio's board of directors approves a 400 million euro ($471 million) capital increase. It is still subject to a shareholder vote, scheduled for October 23. Isar Aerospace executives discuss the outcome of the investigation into the March 30 launch of the Spectrum rocket. Despite the failure to get to orbit, Isar considers the first Spectrum launch a successful test flight. The company is working toward a second flight of Spectrum, which will take place \"as soon as possible\" Northrop Grumman inked a contract with SpaceX for three Falcon 9 launches. Launch companies are reiterating plans to sharply increase flight rates. United Launch Alliance projected 20 launches in 2025 between the Atlas 5 and Vulcan Centaur. Arianespace projected five Ariane 6 launches this year, including the debut of the more powerful Ariane 64, with four solid-rocket boosters. Ars is a trusted source in a sea of information. You don’t need to know everything, only what’s important. With our unique combination of technical savvy and wide-ranging interest in the technological arts and sciences, we can help you understand the world around you."
  },
  {
    "id": 33163,
    "title": "Hubble Images Celestial Cigar’s Smoldering Heart",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-images-celestial-cigars-smoldering-heart/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/spiral/Hubble_M82_potw2537a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image reveals new details in Messier 82 (M82), home to brilliant stars whose light is shaded by sculptural clouds made of clumps and streaks of dust and gas. This image features the star-powered heart of the galaxy, located just 12 million light-years away in the constellation Ursa Major (the Great […]",
    "published_at": "2025-09-19T11:00:00Z",
    "updated_at": "2025-09-19T11:10:05.622826Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Messier 82 (M82) is 12 million light-years away in the constellation Ursa Major (the Great Bear) The galaxy forms stars 10 times faster than the Milky Way. The intense starbirth period that grips this galaxy gave rise to super star clusters in the galaxy’s heart."
  },
  {
    "id": 33161,
    "title": "Taiwanese aerospace firm partners with Maxar on GPS-alternative drone navigation",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/taiwanese-aerospace-firm-partners-with-maxar-on-gps-alternative-drone-navigation/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Raptor_Guide_Sweden_Testing.png?fit=1024%2C587&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe satellite imagery company’s Raptor software uses terrain mapping to guide UAVs when satellite signals are jammed or unavailable\nThe post Taiwanese aerospace firm partners with Maxar on GPS-alternative drone navigation appeared first on SpaceNews.",
    "published_at": "2025-09-19T10:00:00Z",
    "updated_at": "2025-09-19T10:10:18.437826Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Maxar Intelligence announced a deal with one of Taiwan’s largest aerospace and defense contractors. Maxar Raptor is a vision-based software suite that enables autonomous drones to navigate. It provides a terrain-based positioning system for drones in GPS-denied environments. The partnership comes as military and civilian aircraft operators worldwide grapple with GPS jamming. Enter the code we sent to , or clicking the magic link in the email. By creating a SpaceNews.com account, you acknowledge that you have read our privacy policy and agree to our terms and conditions. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
  },
  {
    "id": 33160,
    "title": "85 new subglacial lakes detected below Antarctica",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/FutureEO/CryoSat/85_new_subglacial_lakes_detected_below_Antarctica",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/antarctic_subglacial_lake_inventory/26876417-2-eng-GB/Antarctic_subglacial_lake_inventory_card_full.jpg",
    "news_site": "ESA",
    "summary": "Hidden beneath the biggest ice mass on Earth, hundreds of subglacial lakes form a crucial part of Antarctica’s icy structure, affecting the movement and stability of glaciers, and consequentially influencing global sea level rise.",
    "published_at": "2025-09-19T09:00:00Z",
    "updated_at": "2025-09-19T09:40:13.257221Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Hundreds of subglacial lakes form a crucial part of Antarctica’s icy structure, affecting the movement and stability of glaciers. Researchers have identified 85 previously unknown lakes several kilometres under the frozen surface surrounding the South Pole. The research also identified new drainage pathways underneath the ice sheet. This increases the number of known active sub glacial lakes below Antarctica by more than half. The biggest known subglacial lake is Lake Vostok underneath the East Antarctic Ice Sheet, holding an estimated 5000–65 000 cubic km of water. By monitoring such phenomena, scientists can improve their understanding of interactions between the ice sheet, bedrock, ocean and atmosphere. “Subglacial hydrology is a missing piece in many ice sheet models,” said Sally."
  },
  {
    "id": 33158,
    "title": "Earth from Space: Komodo Island, Indonesia",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/09/Earth_from_Space_Komodo_Island_Indonesia",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/earth_from_space_komodo_island_indonesia/26875244-1-eng-GB/Earth_from_Space_Komodo_Island_Indonesia_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-19T08:00:00Z",
    "updated_at": "2025-09-19T08:50:13.662949Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Komodo is part of the Indonesian Lesser Sunda Islands and lies on the Sape Strait between the larger islands of Flores to the east and Sumbawa to the west. The island is of volcanic origin and, as visible in the image, its terrain is generally rugged, with sparse vegetation, featuring rounded hills that reach a maximum elevation of 825 m. The turquoise colour in the water along the coasts and around the surrounding islets reveal the presence of shallow waters and coral reefs."
  },
  {
    "id": 33157,
    "title": "Themis stands on the launch pad",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Enabling_Support/Space_Transportation/Future_space_transportation/Themis_stands_on_the_launch_pad",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/09/themis_t1h_on_the_launch_pad/26876940-1-eng-GB/Themis_T1H_on_the_launch_pad_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-09-19T07:51:00Z",
    "updated_at": "2025-09-19T08:40:12.933633Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Themis is the first European demonstration of a full-scale vertical take-off and landing rocket element that uses cryogenic propulsion. Themis uses the Prometheus engine, almost as powerful as the Ariane 6 rocket’s main engine. Prometheus can restart in flight and throttle its thrust to ensure a soft and safe landing."
  },
  {
    "id": 33159,
    "title": "Space Cargo Unlimited Secures €27.5M for BentoBox Payload Platform",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/space-cargo-unlimited-secures-e27-5m-for-bentobox-payload-platform/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/Space-Cargo-Unlimited-Secures-27.5M-Euros-for-BentoBox-Return-Capsule.webp",
    "news_site": "European Spaceflight",
    "summary": "In-space logistics provider Space Cargo Unlimited has closed a €27.5 million Series A funding round to continue the development of its BentoBox payload platform. In late 2022, Space Cargo Unlimited partnered with Thales Alenia Space to develop a returnable space platform called REV-1, which is designed to support in-orbit manufacturing and microgravity experimentation. Alongside REV-1, […]\nThe post Space Cargo Unlimited Secures €27.5M for BentoBox Payload Platform appeared first on European Spaceflight.",
    "published_at": "2025-09-19T06:35:02Z",
    "updated_at": "2025-09-19T09:00:15.042759Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "In-space logistics provider Space Cargo Unlimited has closed a €27.5 million Series A funding round to continue the development of its BentoBox payload platform. The company will initially offer it as a stand alone offering flown aboard an ATMOS Space Cargo Phoenix return capsule that is equipped with an inflatable heatshield to survive re-entry. An initial flight of the Bentobox payload platform is expected to take place in the second quarter of 2026."
  },
  {
    "id": 33156,
    "title": "Space Cargo Unlimited Secures €27.5M for BentoBox Return Capsule",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/space-cargo-unlimited-secures-e27-5m-for-bentobox-return-capsule/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/09/Space-Cargo-Unlimited-Secures-27.5M-Euros-for-BentoBox-Return-Capsule.webp",
    "news_site": "European Spaceflight",
    "summary": "In-space logistics provider Space Cargo Unlimited has closed a €27.5 million Series A funding round to continue the development of its BentoBox return capsule. In late 2022, Space Cargo Unlimited partnered with Thales Alenia Space to develop a returnable space platform called REV-1, which is designed to support in-orbit manufacturing and microgravity experimentation. Alongside REV-1, […]\nThe post Space Cargo Unlimited Secures €27.5M for BentoBox Return Capsule appeared first on European Spaceflight.",
    "published_at": "2025-09-19T06:35:02Z",
    "updated_at": "2025-09-19T06:40:27.831515Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "In-space logistics provider Space Cargo Unlimited has closed a €27.5 million Series A funding round to continue the development of its BentoBox payload platform. The company will initially offer it as a stand alone offering flown aboard an ATMOS Space Cargo Phoenix return capsule that is equipped with an inflatable heatshield to survive re-entry. An initial flight of the Bentobox payload platform is expected to take place in the second quarter of 2026."
  },
  {
    "id": 33155,
    "title": "Space Norway and SSTL collaborate on radar satellite program",
    "authors": [
      {
        "name": "Jeff Foust",
        "socials": {
          "x": "https://x.com/jeff_foust",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jefffoust",
          "mastodon": "https://mastodon.social/@jfoust",
          "bluesky": "https://bsky.app/profile/jfoust.bsky.social"
        }
      }
    ],
    "url": "https://spacenews.com/space-norway-and-sstl-collaborate-on-radar-satellite-program/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/microsar.jpeg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nSpace Norway and Surrey Satellite Technology Ltd. (SSTL) are working together on a radar satellite for maritime domain awareness, the first of potentially several such spacecraft.\nThe post Space Norway and SSTL collaborate on radar satellite program appeared first on SpaceNews.",
    "published_at": "2025-09-19T06:00:00Z",
    "updated_at": "2025-09-19T06:10:19.136181Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Space Norway and Surrey Satellite Technology Ltd. are working together on a radar satellite. The 400-kilogram satellite is scheduled to launch in early 2027 on a SpaceX rideshare mission. The focus of the satellite will be to monitor the North Atlantic region. The satellite is the first in a proposed constellation of six satellites."
  },
  {
    "id": 33154,
    "title": "Launch startup iSpace secures fresh funding as hot fire tests heat up China’s reusable rocket race",
    "authors": [
      {
        "name": "Andrew Jones",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/launch-startup-ispace-secures-fresh-funding-as-hot-fire-tests-heat-up-chinas-reusable-rocket-race/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/12/hyperbola2Y-hop-test2-10dec2023-ispace-1.png?fit=1024%2C573&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nLaunch startup iSpace has raised significant series D+ funding as commercial competitors in China report progress with hot fire tests.\nThe post Launch startup iSpace secures fresh funding as hot fire tests heat up China’s reusable rocket race appeared first on SpaceNews.",
    "published_at": "2025-09-18T22:49:10Z",
    "updated_at": "2025-09-18T22:50:21.636733Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33153,
    "title": "From Supercomputers to Wind Tunnels: NASA’s Road to Artemis II",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/esdmd/common-exploration-systems-development-division/space-launch-system/from-supercomputers-to-wind-tunnels-nasas-road-to-artemis-ii/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/kevin-murphy-headshot.webp",
    "news_site": "NASA",
    "summary": "Of the many roads leading to successful Artemis missions, one is paved with high-tech computing chips called superchips. Along the way, a partnership between NASA wind tunnel engineers, data visualization scientists, and software developers verified a quick, cost-effective solution to improve NASA’s SLS (Space Launch System) rocket for the upcoming Artemis II mission. This will […]",
    "published_at": "2025-09-18T20:41:17Z",
    "updated_at": "2025-09-18T20:50:05.614639Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33152,
    "title": "U.S., UK Space Commands execute first joint satellite maneuvers",
    "authors": [
      {
        "name": "Sandra Erwin",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/u-s-uk-space-commands-execute-first-joint-satellite-maneuvers/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/250505-X-OF297-1001-scaled.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nThe milestone operation marks an expansion of allied cooperation in the increasingly militarized space domain\nThe post U.S., UK Space Commands execute first joint satellite maneuvers appeared first on SpaceNews.",
    "published_at": "2025-09-18T20:15:24Z",
    "updated_at": "2025-09-18T20:20:23.228794Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33151,
    "title": "NASA’s Deep Space Communications Demo Exceeds Project Expectations",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/tech-demo-missions-program/deep-space-optical-communications-dsoc/nasas-deep-space-communications-demo-exceeds-project-expectations/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/1-pia26662-dsc4667-enhanced-nr.jpg",
    "news_site": "NASA",
    "summary": "The project has exceeded all of its technical goals after two years, setting up the foundations of high-speed communications for NASA’s future human missions to Mars. NASA’s Deep Space Optical Communications technology successfully showed that data encoded in lasers could be reliably transmitted, received, and decoded after traveling millions of miles from Earth at distances […]",
    "published_at": "2025-09-18T19:43:38Z",
    "updated_at": "2025-09-18T19:50:09.521515Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33150,
    "title": "NASA Gateways to Blue Skies 2026 Competition",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/prizes-challenges-crowdsourcing-program/center-of-excellence-for-collaborative-innovation-coeci/nasa-gateways-to-blue-skies-2026-competition/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/blueskies-logo-sml-copy.png",
    "news_site": "NASA",
    "summary": "The commercial aviation industry is a crucial component of the U.S. economy, playing a vital role in transporting people, intermediate/final goods, and driving demand for various goods and services nationwide. This network enhances the quality of life for the whole country and facilitates business interactions within and globally, boosting productivity and prosperity. However, the industry […]",
    "published_at": "2025-09-18T19:29:37Z",
    "updated_at": "2025-09-18T19:30:08.600974Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33149,
    "title": "Hubble Network raises $70 million to accelerate 60-satellite Bluetooth constellation",
    "authors": [
      {
        "name": "Jason Rainbow",
        "socials": {
          "x": "",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/jasonrainbow",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://spacenews.com/hubble-network-raises-70-million-to-accelerate-60-satellite-bluetooth-constellation/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/Hubble-scaled.jpg?fit=1024%2C683&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nTAMPA, Fla. — Hubble Network has secured $70 million in Series B funding to help deploy a 60-satellite constellation capable of connecting up to a billion Bluetooth devices worldwide by 2028. The Seattle-based venture announced the funding Sept. 17, bringing its total raised to $100 million since it was founded in 2021. “The plan is […]\nThe post Hubble Network raises $70 million to accelerate 60-satellite Bluetooth constellation appeared first on SpaceNews.",
    "published_at": "2025-09-18T19:08:05Z",
    "updated_at": "2025-09-18T19:10:17.690720Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33148,
    "title": "NASA’s Chandra Finds Black Hole With Tremendous Growth",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/chandra/nasas-chandra-finds-black-hole-with-tremendous-growth/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/red6.jpg",
    "news_site": "NASA",
    "summary": "A black hole is growing at one of the fastest rates ever recorded, according to a team of astronomers. This discovery from NASA’s Chandra X-ray Observatory may help explain how some black holes can reach enormous masses relatively quickly after the big bang. The black hole weighs about a billion times the mass of the […]",
    "published_at": "2025-09-18T17:31:55Z",
    "updated_at": "2025-09-18T17:40:09.507735Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33146,
    "title": "ISS Operations Continue with New Cargo and Crews",
    "authors": [
      {
        "name": "Nik Alexander",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/09/iss-operations-continue-with-new-cargo-and-crews/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/09/davidfilm.jpg",
    "news_site": "Space Scout",
    "summary": "NASA’s flagship laboratory, the International Space Station (ISS), has returned to a period of normalcy, but as the facility approaches its third decade of operation - considerable shakeups and changes are expected as the space agencies responsible face an uncertain future.",
    "published_at": "2025-09-18T16:41:29Z",
    "updated_at": "2025-09-18T16:55:41.775422Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "8c2412ae-fbef-443f-aae8-db538f38eec6",
        "provider": "Launch Library 2"
      },
      {
        "launch_id": "3bfed6d5-d65e-4133-b51a-b664bbd9d006",
        "provider": "Launch Library 2"
      },
      {
        "launch_id": "e8e93778-657c-401c-9c88-3cd4c7c45c9d",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33145,
    "title": "Building a Lunar Network: Johnson Tests Wireless Technologies for the Moon",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/building-a-lunar-network-johnson-tests-wireless-technologies-for-the-moon/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/nasa-jett7-nov-2024-121.jpg",
    "news_site": "NASA",
    "summary": "NASA engineers are strapping on backpacks loaded with radios, cameras, and antennas to test technology that might someday keep explorers connected on the lunar surface. Their mission: test how astronauts on the Moon will stay connected during Artemis spacewalks using 3GPP (LTE/4G and 5G) and Wi-Fi technologies.  With Artemis, NASA will establish a long-term presence […]",
    "published_at": "2025-09-18T16:37:50Z",
    "updated_at": "2025-09-18T16:40:06.237408Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33147,
    "title": "New NASA Mission to Reveal Earth’s Invisible ‘Halo’",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/uncategorized/new-nasa-mission-to-reveal-earths-invisible-halo/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/hpd/geospace/moon-based-telescope.jpg",
    "news_site": "NASA",
    "summary": "A new NASA mission will capture images of Earth’s invisible “halo,” the faint light given off by our planet’s outermost atmospheric layer, the exosphere, as it morphs and changes in response to the Sun. Understanding the physics of the exosphere is a key step toward forecasting dangerous conditions in near-Earth space, a requirement for protecting […]",
    "published_at": "2025-09-18T16:15:49Z",
    "updated_at": "2025-09-18T17:10:13.866491Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33144,
    "title": "Milky Way Views",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/milky-way-views/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/09/iss073e0516005orig.jpg",
    "news_site": "NASA",
    "summary": "The Milky Way appears above Earth’s bright atmospheric glow in this Aug. 23, 2025, photograph from the International Space Station as it soared 261 miles above southern Iran at approximately 12:54 a.m. local time. The camera was configured for low light and long duration settings. Our home galaxy has hundreds of billions of stars, enough […]",
    "published_at": "2025-09-18T16:14:05Z",
    "updated_at": "2025-09-18T16:20:06.639811Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  },
  {
    "id": 33143,
    "title": "Educating customers may be half the battle for nascent hyperspectral sector",
    "authors": [
      {
        "name": "Debra Werner",
        "socials": null
      }
    ],
    "url": "https://spacenews.com/educating-customers-may-be-half-the-battle-for-nascent-hyperspectral-sector/",
    "image_url": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/09/rsz_wy.png?fit=879%2C682&ssl=1",
    "news_site": "SpaceNews",
    "summary": "\nPARIS – A significant challenge for hyperspectral satellite operators is alerting potential customers to promising applications, according to speakers at the Summit on Earth Observation Business here. Hyperspectral datasets can reveal atmospheric greenhouse gases, identify stores of lithium and other high-value minerals, measure nitrogen in agricultural fields, and pinpoint the telltale signs of biological, nuclear […]\nThe post Educating customers may be half the battle for nascent hyperspectral sector appeared first on SpaceNews.",
    "published_at": "2025-09-18T15:35:32Z",
    "updated_at": "2025-09-18T15:40:26.305212Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": ""
  }
]