[
  {
    "id": 32675,
    "title": "Aurora Australis over Concordia station",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/Aurora_Australis_over_Concordia_station",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/aurora_australis_over_concordia_station/26843757-1-eng-GB/Aurora_Australis_over_Concordia_station_card_full.jpg",
    "news_site": "ESA",
    "summary": "The Aurora Australis, photographed over Concordia station in July 2025, during the ongoing solar activity maximum, the peak of the Sun's 11-year cycle. ",
    "published_at": "2025-08-27T08:00:00Z",
    "updated_at": "2025-08-20T08:50:11.122359Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Aurora Australis appears when charged particles from the Sun are guided by Earth’s magnetic field towards the polar regions. Concordia station, perched high on Antarctica’‘Dome C plateau, is one of the most remote research outposts on Earth. Each year, ESA sponsors a medical doctor to live and work at Concordia."
  },
  {
    "id": 32684,
    "title": "Russia launches Bion-M No.2 research satellite",
    "authors": [
      {
        "name": "P. Katin",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/russia-bion-m/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-20-18-14-08-653.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Russia launched the Bion-M No.2 satellite at 17:13 UTC on Wednesday, Aug. 20, aboard a…\nThe post Russia launches Bion-M No.2 research satellite appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-20T17:14:34Z",
    "updated_at": "2025-08-20T17:20:12.942510Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Russia launched the Bion-M No.2 satellite at 17:13 UTC on Wednesday, Aug. 20, aboard a Soyuz-2-1b rocket from Site 31/6 at the Baikonur Cosmodrome. This biomedical satellite is a continuation of a Soviet and later Russian scientific program, which started with the launch of Bion 1 back in 1973. Bion program uses spacecraft that are based on the Zenit series of reconnaissance satellites, sharing the same basic design. Bion-M № 2 is scheduled to land on the steppe in the Orenburg region on September 19. The mice were bred specifically for this spaceflight. The NRF2 gene, which regulates the detoxification and antioxidant protection system, is the focus of this research. Bion-M No.2 mission will study the germination of seeds, study the effects of space conditions on the plants. Various microorganisms are also flying on board the satellite: anaerobic, spore-forming microorganisms and extremophiles. A place on board has been found for two experiments designed by school students. The mission comes over 12 years after the previous mission, which returned to Earth in May 2013."
  },
  {
    "id": 32683,
    "title": "Viking 1 Begins Journey to Mars",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/viking-1-begins-journey-to-mars/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/4940404265-47186ca7a3-o.jpg",
    "news_site": "NASA",
    "summary": "A Titan-Centaur rocket carrying the Viking 1 spacecraft launches from Complex 41 at Cape Canaveral Air Force Station on Aug. 20, 1975. Viking 1 touched down on the red planet on July 20, 1976, becoming the first truly successful landing on Mars. Viking 1 was the first of a pair of complex deep space probes […]",
    "published_at": "2025-08-20T16:52:19Z",
    "updated_at": "2025-08-20T17:00:10.754816Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Viking 1 touched down on the red planet on July 20, 1976, becoming the first truly successful landing on Mars. Viking 1 was the first of a pair of complex deep space probes that were designed to reach Mars. NASA’s exploration of Mars continues, with rovers exploring the surface and spacecraft studying from orbit."
  },
  {
    "id": 32682,
    "title": "Live coverage: SpaceX to launch X-37B military spaceplane on Falcon 9 rocket from the Kennedy Space Center",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/20/live-coverage-spacex-to-launch-x-37b-military-spaceplane-on-falcon-9-rocket-from-the-kennedy-space-center/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/03/20250307-X37B.jpg",
    "news_site": "Spaceflight Now",
    "summary": "This will be the eighth flight of the X-37B and the third time that it will launched by SpaceX. The Falcon 9 rocket is scheduled to liftoff from Launch Complex 39A at 11:50 p.m. EDT (0350 UTC). ",
    "published_at": "2025-08-20T16:41:36Z",
    "updated_at": "2025-08-20T16:50:18.326645Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The U.S. Space Force and SpaceX are preparing to launch the Boeing-built X-37B spaceplane on its eighth mission shortly before midnight on Thursday. The winged spacecraft, flying under the mission names USSF-36 and Orbital Test Vehicle 8 (OTV-8), will launch atop a Falcon 9 rocket from pad 39A at NASA’s Kennedy Space Center at 11:50 p.m. EDT (0350 UTC) Meteorologists with the 45th Weather Squadron forecast a 65 percent chance for favorable conditions for liftoff. The OTV-8 flight will also feature what the Space Force calls “the world’s highest performing quantum inertial sensor ever used in space” It will demonstrate navigational capabilities without the use of GPS by instead “detecting rotation and acceleration of atoms”"
  },
  {
    "id": 32681,
    "title": "Firefly Aerospace explores launching its Alpha rocket from Japan",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/20/firefly-aerospace-explores-launching-its-alpha-rocket-from-japan/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250818_FLA006_launch.jpeg",
    "news_site": "Spaceflight Now",
    "summary": "If the company moves forward with this possibility, it would present Firefly with a third launch site for its Alpha rockets. ",
    "published_at": "2025-08-20T16:07:14Z",
    "updated_at": "2025-08-20T16:10:17.431474Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Hokkaido Spaceport has room for two launch complexes designed to support the launches of small, orbital-class rockets. All six of Firefly Aerospace’s Alpha rocket launches so far took off from Space Launch Complex 2 at Vandenberg Space Force Base in California. Rocket Lab has launched the vast majority of its more than 60 Electron rockets from Mahia, New Zealand.  Firefly Aerospace launched its Alpha rocket Friday after a launch attempt on Wednesday was scrubbed by bad weather. The infrastructure expansion in Briggs, Texas, boosts the company’s manufacturing space from 92,000 to 207,000 square feet. Liftoff with a payload for Lockheed Martin occurred at 9:32 a.m. PST."
  },
  {
    "id": 32678,
    "title": "Steve Platnick Steps Down from NASA After 34 Years of Service",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/steve-platnick-steps-down-from-nasa-after-34-years-of-service/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/earth-observer/2025/2025-summer/platnick/steve-p-image.jpg",
    "news_site": "NASA",
    "summary": "Dr. Steven “Steve” Platnick took the NASA agency Deferred Resignation Program (DRP). His last work day was August 8, 2025. Steve spent more than three decades at, or associated with, NASA. While he began his civil servant career at the NASA’s Goddard Space Flight Center (GSFC) in 2002, his Goddard association went back to 1993, […]",
    "published_at": "2025-08-20T13:15:19Z",
    "updated_at": "2025-08-20T15:12:35.520134Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Dr. Steven “Steve” Platnick took the NASA Deferred Resignation Program (DRP) His last work day was August 8, 2025. Steve played an integral role in the sustainability and advancement of NASA’s Earth Observing System platforms and data. Steve has participated in numerous major airborne field campaigns over his career. His key ER-2 flight scientist and/or science team management roles included the Monterey Area Ship Track experiment (MAST, 1994) Steve has been a champion of continuing to retain a historical record of NASA science team meetings. He has received numerous honors, including the Goddard William Nordberg Memorial Award for Earth Science in 2023."
  },
  {
    "id": 32679,
    "title": "NASA, IBM’s ‘Hot’ New AI Model Unlocks Secrets of Sun",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/artificial-intelligence-model-heliophysics/",
    "image_url": "https://images-assets.nasa.gov/image/GSFC_20171208_Archive_e001435/GSFC_20171208_Archive_e001435~large.jpg",
    "news_site": "NASA",
    "summary": "Editor’s Note: This article was updated Aug. 20, 2025, to correct the number of years of training data used and the model accuracy. The original article said the model was trained on 14 years of Solar Dynamics Observatory data and surpassed existing benchmarks by 15%; the model was actually trained on 9 years of data and […]",
    "published_at": "2025-08-20T13:03:30Z",
    "updated_at": "2025-08-20T15:12:35.530034Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Surya uses advances in AI to analyze vast amounts of solar data. The model can be used to provide early warnings to satellite operators. It also helps scientists predict how the Sun’s ultraviolet output affects Earth's upper atmosphere. Preliminary results show Surya is making strides in solar flare forecasting. Surya is designed to study the Sun, but its architecture and methodology are adaptable across scientific domains. The project lays the foundational infrastructure for similar AI efforts in diverse domains. Both the model and training datasets are freely available online to researchers, educators, and students worldwide. NASA's commitment to open science fuels groundbreaking research while maximizing transparency, innovation, and collaboration. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. The agency is based in Washington, D.C. and has offices around the world."
  },
  {
    "id": 32680,
    "title": "Iberian wildfires seen from space",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Iberian_wildfires_seen_from_space",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/iberian_fires_august_2025/26845081-2-eng-GB/Iberian_fires_August_2025_card_full.jpg",
    "news_site": "ESA",
    "summary": "Southern Europe is once again in the grip of extreme summer heat. Soaring temperatures and bone-dry land have fuelled widespread wildfires, with the Iberian Peninsula among the regions hardest hit. Flames continue to sweep across parched landscapes, as these images show.",
    "published_at": "2025-08-20T11:45:00Z",
    "updated_at": "2025-08-20T15:12:41.294408Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Soaring temperatures and bone-dry land have fuelled widespread wildfires, with the Iberian Peninsula among the regions hardest hit. From orbit, Earth-observing satellites offer a unique way of tracking the spread of fires and supporting emergency crews battling the blazes on the ground. The images featured here reveal the scale of the crisis, with dense smoke plumes from several fires stretching across large areas of northwest Spain and northern Portugal. The Climate Change Initiative is designed to generate consistent, long-term global datasets of Essential Climate Variables that provide robust evidence of our changing climate. These projects are helping to improve predictions, guide adaptation strategies, and strengthen our collective response to a warming world. You can only like this page once."
  },
  {
    "id": 32677,
    "title": "UK Space Agency to Lose Limited Autonomy to Government Streamlining",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/uk-space-agency-to-lose-limited-autonomy-to-government-streamlining/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/UK-Space-Agency-to-Lose-Limited-Autonomy-to-Government-Streamlining-hero.webp",
    "news_site": "European Spaceflight",
    "summary": "The UK Space Agency has announced that from April 2026 it will be absorbed into the Department for Science, Innovation and Technology, losing its executive agency status. In its 20 August announcement, the UK Space Agency stated that the restructuring, which is part of broader governmental “streamlining”, would remove duplication, reduce bureaucracy, and put “public […]\nThe post UK Space Agency to Lose Limited Autonomy to Government Streamlining appeared first on European Spaceflight.",
    "published_at": "2025-08-20T09:43:01Z",
    "updated_at": "2025-08-20T09:50:17.658790Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The UK Space Agency has announced that from April 2026 it will be absorbed into the Department for Science, Innovation and Technology. In 2010, the country began the process of establishing its own centralized space agency set up as an executive agency. As a DSIT executive agency, the UKSA currently operates with limited managerial independence in delivering government space policy. Save my name, email, and website in this browser for the next time I comment. Help European Spaceflight continue to go after stories that are too often overlooked. You can donate from as little as €1. Every cent goes to fueling our mission. Back to the page you came from."
  },
  {
    "id": 32676,
    "title": "UK Government Abolishes Independent UK Space Agency; Will Merge Into DSIT by 2026",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/europe/uk-government-abolishes-independent-uk-space-agency-will-merge-into-dsit-by-2026",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755679269673.png",
    "news_site": "The Launch Pad",
    "summary": "UK Government Abolishes Independent UK Space Agency; Will Merge Into DSIT by 2026",
    "published_at": "2025-08-20T08:27:00Z",
    "updated_at": "2025-08-20T08:50:18.169956Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The UK Space Agency will cease to exist as an independent body by April 2026. The agency will be absorbed into the Department for Science, Innovation and Technology (DSIT) Officials said the change would reduce duplication, improve efficiency, and ensure stronger ministerial oversight. Supporters of the agency expressed concern that the merger could slow innovation and reduce agility."
  },
  {
    "id": 32674,
    "title": "Curiosity Blog, Sols 4634-4635: A Waiting Game",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4634-4635-a-waiting-game/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04633_opgs_edr_ncam_NLB_808788777EDR_S1181350NCAM00250M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Lucy Thompson, Planetary Scientist and APXS Team Member, University of New Brunswick, Canada Earth Planning Date: Monday, Aug. 18, 2025 The downlink data from our weekend activities arrived on Earth as we started planning this morning. As the APXS payload uplink and downlink lead, I assess the downlink data to ensure that our […]",
    "published_at": "2025-08-19T19:22:47Z",
    "updated_at": "2025-08-19T20:10:12.424666Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Downlink data from our weekend activities arrived on Earth as we started planning this morning. The drive executed as planned and we are on stable ground, which will enable us to unstow the arm for contact science with APXS and MAHLI. We selected a representative bedrock patch (“Gil”) that was large enough and smooth enough to brush for dust removal. ChemCam will also analyze this target with LIBS, and Mastcam will capture a documentation image."
  },
  {
    "id": 32673,
    "title": "Curiosity Blog, Sols 4631-4633: Radiant Ridge Revolution",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4631-4633-radiant-ridge-revolution/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04629_opgs_edr_ncam_NLB_808441485EDR_F1181194NCAM00296M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Remington Free, Operations Systems Engineer at NASA’s Jet Propulsion Laboratory Earth planning date: Friday, Aug. 15, 2025 Today we uplinked a three-sol weekend plan with lots of exciting activities — to support both the science and engineering teams!  While usually our science activities take front and center stage, we often also do engineering […]",
    "published_at": "2025-08-19T18:40:46Z",
    "updated_at": "2025-08-19T19:10:05.060904Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "On Sol 4631, we planned a maintenance activity of our Battery Control Boards (BCBs) This maintenance is done periodically to correct for any time drift on the BCBs, so we get as accurate of data as possible. After completing our engineering activities, we started off with some remote science; this included Mastcam imaging and ChemCam measurements of several interesting targets. On Sol 4633, we continued with more science imaging, including a horizon movie using Navcam and a dust-devil movie, before proceeding into our drive."
  },
  {
    "id": 32672,
    "title": "Sun at the Center: Teacher Ambassadors Bring Heliophysics to Classrooms Nationwide",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/learning-resources/science-activation/sun-at-the-center-teacher-ambassadors-bring-heliophysics-to-classrooms-nationwide/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/Linh_and_Samuel_optimized_1000-Carolyn_Y._Ng.jpg",
    "news_site": "NASA",
    "summary": "For the fourth year in a row, the American Association of Physics Teachers, a collaborator on the NASA Heliophysics Education Activation Team (HEAT), selected eight new educators to serve as ambassadors for heliophysics education. Meeting in Boulder, CO, from July 14-17, 2025, these teachers met to work through AAPT’s lessons that bring physics content to […]",
    "published_at": "2025-08-19T16:46:56Z",
    "updated_at": "2025-08-19T17:10:13.911000Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The American Association of Physics Teachers selected eight new educators to serve as ambassadors for heliophysics education. The Ambassador program began in 2022 as an effort to identify highly-motivated secondary and tertiary educators. Since the program began, 32 Ambassadors have been identified and participated in the multi-day professional learning experience."
  },
  {
    "id": 32671,
    "title": "NASA’s X-59 Nears First Flight",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-x-59-nears-first-flight/",
    "image_url": "https://images-assets.nasa.gov/image/P25-056-49/P25-056-49~large.jpg",
    "news_site": "NASA",
    "summary": "As we honor the legacy of aviation pioneers this National Aviation Day, NASA’s X-59 is preparing to push the boundaries of what’s possible in air travel. The quiet supersonic aircraft’s historic first flight is on the horizon, with final ground tests about to begin. Following completion of low-speed taxi tests in July 2025 in Palmdale, […]",
    "published_at": "2025-08-19T16:00:00Z",
    "updated_at": "2025-08-19T16:00:09.045299Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The quiet supersonic aircraft’s historic first flight is on the horizon. The X-59 will reach speeds of approximately 240 mph at an altitude of about 12,000 feet. The flight data will help inform U.S. and international regulators as they consider new noise standards."
  },
  {
    "id": 32670,
    "title": "What is BioNutrients?",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/what-is-bionutrients/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2019/04/acd19-0013-101-0.jpg",
    "news_site": "NASA",
    "summary": "A series of biology experiments, called BioNutrients, is testing ways to use microorganisms to produce nutrients – off Earth and on demand – that will be critical for human health in space. Editor’s note: This article was updated on Aug. 19, 2025, to clarify which BioNutrients experiments in the series are completed and adds new […]",
    "published_at": "2025-08-19T15:35:04Z",
    "updated_at": "2025-08-19T15:40:05.829951Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is developing technologies to biomanufacture valuable products on-demand. Long-duration human exploration missions to the Moon and Mars will require minimizing the amounts of supplies launched. Planning new ways to supply food for a multi-year mission on the Moon or Mars may require making food and nutrients in space. The BioNutrients-3 investigation is planned to launch to the space station in August 2025 aboard NASA’s SpaceX CRS-33 mission. It aims to develop a platform biomanufacturing technology that demonstrates microbial production of targeted nutrients for long-duration space missions. The concept is similar to making familiar fermented foods, such as how milk – transformed by bacteria – becomes yogurt. BioNutrients-3 includes the same commercial yogurt and kefir starters used in BioNutrient-2 and adds yeast strains that have been bioengineered to produce multiple nutrients in a single bag. The growth substrate – the ingredients needed to sustain the microorganisms as they grow, including a color-changing indicator of the level of acidity in the samples – is fully edible."
  },
  {
    "id": 32669,
    "title": "NASA’s Psyche Captures Images of Earth, Moon",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/psyche-mission/nasas-psyche-captures-images-of-earth-moon/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/1-pia26569-annotated-image-of-stars-and-earth-clean.jpg",
    "news_site": "NASA",
    "summary": "Headed for a metal-rich asteroid of the same name, the Psyche spacecraft successfully calibrated its cameras by looking homeward. On schedule for its 2029 arrival at the asteroid Psyche, NASA’s Psyche spacecraft recently looked back toward home and captured images of Earth and our Moon from about 180 million miles (290 million kilometers) away. The […]",
    "published_at": "2025-08-19T15:02:38Z",
    "updated_at": "2025-08-19T15:10:20.650966Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA's Psyche spacecraft recently looked back toward home and captured images of Earth and our Moon from about 180 million miles (290 million kilometers) away. The images were obtained during one of the mission team’s periodic checkouts of the spacecraft's science instruments. Psyche is headed for a metal-rich asteroid of the same name and is scheduled to arrive in 2029. Psyche is the 14th mission selected as part of NASA’s Discovery Program. Moonquakes pose little risk to astronauts during a mission lasting just a few days. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery."
  },
  {
    "id": 32668,
    "title": "Moonlight and Our Atmosphere",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/moonlight-and-our-atmosphere/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/iss072e978997orig.jpg",
    "news_site": "NASA",
    "summary": "The Moon’s light is refracted by Earth’s atmosphere in this April 13, 2025, photograph from the International Space Station as it orbited into a sunset 264 miles above the border between Bolivia and Brazil in South America. Understanding the Moon helps us understand other planets, how they have evolved and the processes which have shaped […]",
    "published_at": "2025-08-19T14:51:32Z",
    "updated_at": "2025-08-19T15:00:10.322287Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " Understanding the Moon helps us understand other planets, how they have evolved and the processes which have shaped their surfaces. By using the Moon as our closest testing ground for robotics and instrument systems, we can further human exploration to not only the Moon, but the rest of the solar system. Through Artemis missions, NASA will send astronauts to explore the Moon for scientific discovery and economic benefits."
  },
  {
    "id": 32666,
    "title": "National Aviation Day: Celebrating NASA’s Heritage While Charting Our Future",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/aeronautics/national-aviation-day-celebrating-nasas-heritage-while-charting-our-future/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/x59sunrise.jpg",
    "news_site": "NASA",
    "summary": "As we observe National Aviation Day Tuesday – a tribute to Orville Wright’s birthday – let’s reflect on both America’s and NASA’s aviation heritage and share how we are pushing the boundaries of flight for the nation’s future. Modern NASA grew from the National Advisory Committee for Aeronautics (NACA), an agency created by Congress in […]",
    "published_at": "2025-08-19T14:25:51Z",
    "updated_at": "2025-08-19T14:30:06.586636Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA grew from the National Advisory Committee for Aeronautics (NACA) NACA was created by Congress in 1915 to advance U.S. aviation. NASA’s commitment to aviation innovation did not stop with early experimental high-speed aircraft. Later this year, NASA Test Pilot Nils Larson will usher in a new era of quiet supersonic flight. Todd Ericson: I am continually inspired by the ingenuity of our past and the promise of our future. He says the pursuit of quiet supersonic aircraft, hypersonic technologies, and revitalized general aviation will keep the U.S. aviation industry strong and sustainable."
  },
  {
    "id": 32667,
    "title": "Starbase Pad 2: Design Advancements from Pad 1",
    "authors": [
      {
        "name": "Jake Rees",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/starbase-pad-2-advancements-pad-1/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Screenshot_20250810_234655_Gallery.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX’s Starbase facility in Boca Chica, Texas, continues to evolve as the company pushes the…\nThe post Starbase Pad 2: Design Advancements from Pad 1 appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-19T14:24:59Z",
    "updated_at": "2025-08-19T14:30:21.961076Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Pad 2 launch tower base features a stainless steel framework filled with concrete, a significant departure from Pad A’s concrete base with stainless steel cladding. The housing at the rear of the Pad 2 tower base is substantially larger and more robust. Pad 2 chopsticks are approximately 10 metres shorter than Pad 1's; this is expected to improve responsiveness during catch attempts. The Pad 2 carriage incorporates a redesigned skate system, differing from the Pad 1 configuration. The pistons used for moving these chopsticks laterally are significantly simplified compared to those on Pad 1. The rigging layout on the Pad 2 tower differs from Pad 1’s regarding the placement of the drawworks and the dead spool & deadline anchor. The Pad 2 launch mount is equipped with two Booster Quick Disconnects (BQDs), as opposed to Pad 1’s single BQD. These two BQDs appear to be separated for liquid oxygen and liquid methane supply. The top surface of the launch mount incorporates a water-cooled steel plate, similar to the one implemented under Pad 1 since Flight 2. Pad 2 will only share storage tanks with Pad 1. The layout of the Pad 2 end of the tank farm is entirely different from Pad 1’s, likely based on extensive lessons learned from all prior Starship ground tests and launches. Pad 2 will have its dedicated liquid oxygen and liquid methane pumps and subcoolers, amongst other items of GSE-related hardware. Starbase Pad 2 is scheduled to be completed by the end of 2025. It will be the second Starbase Pad to be built in the U.S. The project is funded by the National Aeronautics and Space Administration (NASASpaceflight.com)"
  },
  {
    "id": 32665,
    "title": "NASA-funded Compact Radar Drives Big Changes in Airborne and Suborbital Radar Capabilities",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/earth-science-division/nasa-funded-compact-radar-drives-big-changes-in-airborne-and-suborbital-radar-capabilities/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/science-enabling-technology/technology-highlights/2025/Wye_Balloon_Final.jpeg",
    "news_site": "NASA",
    "summary": "A collaboration between NASA and the small business Aloft Sensing produced a new compact radar system that will enable researchers to leverage High Altitude Long Endurance (HALE) platforms to observe dynamic Earth systems. This new radar is small, provides highly sensitive measurements, and doesn’t require GPS for positioning; eventually, it could be used on vehicles […]",
    "published_at": "2025-08-19T13:57:58Z",
    "updated_at": "2025-08-19T14:10:05.457823Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "New radar is small, provides highly sensitive measurements, and doesn’t require GPS for positioning. Eventually, it could be used on vehicles in space. “It’s a level of sensitivity that has eluded traditional radar sensors, without making them bulky and expensive,” said Lauren Wye, CEO of Aloft Sensing. HALE InSAR can be used to navigate without GPS in austere environments where reliable GPS signals may be unavailable. The Aloft Sensing team recently achieved several key milestones, validating their instrument aboard an airship at 65,000 feet as well as small stratospheric balloons. The Snapshot Wisconsin project recently collected their 100 millionth trail camera photo."
  },
  {
    "id": 32664,
    "title": "Polish Consortium Selects Payloads for State-Sponsored Suborbital Rocket Launch",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/polish-consortium-selects-payloads-for-state-sponsored-suborbital-rocket-launch/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Polish-Consortium-Selects-Payloads-for-State-Sponsored-Suborbital-Rocket-Launch.webp",
    "news_site": "European Spaceflight",
    "summary": "On 19 August, Poland’s Łukasiewicz Research Network’s Institute of Aviation revealed the four payloads that were selected to fly aboard a suborbital rocket under a Polish Space Agency–funded launch service. In April, the Polish Space Agency issued a call for proposals under its “Development of Launch Technology and Demonstration of Launch Capability on Polish Suborbital […]\nThe post Polish Consortium Selects Payloads for State-Sponsored Suborbital Rocket Launch appeared first on European Spaceflight.",
    "published_at": "2025-08-19T13:23:02Z",
    "updated_at": "2025-08-19T13:40:10.816072Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Polish Space Agency issued a call for proposals for a suborbital rocket test flight in April. In late July, the Polish Institute of Aviation invited proposals for potential payloads. The application process for this call closed on 11 August. On 19 August, Łukasiewicz ILOT announced that it had received 23 proposals and had selected four. The launch carrying the four payloads is expected to take place in October."
  },
  {
    "id": 32663,
    "title": "NASA Invites You to Celebrate National Aviation Day 2025",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/aeronautics/national-aviation-day-2025/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/2024-08-19-nad-web-hero.jpg",
    "news_site": "NASA",
    "summary": "The first “A” in NASA stands for Aeronautics – so naturally that means today, Aug. 19, National Aviation Day, is one of our favorite days all year! National Aviation Day was first proclaimed in 1939 by President Franklin Roosevelt to celebrate the birthday of aviation pioneer Orville Wright, who, with his brother Wilbur, in 1903, […]",
    "published_at": "2025-08-19T10:00:00Z",
    "updated_at": "2025-08-19T10:10:04.990215Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "National Aviation Day was first proclaimed in 1939 by President Franklin Roosevelt. Explore your local science center for exhibits about aviation and how an airplane flies. Grab some LEGO bricks and build the airplane of your dreams. Or make it easy on yourself, fold a paper airplane and shoot it across the room. NASA is working to transform air transportation to meet the future needs of the global aviation community. See how many different types of airplanes you can count or identify. Don’t hesitate to ask your librarian for help. Check out the NASA e-books you can download and own for free."
  },
  {
    "id": 32659,
    "title": "Where the Wild Things Are: Wildlife Management with Johnson’s Matt Strausser",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/where-the-wild-things-are-wildlife-management-with-johnsons-matt-strausser/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/07/jsc2014e021744.jpg",
    "news_site": "NASA",
    "summary": "If you asked someone what they expected to see during a visit to NASA’s Johnson Space Center, they would probably list things like astronauts, engineers, and maybe a spacecraft or two. It might be a surprise to learn you can also spy hundreds of species of animals – from geckos and snakes to white-tailed deer […]",
    "published_at": "2025-08-18T21:00:00Z",
    "updated_at": "2025-08-18T21:00:09.705413Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Matt Strausser is Johnson Space Center's senior biologist for wildlife management. He works to reduce the negative impacts animals can have on Johnson’s operations. Strausser also works to engage project and facility managers and provide recommendations on how to prevent or reduce the impact of wildlife problems onsite. Strausser says accomplishing the goals of the agency’s Artemis campaign will require a tremendous amount of specialized support infrastructure. “Building a wildlife and natural resource program from the ground up and bringing all of these once-disconnected and diverse professionals together to effectively address problems – that is the achievement I take the most pride in,” he said."
  },
  {
    "id": 32660,
    "title": "NASA Sets Coverage for SpaceX 33rd Station Resupply Launch, Arrival",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-sets-coverage-for-spacex-33rd-station-resupply-launch-arrival/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/spacex-falcon-9-rocket-carrying-dragon-crs-33-release-aug-18.jpg",
    "news_site": "NASA",
    "summary": "NASA and SpaceX are targeting 2:45 a.m. EDT, Sunday, Aug. 24, for the next launch to deliver science investigations, supplies, and equipment to the International Space Station. This is the 33rd SpaceX commercial resupply services mission to the orbital laboratory for NASA. Filled with more than 5,000 pounds of supplies, a SpaceX Dragon spacecraft on […]",
    "published_at": "2025-08-18T20:50:17Z",
    "updated_at": "2025-08-18T21:00:09.718322Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "This is the 33rd SpaceX commercial resupply services mission to the orbital laboratory for NASA. Filled with more than 5,000 pounds of supplies, a SpaceX Dragon spacecraft on a Falcon 9 rocket will lift off from Space Launch Complex 40 at Cape Canaveral Space Force Station in Florida. Dragon will dock autonomously about 7:30 a.m. on Monday, Aug. 25, to the forward port of the space station’s Harmony module. Let people know you’re watching the mission on X, Facebook, and Instagram by following and tagging these accounts. NASA’s virtual guest program for this mission also includes curated launch resources, notifications about related opportunities or changes, and a stamp for the NASA virtual guest passport following launch."
  },
  {
    "id": 32658,
    "title": "Station Nation: Meet Tess Caswell, Extravehicular Activity Flight Controller and Lead Capsule Communicator",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/station-nation-meet-tess-caswell-extravehicular-activity-flight-controller-and-lead-capsule-communicator/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/alison-tess-fcr-view-jsc2025e031847.jpg",
    "news_site": "NASA",
    "summary": "Tess Caswell supports the International Space Station from NASA’s Johnson Space Center in Houston as a capsule communicator, or capcom, as well as through the Extravehicular Activity Office. She is currently on rotation as the Artemis lead capcom, helping to develop training and processes for the Artemis campaign by leveraging her experience supporting the space […]",
    "published_at": "2025-08-18T19:38:40Z",
    "updated_at": "2025-08-18T19:40:05.988715Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Tess Caswell supports the International Space Station from NASA’s Johnson Space Center in Houston. She is currently on rotation as the Artemis lead capcom, helping to develop training and processes for the Artemis campaign. Caswell: I like to encourage young people to think about what part of space travel inspires them. Tess Caswell is an Extravehicular Activity Flight Controller and Lead Capsule Communicator. The space station brings people together in a common mission that benefits all of us. If you could have dinner with any astronaut, past or present, who would it be? Sally Ride, definitely."
  },
  {
    "id": 32656,
    "title": "After recent tests, China appears likely to beat the United States back to the Moon",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/after-recent-tests-china-appears-likely-to-beat-the-united-states-back-to-the-moon/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2230278319.jpg",
    "news_site": "Arstechnica",
    "summary": "An expert explains why this will be enormously bad for the United States.",
    "published_at": "2025-08-18T17:18:22Z",
    "updated_at": "2025-08-18T17:30:05.834319Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Chinese space program has reported some significant milestones in developing its program to land astronauts on the lunar surface by 2030. On August 6, the China Manned Space Agency successfully tested a high-fidelity mockup of its 26-ton \"Lanyue\" lunar lander. This work suggests that China is on course to land on the Moon before the end of this decade. Cheng: It seems quite likely that the Chinese will land on the Moon before NASA can return to the Moon. Cheng: If China regularly dispatches lunar missions, then it will rightfully be able to argue that Chinese should be the language of lunar/cis-lunar space traffic management. The Chinese are stable, systematic. They pursue a given goal (e.g., human spaceflight, a space station) over decades, with persistence and programmatic stability. So I expect that the Chinese will put a Chinese person on the Moon by 2030 and follow that with additional crewed and unmanned facilities. This will be supported by a built-out infrastructure of lunar PNT/comms."
  },
  {
    "id": 32657,
    "title": "Summary of the 2025 GEDI Science Team Meeting",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/uncategorized/summary-of-the-2025-gedi-science-team-meeting/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-meeting-summary-banner.png",
    "news_site": "NASA",
    "summary": "Introduction The 2025 Global Ecosystem Dynamics Investigation (GEDI) Science Team Meeting (STM) took place April 1–3, 2025 at the University of Maryland, College Park (UMD). Upwards of 60 participants attended in-person, while several others joined virtually by Zoom. The GEDI Mission and Competed Science Team members were in attendance along with the GEDI NASA program […]",
    "published_at": "2025-08-18T17:08:05Z",
    "updated_at": "2025-08-18T18:10:05.645560Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 2025 Global Ecosystem Dynamics Investigation (GEDI) Science Team Meeting (STM) took place April 1–3, 2025 at the University of Maryland, College Park. Participants shared updates on the GEDI instrument and data products post-hibernation. They also shared progress reports on the second Competed Science Team cohort’s projects. GEDI-related publications and datasets are appearing in high-impact journals, including PNAS , Nature , and Science families. As of March 2025, each of the instrument’s three lasers logged over 22,000 hours in firing mode, collecting more than 20 billion shots each. The Science Data Processing System also underwent a technical refresh that increased computational and data storage capability. GEDI quality filtering and aboveground biomass density (AGBD) model selection and prediction rely heavily on stratification by plant functional type and geographic world region. Canopy structure data, like that provided by GEDI, can play a key role in developing physics-based fire behavior models, such as QUIC-Fire. Chris Hakkenberg presented research using GEDI to characterize fuel structure, burn severity, and post-fire response across the regions of California affected by wildfire. Sean Healey presented an overview of the Online Biomass Inference using Waveforms and iNventory (OBI-WAN) project. Michelle Hofton and Sarah Story returned to the topic of G EDI data product status. GEDI Co-I presented on GEDI L2B data, which provides gridded footprint-level [25-m (82-ft) resolution] metrics such as canopy cover. John Armston explained that the upcoming V3.0 release will differ from V2.0 in that it will use GEDi-derived canopy-ground reflectance ratios to estimate canopy cover, thus allowing for spatial variability. L4A V2.1 was updated to include data through mission week (MW) 311 (i.e., through November 2024) and is now available to end users. V3.0, along with an updated Algorithm Theoretical Basis Document (ATBD), is expected later in 2025. The revised ATBD will outline enhancements to the waveform simulator, quality filtering, stratification, and model selection. GEDI L4D Imputed Waveform product aims to generate a wall-to-wall 30-m (98-ft) resolution map of GEDI waveforms across the globe in 2023. Neha Hunka [European Space Agency] shared her work using GEDi to fill gaps in the Republic of Sudan’s National Forest Inventory ( NFI) Stuart Davies [Smithsonian Institution) presented his work on GEO-TREES, a global forest biomass reference system. GEDI can detect both immediate fire effects as well as recovery after disturbance, including stand-replacement and understory clearing. By overlaying disturbance maps with GEDI data, the team observed that recovery rates differ across height class. Chi Chen’s research aims to generate gap-free, high-temporal-frequency canopy profile data. GEDI L3 and L4 datasets have been released: L4B (country-level summaries of aboveground biomass), L4C (footprint level waveform structural complexity index) and a GEDI-FIA (fusion dataset for training lidar models to forest attributes) In total, almost 34,000 unique users have downloaded GEDC data 13,770,648 times, with L4A being the most popular at 13.1 million downloads. As of April 30, 2025, all G EDI footprint-level datasets from L1–L4 are available with data through MW 311. GEDI datasets can help identify critical data and knowledge gaps, guiding the development of new missions – e.g., the Surface Topography and Vegetation (STV) mission concept called for in the 2017 Earth Science Decadal Survey report. Jody Vogeler presented her research using GEDI data fusions to characterize post-fire landscapes and understand habitat refugia for the threatened Canada lynx. The 2025 GEDI STM was especially exciting, as it came on the cusp of post-storage data being processed and released as V2.1. The meeting highlighted the mission’s ongoing success and scientific value following hibernation on the ISS. Looking ahead, data users can anticipate the V3.0 product release later in 2025."
  },
  {
    "id": 32655,
    "title": "ESA Increases Mars Ambitions with Mars Transportation Infrastructure",
    "authors": [
      {
        "name": "Emily B",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/08/esa-increases-mars-ambitions-with-mars-transportation-infrastructure/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/08/LightShip_ESA_s_martian_tug-scaled.jpg",
    "news_site": "Space Scout",
    "summary": "As the European Space Agency (ESA)'s ExoMars/Rosalind Franklin Mission prepares for its 2028 launch, the agency is looking forward to future Mars science and exploration needs with an eye towards increasing European space independence.",
    "published_at": "2025-08-18T17:06:03Z",
    "updated_at": "2025-08-18T17:10:15.791847Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "LightShip is a mission and spacecraft concept wherein a large tug will carry one or more smaller “payload” spacecraft to Mars orbit and release them. It is named after “Lightships”, or boats sent to dangerous or remote seas and oceans to act as navigational beacons in lieu of lighthouses. The infrastructure side of the LightShip initiative focuses on communications and navigation at Mars. LightShip-1 should complete Phase B1 in the second quarter of 2027 but will need to wait for its implementation phase to be funded by ESA’s member states. This will seemingly lead to a roughly 18-month stretch of downtime before implementation can begin. A single LightShip can carry multiple different types of single large passenger science spacecraft or up to 12 individual smallsat passengers. MedaL envisions a roadmap of missions and associated technology development. The first mission using the MEDaL technologies and architecture is due to launch in 2035. This level of ambition is in line with ESA’s new long term policy goals of gaining true autonomy and self-sufficiency in space exploration. Dr Clare Parfitt, Mars Exploration Study Lead for the European Space Agency’s Exploration Preparation Research and Technology (ExPeRT) team, for clarifying comments and explanations. Your email address will not be published. Use the weekly Newsquiz to test your knowledge of stories you saw on Space Scout."
  },
  {
    "id": 32651,
    "title": "A Decade of Global Water Cycle Monitoring: NASA Soil Moisture Active Passive Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/a-decade-of-global-water-cycle-monitoring-nasa-soil-moisture-active-passive-mission/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-feature-article-banner.png",
    "news_site": "NASA",
    "summary": "Introduction The NASA Soil Moisture Active Passive (SMAP) mission, launched in 2015, has over 10 years of global L-band radiometry observations. The low frequency [1.4 GHz frequency or 21 cm (8 in) wavelength] measurements provide information on the state of land surfaces in all weather conditions – regardless of solar illumination. A principal objective of […]",
    "published_at": "2025-08-18T16:59:47Z",
    "updated_at": "2025-08-18T17:10:05.125942Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The NASA Soil Moisture Active Passive (SMAP) mission, launched in 2015, has over 10 years of global L-band radiometry observations. A principal objective of the SMAP mission is to provide estimates of surface soil moisture and its frozen or thawed status. Data have been used to quantify the linkages of the three main metabolic cycles (e.g., carbon, water, and energy) on land. The SMAP science goal is to develop observational benchmarks of how the water, energy, and carbon cycles link together over land. Soil moisture is the variable state of the land branch of the water cycle. Photosynthesis is down-regulated by both the deficit in water availability and the lack of an adequate amount of photosynthetically active radiation. The cryosphere community has raised a call-to-action to use every observing system and model available to monitor the patterns and rates of land ice melt. Surface melt affects the ice cap mass loss in many ways. The long-term climate and mass balance models rely on accurate representation of snow, firn, and ice processes to project the future sea level. The SMAP project has worked with the NASA Earth Science Division Applied Sciences Program (now known as Earth Science to Action) The SMAP data are still used for assessment of current conditions, as well as research and development. SMAP soil moisture data have been used by the U.S. Department of Agriculture for domestic and international crop yield applications. On-orbit data demonstrate that the RFI detection and filtering performs well and improves the quality of SMAP brightness temperature measurements. The algorithms are most effective at filtering RFI that is sparse in time and frequency, with minimal impact on the noise equivalent delta temperature (NEDT) – a measure of the radiometer sensitivity. Analysis of spectral information reveal many sources are likely terrestrial radar systems. The SPL2SMAP_S merges SMAP L-band radio brightness measurements with C-band synthetic aperture radar (SAR) measurements from the ESA Copernicus Sentinel-1 mission. The data have high resolution and allow the generation of 1 and 3 km (0.62 and 1.8 mi) merged surface soil moisture estimates. The SMAP mission was launched in 2015 and has produced over 10 years of science data. The data have been widely used in the Earth system science community and also applied to natural hazards applications. CIMR is currently in development; the first version is expected to launch within this decade and the second version in the mid 2030s."
  },
  {
    "id": 32652,
    "title": "Summary of the 54th U.S.–Japan ASTER Science Team Meeting",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/summary-of-the-54th-u-s-japan-aster-science-team-meeting/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-meeting-summary-banner.png",
    "news_site": "NASA",
    "summary": "Introduction The Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) Science Team (ST) organized a three-day workshop that took place June 9–11, 2025, at the Japan Space System’s (JSS) offices in Tokyo, Japan. About 25 people from Japan and the United States participated during the in-person meeting – see Photo 1. U.S. participants included representatives […]",
    "published_at": "2025-08-18T16:50:13Z",
    "updated_at": "2025-08-18T17:10:05.157589Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) Science Team (ST) organized a three-day workshop that took place June 9–11, 2025, at the Japan Space System’s (JSS) offices in Tokyo, Japan. About 25 people from Japan and the United States participated during the in-person meeting – see Photo 1. AIST continues to distribute ASTER’s pseudo-natural color scenes in keyhole mark-up language (KML) Michael Ramsey presented work on forecasting volcanic activity with the ASTER long-term archive. Miyuki Muto reported on waste volume changes in 15 open landfills in developing countries using more than 20 years of ASTER digital surface models. Mike Abrams presented on behalf of Cole Krehbiel [LP DAAC] and reported on the assessment of geometric performance of the L1 processing software. Soushi Kato presented results from his September 2024 field campaign in Nevada and Utah. Hideyuki Tonooka discussed the status of installation of the JPL radiometer at Lake Kasumigaura. The goal of the ASTER is to have the instrument acquire at least one cloud-free image for every place on Earth. Urgent observations receive the highest priority and can be scheduled close to acquisition time. The 54th ASTER ST Meeting successfully covered all critical issues introduced during the Opening Plenary Session. The 55 th joint meeting was tentatively scheduled for May 2026."
  },
  {
    "id": 32653,
    "title": "Portable Planetarium takes Thousands of Alaskan Students on a Cosmic Adventure",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/learning-resources/for-educators/portable-planetarium-takes-thousands-of-alaskan-students-on-a-cosmic-adventure/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/1_28_25_(2)-Carolyn_Y._Ng.jpeg",
    "news_site": "NASA",
    "summary": "Exploring the Cosmos and Inspiring Young Minds From January through June 2025, the Education Outreach Office at the University of Alaska Fairbanks Geophysical Institute (GI) continued its mission of bringing science to life by delivering the magic of its portable planetarium to communities across Alaska. This year, they reached over 1,807 students, educators, and participants […]",
    "published_at": "2025-08-18T16:37:46Z",
    "updated_at": "2025-08-18T17:10:05.164132Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "From January through June 2025, the University of Alaska Fairbanks Geophysical Institute delivered the magic of its portable planetarium to communities across Alaska. This year, they reached over 1,807 students, educators, and participants through engaging, interactive astronomy experiences. This program is funded in part by the NASA Heliophysics Education Activation Team."
  },
  {
    "id": 32650,
    "title": "Strategy 2040: Europe’s Vision for Exploration Beyond Artemis",
    "authors": [
      {
        "name": "Beverly Casillas",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/08/strategy-2040-europes-vision-for-exploration-beyond-artemis/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/08/Header.png",
    "news_site": "Space Scout",
    "summary": "Amidst a changing world, space powers like ESA are forced to contend with new realities - where existing allies are no longer and the game has drastically changed.",
    "published_at": "2025-08-18T16:26:06Z",
    "updated_at": "2025-08-18T16:30:15.879714Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Four years ago, the European Space Agency laid out a vision to ride the wave. In 2025, the space landscape has continued to evolve, and political uncertainty in the United States has thrown Europe’s position as a valued partner into question. Now, the agency has refined that early vision into Strategy 2040, a roadmap for ESA to reclaim its autonomy on the world stage. ESA would also focus on lunar habitation, communications, navigation, power, and mobility. Explore 2040 characterizes these “European-led capabilities’ as a departure from Europe’s role as a dependent collaborator. The Moon to Mars Architecture attacks Mars “from the top down,” prioritizing high-level decisions about the broad shape of a Mars mission. ESA has not historically enjoyed similar funding to NASA, but must nevertheless present equivalent value on the world stage. Even if the United States scraps its prior commitments and pivots towards an aggressive Mars campaign, Europe’s pursuit of immediately transferable technology programs ensures it will have something tangible and meaningful to bring to the table."
  },
  {
    "id": 32654,
    "title": "Bone Loss Research Launches Aboard NASA’s SpaceX-33 Resupply Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/bone-loss-research-launches-aboard-nasas-spacex-33-resupply-mission/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/bps/precision-health/mesenchymal%20stem%20cells.tif",
    "news_site": "NASA",
    "summary": "The 33rd SpaceX commercial resupply services mission for NASA, scheduled to liftoff from the agency’s Kennedy Space Center in Florida in late August, is heading to the International Space Station with an important investigation for the future of bone health. The experiment will test how microgravity affects bone-forming and bone-degrading cells and explore potential ways […]",
    "published_at": "2025-08-18T16:12:28Z",
    "updated_at": "2025-08-18T17:10:05.183222Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 33rd SpaceX commercial resupply services mission for NASA is scheduled to liftoff from the Kennedy Space Center in Florida in late August. The experiment will test how microgravity affects bone-forming and bone-degrading cells and explore potential ways to prevent bone loss. This research could help protect astronauts on future long-duration missions to the Moon and Mars."
  },
  {
    "id": 32649,
    "title": "NASA, Army National Guard Partner on Flight Training for Moon Landing",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/esdmd/artemis-campaign-development-division/human-landing-system-program/human-lander-challenge/nasa-army-national-guard-partner-on-flight-training-for-moon-landing/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/screenshot-2025-08-04-at-2-44-45%E2%80%AFpm.png",
    "news_site": "NASA",
    "summary": "By Corinne BeckingerWhen Artemis astronauts land on the Moon’s South Pole in a commercial human landing system, they will encounter a landscape pockmarked with deep craters, sloped connecting ridges, and harsh lighting conditions. The Moon’s lack of contrast, combined with its rolling terrain, will also pose a challenge, making it difficult for astronauts to overcome […]",
    "published_at": "2025-08-18T16:00:03Z",
    "updated_at": "2025-08-18T16:10:05.322523Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and the U.S. Army National Guard are using military helicopters to develop a foundational lunar landersimulated flight training course. The Moon’s lack of contrast, combined with its rolling terrain, will also pose a challenge, making it difficult for astronauts to overcome visual illusions on the lunar surface. The Artemis campaign will send astronauts to explore the Moon for scientific discovery, economic benefits, and to build the foundation for the first crewed missions to Mars. “Our Colorado Army National Guard pilots may not fly around the Moon, but we wear our motto, de monitbus ad astra — from the mountains to the stars — with pride”"
  },
  {
    "id": 32648,
    "title": "Artemis II Crew Practices Night Launch Scenario",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/artemis-ii-crew-practices-night-launch-scenario/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/ksc-20250812-ph-kls01-0106orig.jpg",
    "news_site": "NASA",
    "summary": "NASA astronauts Christina Koch, Artemis II mission specialist, and Victor Glover, Artemis II pilot, walk on the crew access arm of the mobile launcher in the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on Tuesday, Aug. 12, 2025. On Aug. 11 and 12, teams with the agency’s Exploration Ground Systems Program along with NASA […]",
    "published_at": "2025-08-18T15:52:14Z",
    "updated_at": "2025-08-18T16:00:08.418755Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Artemis campaign will send astronauts to explore the Moon for scientific discovery, economic benefits, and to build the foundation for the first crewed missions to Mars. On Aug. 11 and 12, NASA astronauts Reid Wiseman, Victor Glover, and Christina Koch, and CSA (Canadian Space Agency) astronaut Jeremy Hansen, practiced launch day operations if launch occurs at night."
  },
  {
    "id": 32646,
    "title": "Evaluating Blue Origin’s Mars Telecom Orbiter Proposal",
    "authors": [
      {
        "name": "Ryan Caton",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/blue-origin-mto-proposal/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-14-05-28-08-413.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Blue Origin has revealed its concept for a Mars Telecommunications Orbiter (MTO), entering a burgeoning…\nThe post Evaluating Blue Origin’s Mars Telecom Orbiter Proposal appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-18T14:58:25Z",
    "updated_at": "2025-08-18T15:00:14.793383Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Blue Origin has revealed its concept for a Mars Telecommunications Orbiter (MTO) The proposal includes multiple steerable high-rate links, bolstered by deployable Ultra-High Frequency satellites in low Mars orbit. With over one metric ton of additional payload capacity, Blue Origin asserts orbiter could be ready by 2028. Rocket Lab’s entry draws from its earlier Mars Sample Return (MSR) architecture. The company emphasizes its efficient in-house supply chain and proven track record. Lockheed Martin, a veteran in the field, bases its proposal on a fixed-price MSR mission concept."
  },
  {
    "id": 32645,
    "title": "NASA Invites Media to Northrop Grumman CRS-23 Station Resupply Launch",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-northrop-grumman-crs-23-station-resupply-launch/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/53903856291-669a22d3a7-k.jpg",
    "news_site": "NASA",
    "summary": "Media accreditation is open for the next launch to deliver NASA science investigations, supplies, and equipment to the International Space Station. A Northrop Grumman Cygnus spacecraft will launch to the orbital laboratory on a SpaceX Falcon 9 rocket for NASA. The mission is known as NASA’s Northrop Grumman Commercial Resupply Services 23, or Northrop Grumman […]",
    "published_at": "2025-08-18T14:51:11Z",
    "updated_at": "2025-08-18T15:01:09.983962Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "3bfed6d5-d65e-4133-b51a-b664bbd9d006",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Media accreditation is open for the next launch to deliver NASA science investigations, supplies, and equipment to the International Space Station. A Northrop Grumman Cygnus spacecraft will launch to the orbital laboratory on a SpaceX Falcon 9 rocket for NASA. The spacecraft will remain at the space station for more than two months."
  },
  {
    "id": 32644,
    "title": "New ESA Business Incubator in Spain Opens First Call for Proposals",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/new-esa-business-incubator-in-spain-opens-first-call-for-proposals/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/New-ESA-Business-Incubator-in-Spain-Opens-First-Call-for-Proposals.webp",
    "news_site": "European Spaceflight",
    "summary": "The European Space Agency’s new Business Incubation Centre in Andalusia, southern Spain, has opened its first call for proposals, offering up to €60,000 to space startups in the region. Launched in 2003, the ESA Business Incubation Centres initiative is part of the agency’s efforts to commercialise national investments in its space programmes. The initiative targets […]\nThe post New ESA Business Incubator in Spain Opens First Call for Proposals appeared first on European Spaceflight.",
    "published_at": "2025-08-18T13:50:21Z",
    "updated_at": "2025-08-18T14:00:15.013901Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency’s new Business Incubation Centre in Andalusia, southern Spain, has opened its first call for proposals. The initiative targets newly formed companies as well as startups that have been in business for no longer than five years. There are currently more than 30 BICs across Europe, which have supported approximately 1,500 startups."
  },
  {
    "id": 32643,
    "title": "NASA Challenge Winners Cook Up New Industry Developments",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/prizes-challenges-crowdsourcing-program/nasa-challenge-winners-cook/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/il-nucleus-3.jpg",
    "news_site": "NASA",
    "summary": "NASA invests in technologies that have the potential to revolutionize space exploration, including the way astronauts live in space. Through the Deep Space Food Challenge, NASA, in partnership with CSA (Canadian Space Agency), sought novel food production systems that could provide long-duration human space exploration missions with safe, nutritious, and tasty food. Three winners selected […]",
    "published_at": "2025-08-18T13:22:24Z",
    "updated_at": "2025-08-18T13:30:06.569217Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA sought novel food production systems that could provide long-duration human space exploration missions with safe, nutritious, and tasty food. Interstellar Lab of Merritt Island, Florida, won the challenge’s $750,000 grand prize for its food production system NuCLEUS. Team Nolux, formed from faculty members, graduate, and undergraduate students from the University of California, Riverside, won a $250,000 second prize. NASA is celebrating its centennial with a series of challenges. Stay tuned for more information: http://www.nasa.gov/prizes-challenge-and-crowdsourcing/centennial-challenges. NASA explores the unknown in air and space, innovates for the benefit of humanity."
  },
  {
    "id": 32642,
    "title": "ESA’s Arctic Weather Satellite adds power to forecasts",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Meteorological_missions/Arctic_Weather_Satellite/ESA_s_Arctic_Weather_Satellite_adds_power_to_forecasts",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/07/arctic_weather_satellite_small_but_perfectly_formed/26216370-1-eng-GB/Arctic_Weather_Satellite_small_but_perfectly_formed_card_full.png",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-18T11:34:00Z",
    "updated_at": "2025-08-18T15:00:19.328774Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "d61c53c4-669a-44cd-a905-cea38e8e21d6",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The European Centre for Medium-Range Weather Forecasts (ECMWF) is the first centre to use these new observations operationally, which are leading to a robust improvement in forecasts. The data, along with numerous other observations, are merged with a short-range forecast that is guided by earlier measurements to produce the most accurate possible snapshot of the Earth’s current state. The proposed constellation would comprise six satellites for higher temporal coverage. Each satellite would be replenished three times to ensure data is delivered for years to come. It is envisaged that ESA would build the EPS-Sterna constellation in cooperation with Eumetsat, following the established model for Europe's other meteorological missions."
  },
  {
    "id": 32641,
    "title": "Curiosity Blog, Sols 4629-4630: Feeling Hollow",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4629-4630-feeling-hollow/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04628_opgs_edr_ncam_NLB_808343280EDR_F1180924NCAM00353M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Elena Amador-French, Science Operations Coordinator at NASA’s Jet Propulsion Laboratory Earth planning date: Wednesday, Aug. 13, 2025 Today’s team investigated the texture and chemistry of the bedrock within a topographic low, or hollow, found within the greater boxwork area. We will place our APXS instrument on the “Asiruqucha” target, some light-toned, small-scale nodular […]",
    "published_at": "2025-08-18T07:03:09Z",
    "updated_at": "2025-08-18T07:56:52.160504Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "df8d4fdb-9add-4ce9-9f0e-aae1c61df212",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Today’s team investigated the texture and chemistry of the bedrock within a topographic low, or hollow, found within the greater boxwork area. We will also observe a small crescent-shaped rock named “Wedge Tailed Hillstar” with MAHLI. Once these observations are completed Curiosity will set off on a 30-meter drive (about 98 feet) to an interesting ridge feature."
  },
  {
    "id": 32640,
    "title": "Countdown To Launch : What to Expect From Starship Flight 10",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/countdown-to-launch-what-to-expect-from-starship-flight-10",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755474284234.jpeg",
    "news_site": "The Launch Pad",
    "summary": "Countdown To Launch : What to Expect From Starship Flight 10",
    "published_at": "2025-08-17T22:58:00Z",
    "updated_at": "2025-08-18T00:00:56.536466Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is targeting Sunday, August 24, 2025, for the tenth flight test of Starship. The launch window opens at 6:30 p.m. CT (23:30 UTC) Starship will carry eight Starlink simulators sized to match next-generation Starlink V3 satellites. SpaceX is steadily moving closer to its operational goal: a rapidly reusable super-heavy launch system. Every test generates terabytes of telemetry and video data, feeding directly into next-generation Starship designs. The company has stated that only two more flights remain with the current generation of Starship/Super Heavy."
  },
  {
    "id": 32661,
    "title": "Launch Roundup: SpaceX, Chinese, and Russian missions make up busy week",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/launch-roundup-081825/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/07/IMG_2367-scaled.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "A Chinese rocket, a pair of Russian missions, a trio of Falcon 9 launches, and…\nThe post Launch Roundup: SpaceX, Chinese, and Russian missions make up busy week appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-17T22:38:42Z",
    "updated_at": "2025-08-18T21:20:10.278531Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A Chinese rocket, a pair of Russian missions, a trio of Falcon 9 launches, and the long-awaited tenth flight of Starship are scheduled to fly this week. A Soyuz rocket is to fly a modernized version of the Vostok capsule that flew crewed missions in the 1960s from Baikonur, while an Angara rocket is flying from the Russian military launch site in Plesetsk. Soyuz 2.1a rocket will loft Bion-M spacecraft to a 300-370 km altitude. The 6,300 kg spacecraft is derived from the Vostok spacecraft that launched Yuri Gagarin to space on April 12, 1961. The mission is scheduled to last for 30 days before the spacecraft returns to Earth. U.S. Space Force’s USSF-36 mission will fly aboard a Falcon 9 from Kennedy Space Center. A X-37B Orbital Test Vehicle (OTV) is flying the program’s eighth mission since the OTV-1 mission in 2010 aboard an Atlas V. This flight will be the 101st Falcon 9 launch of 2025, as SpaceX works to fly up to 160 missions this year. CRS-33 mission is scheduled for Sunday, Aug. 24, at 2:45 AM EDT (06:45 UTC) from SLC-40 at the Cape Canaveral Space Force Station. Ship 36 exploded on the test stand at Masseys just before it was supposed to perform a six-engine static fire, forcing SpaceX to reassign Ship 37 to Flight 10. The explosion knocked the Massey’s Test Facility out of service for at least several months for static fire testing. To work around the lack of testing infrastructure, SpaceX designed a mount to static fire Ship 37 on the orbital launch mount at Pad 1."
  },
  {
    "id": 32638,
    "title": "Launch Roundup: Falcon 9, Starship, and Russia flying this week",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/launch-roundup-falcon-9-starship-and-russia-flying-this-week/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2024/10/A-Falcon-9-sits-on-the-pad-at-SLC-4E-at-the-Vandenberg-Space-Force-Base-Credit-SpaceX-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "A pair of Russian space missions, a trio of Falcon 9 launches, and the long-awaited…\nThe post Launch Roundup: Falcon 9, Starship, and Russia flying this week appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-17T22:38:42Z",
    "updated_at": "2025-08-17T22:40:22.052828Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A pair of Russian space missions, a trio of Falcon 9 launches, and the long-awaited Starship Flight 10 are scheduled to fly this week. A Soyuz rocket is to fly a modernized version of the Vostok capsule that flew crewed missions in the 1960s from Baikonur while an Angara rocket is flying from the Russian military launch site in Plesetsk. SpaceX is flying one Starlink mission, a national security mission and a cargo flight to the International Space Station. Bion-M no. 2 will fly 75 mice and study how these mice are affected by radiation. 1,000 fruit flies will also be on board along with plants and microorganisms. The mission is scheduled to last for 30 days before the spacecraft returns to Earth. U.S. Space Force national security launch scheduled to fly aboard a Falcon 9. Falcon 9|Starlink 17-6 is scheduled to fly on Friday, Aug. 22 at 8:44 AM PDT (15:44 UTC) from Space Launch Complex-4E at VSFB. The flight will carry 24 Starlink v2 Mini satellites to low-Earth orbit, while the booster, B1081-17, will perform a recovery on Of Course I Still Love You. This will be the fourth Starship flight of 2025 and the next to last flight from Pad 1 in its current configuration. On this flight, Ship 37 is carrying eight dummy Starlink satellites to be deployed. SpaceX will attempt to get valuable reentry data before a planned splashdown in the Indian Ocean. This flight would also be the first fully successful Block 2 flight if it splashes down intact."
  },
  {
    "id": 32639,
    "title": "President Trump Signs Executive Order to Streamline U.S. Commercial Space Regulations",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/policy-and-finance/trump-signs-executive-order-to-streamline-us-commercial-space-regulations",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755470409656.jpeg",
    "news_site": "The Launch Pad",
    "summary": "President Trump Signs Executive Order to Streamline U.S. Commercial Space Regulations",
    "published_at": "2025-08-17T22:36:00Z",
    "updated_at": "2025-08-17T22:50:16.243387Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Donald Trump has signed a sweeping new Executive Order aimed at transforming the regulatory landscape for America’s commercial space sector. The order seeks to cut through longstanding bureaucratic hurdles, accelerate launch licensing, and position the United States as the premier hub for space exploration and industry by 2030. The Executive Order builds on previous efforts under Trump’s first term. Analysts suggest the changes could sharply increase the cadence of commercial launches from U.S. soil. The proposals may also trigger legal battles with environmental groups and state governments concerned about fast-tracked reviews. While official industry responses are still emerging, early signals suggest strong support."
  },
  {
    "id": 32637,
    "title": "Starlink Doubles Up, ISS Gets A New Booster, X-37B Returns, and Starship is GO For Launch This Week",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/weekly-pre-launch-preview-august-18-24-2025",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755462812829.png",
    "news_site": "The Launch Pad",
    "summary": "Starlink Doubles Up, ISS Gets A New Booster, X-37B Returns, and Starship is GO For Launch This Week",
    "published_at": "2025-08-17T19:46:00Z",
    "updated_at": "2025-08-17T20:50:20.247576Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The week begins on the U.S. West Coast, where a Falcon 9 Block 5 rocket will lift off from Vandenberg Space Force Base’s SLC-4E at 11:44 EDT (15:44 UTC) The mission, Starlink 17-5, will deploy 24 Starlink V2 Mini satellites into a Sun-synchronous orbit at approximately 97.6° inclination. On the same day, Russia plans to launch an Angara 1.2 rocket from Plesetsk Cosmodrome at 04:30 EDT (08:30 UTC) Attention then turns to Florida, as SpaceX prepares to launch the USSF-36 mission, carrying the Boeing X-37B Orbital Test Vehicle. This week's lineup illustrates the expanding global scope of space operations. From Russia’s scientific return capsule to U.S. classified military spaceplanes, each mission underscores the diversity of modern spaceflight. Stay tuned to The Launch Pad for live coverage and mission updates throughout the week."
  },
  {
    "id": 32636,
    "title": "What’s Happening in Space Policy August 17-24, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-august-17-24-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/X37B-in-FH-fairing-Aug-25-USSF.avif",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week plus a day of August 17-24, 2025 and any insight we can offer about them. The House and Senate […]",
    "published_at": "2025-08-17T19:07:06Z",
    "updated_at": "2025-08-17T19:10:35.436690Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpacePolicyOnline.com’s list of space policy events for the week plus a day of August 17-24, 2025. The House and Senate are in recess until September 2 except for pro forma sessions. The 8th launch of the X-37B spaceplane for the U.S. Space Force (USSF) is scheduled for Thursday. John Wisniewski will give a NASA HQ update at 10:15 am ET including “internal changes, impact on the community” Shawn Domagal-Goldman, Acting Astrophysics Division Director on a 1-year detail from Goddard Space Flight Center, will provide an update on the Science Mission Directorate later in the day. Finding exoplanets that might support life ties into NASA’s astrobiology program in the Planetary Sciences Division."
  },
  {
    "id": 32635,
    "title": "Live coverage: 24 Starlink satellites to launch from California on 100th Falcon 9 rocket of the year",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/17/live-coverage-24-starlink-satellites-to-launch-from-california-on-100th-falcon-9-rocket-of-the-year/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 17-5 mission will add another 24 broadband satellites to the company’s constellation of more than 8,100 currently in orbit. SpaceX is targeting liftoff from pad 4E at 9:23 a.m. PDT (12:23 p.m. EDT / 1623 UTC). ",
    "published_at": "2025-08-17T17:22:06Z",
    "updated_at": "2025-08-17T17:30:15.109907Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is set to launch its 100th Falcon 9 rocket of the year on Monday morning. The flight from Vandenberg Space Force Base will carry another batch of Starlink V2 Mini satellites into low Earth orbit. The Starlink 17-5 mission will also be the 72nd SpaceX launch ofStarlink satellites so far in 2025."
  }
]