[
  {
    "id": 32659,
    "title": "Where the Wild Things Are: Wildlife Management with Johnson’s Matt Strausser",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/where-the-wild-things-are-wildlife-management-with-johnsons-matt-strausser/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/07/jsc2014e021744.jpg",
    "news_site": "NASA",
    "summary": "If you asked someone what they expected to see during a visit to NASA’s Johnson Space Center, they would probably list things like astronauts, engineers, and maybe a spacecraft or two. It might be a surprise to learn you can also spy hundreds of species of animals – from geckos and snakes to white-tailed deer […]",
    "published_at": "2025-08-18T21:00:00Z",
    "updated_at": "2025-08-18T21:00:09.705413Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Matt Strausser is Johnson Space Center's senior biologist for wildlife management. He works to reduce the negative impacts animals can have on Johnson’s operations. Strausser also works to engage project and facility managers and provide recommendations on how to prevent or reduce the impact of wildlife problems onsite. Strausser says accomplishing the goals of the agency’s Artemis campaign will require a tremendous amount of specialized support infrastructure. “Building a wildlife and natural resource program from the ground up and bringing all of these once-disconnected and diverse professionals together to effectively address problems – that is the achievement I take the most pride in,” he said."
  },
  {
    "id": 32660,
    "title": "NASA Sets Coverage for SpaceX 33rd Station Resupply Launch, Arrival",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-sets-coverage-for-spacex-33rd-station-resupply-launch-arrival/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/spacex-falcon-9-rocket-carrying-dragon-crs-33-release-aug-18.jpg",
    "news_site": "NASA",
    "summary": "NASA and SpaceX are targeting 2:45 a.m. EDT, Sunday, Aug. 24, for the next launch to deliver science investigations, supplies, and equipment to the International Space Station. This is the 33rd SpaceX commercial resupply services mission to the orbital laboratory for NASA. Filled with more than 5,000 pounds of supplies, a SpaceX Dragon spacecraft on […]",
    "published_at": "2025-08-18T20:50:17Z",
    "updated_at": "2025-08-18T21:00:09.718322Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "This is the 33rd SpaceX commercial resupply services mission to the orbital laboratory for NASA. Filled with more than 5,000 pounds of supplies, a SpaceX Dragon spacecraft on a Falcon 9 rocket will lift off from Space Launch Complex 40 at Cape Canaveral Space Force Station in Florida. Dragon will dock autonomously about 7:30 a.m. on Monday, Aug. 25, to the forward port of the space station’s Harmony module. Let people know you’re watching the mission on X, Facebook, and Instagram by following and tagging these accounts. NASA’s virtual guest program for this mission also includes curated launch resources, notifications about related opportunities or changes, and a stamp for the NASA virtual guest passport following launch."
  },
  {
    "id": 32658,
    "title": "Station Nation: Meet Tess Caswell, Extravehicular Activity Flight Controller and Lead Capsule Communicator",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/station-nation-meet-tess-caswell-extravehicular-activity-flight-controller-and-lead-capsule-communicator/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/alison-tess-fcr-view-jsc2025e031847.jpg",
    "news_site": "NASA",
    "summary": "Tess Caswell supports the International Space Station from NASA’s Johnson Space Center in Houston as a capsule communicator, or capcom, as well as through the Extravehicular Activity Office. She is currently on rotation as the Artemis lead capcom, helping to develop training and processes for the Artemis campaign by leveraging her experience supporting the space […]",
    "published_at": "2025-08-18T19:38:40Z",
    "updated_at": "2025-08-18T19:40:05.988715Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Tess Caswell supports the International Space Station from NASA’s Johnson Space Center in Houston. She is currently on rotation as the Artemis lead capcom, helping to develop training and processes for the Artemis campaign. Caswell: I like to encourage young people to think about what part of space travel inspires them. Tess Caswell is an Extravehicular Activity Flight Controller and Lead Capsule Communicator. The space station brings people together in a common mission that benefits all of us. If you could have dinner with any astronaut, past or present, who would it be? Sally Ride, definitely."
  },
  {
    "id": 32656,
    "title": "After recent tests, China appears likely to beat the United States back to the Moon",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/after-recent-tests-china-appears-likely-to-beat-the-united-states-back-to-the-moon/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2230278319.jpg",
    "news_site": "Arstechnica",
    "summary": "An expert explains why this will be enormously bad for the United States.",
    "published_at": "2025-08-18T17:18:22Z",
    "updated_at": "2025-08-18T17:30:05.834319Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Chinese space program has reported some significant milestones in developing its program to land astronauts on the lunar surface by 2030. On August 6, the China Manned Space Agency successfully tested a high-fidelity mockup of its 26-ton \"Lanyue\" lunar lander. This work suggests that China is on course to land on the Moon before the end of this decade. Cheng: It seems quite likely that the Chinese will land on the Moon before NASA can return to the Moon. Cheng: If China regularly dispatches lunar missions, then it will rightfully be able to argue that Chinese should be the language of lunar/cis-lunar space traffic management. The Chinese are stable, systematic. They pursue a given goal (e.g., human spaceflight, a space station) over decades, with persistence and programmatic stability. So I expect that the Chinese will put a Chinese person on the Moon by 2030 and follow that with additional crewed and unmanned facilities. This will be supported by a built-out infrastructure of lunar PNT/comms."
  },
  {
    "id": 32657,
    "title": "Summary of the 2025 GEDI Science Team Meeting",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/uncategorized/summary-of-the-2025-gedi-science-team-meeting/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-meeting-summary-banner.png",
    "news_site": "NASA",
    "summary": "Introduction The 2025 Global Ecosystem Dynamics Investigation (GEDI) Science Team Meeting (STM) took place April 1–3, 2025 at the University of Maryland, College Park (UMD). Upwards of 60 participants attended in-person, while several others joined virtually by Zoom. The GEDI Mission and Competed Science Team members were in attendance along with the GEDI NASA program […]",
    "published_at": "2025-08-18T17:08:05Z",
    "updated_at": "2025-08-18T18:10:05.645560Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 2025 Global Ecosystem Dynamics Investigation (GEDI) Science Team Meeting (STM) took place April 1–3, 2025 at the University of Maryland, College Park. Participants shared updates on the GEDI instrument and data products post-hibernation. They also shared progress reports on the second Competed Science Team cohort’s projects. GEDI-related publications and datasets are appearing in high-impact journals, including PNAS , Nature , and Science families. As of March 2025, each of the instrument’s three lasers logged over 22,000 hours in firing mode, collecting more than 20 billion shots each. The Science Data Processing System also underwent a technical refresh that increased computational and data storage capability. GEDI quality filtering and aboveground biomass density (AGBD) model selection and prediction rely heavily on stratification by plant functional type and geographic world region. Canopy structure data, like that provided by GEDI, can play a key role in developing physics-based fire behavior models, such as QUIC-Fire. Chris Hakkenberg presented research using GEDI to characterize fuel structure, burn severity, and post-fire response across the regions of California affected by wildfire. Sean Healey presented an overview of the Online Biomass Inference using Waveforms and iNventory (OBI-WAN) project. Michelle Hofton and Sarah Story returned to the topic of G EDI data product status. GEDI Co-I presented on GEDI L2B data, which provides gridded footprint-level [25-m (82-ft) resolution] metrics such as canopy cover. John Armston explained that the upcoming V3.0 release will differ from V2.0 in that it will use GEDi-derived canopy-ground reflectance ratios to estimate canopy cover, thus allowing for spatial variability. L4A V2.1 was updated to include data through mission week (MW) 311 (i.e., through November 2024) and is now available to end users. V3.0, along with an updated Algorithm Theoretical Basis Document (ATBD), is expected later in 2025. The revised ATBD will outline enhancements to the waveform simulator, quality filtering, stratification, and model selection. GEDI L4D Imputed Waveform product aims to generate a wall-to-wall 30-m (98-ft) resolution map of GEDI waveforms across the globe in 2023. Neha Hunka [European Space Agency] shared her work using GEDi to fill gaps in the Republic of Sudan’s National Forest Inventory ( NFI) Stuart Davies [Smithsonian Institution) presented his work on GEO-TREES, a global forest biomass reference system. GEDI can detect both immediate fire effects as well as recovery after disturbance, including stand-replacement and understory clearing. By overlaying disturbance maps with GEDI data, the team observed that recovery rates differ across height class. Chi Chen’s research aims to generate gap-free, high-temporal-frequency canopy profile data. GEDI L3 and L4 datasets have been released: L4B (country-level summaries of aboveground biomass), L4C (footprint level waveform structural complexity index) and a GEDI-FIA (fusion dataset for training lidar models to forest attributes) In total, almost 34,000 unique users have downloaded GEDC data 13,770,648 times, with L4A being the most popular at 13.1 million downloads. As of April 30, 2025, all G EDI footprint-level datasets from L1–L4 are available with data through MW 311. GEDI datasets can help identify critical data and knowledge gaps, guiding the development of new missions – e.g., the Surface Topography and Vegetation (STV) mission concept called for in the 2017 Earth Science Decadal Survey report. Jody Vogeler presented her research using GEDI data fusions to characterize post-fire landscapes and understand habitat refugia for the threatened Canada lynx. The 2025 GEDI STM was especially exciting, as it came on the cusp of post-storage data being processed and released as V2.1. The meeting highlighted the mission’s ongoing success and scientific value following hibernation on the ISS. Looking ahead, data users can anticipate the V3.0 product release later in 2025."
  },
  {
    "id": 32655,
    "title": "ESA Increases Mars Ambitions with Mars Transportation Infrastructure",
    "authors": [
      {
        "name": "Emily B",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/08/esa-increases-mars-ambitions-with-mars-transportation-infrastructure/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/08/LightShip_ESA_s_martian_tug-scaled.jpg",
    "news_site": "Space Scout",
    "summary": "As the European Space Agency (ESA)'s ExoMars/Rosalind Franklin Mission prepares for its 2028 launch, the agency is looking forward to future Mars science and exploration needs with an eye towards increasing European space independence.",
    "published_at": "2025-08-18T17:06:03Z",
    "updated_at": "2025-08-18T17:10:15.791847Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "LightShip is a mission and spacecraft concept wherein a large tug will carry one or more smaller “payload” spacecraft to Mars orbit and release them. It is named after “Lightships”, or boats sent to dangerous or remote seas and oceans to act as navigational beacons in lieu of lighthouses. The infrastructure side of the LightShip initiative focuses on communications and navigation at Mars. LightShip-1 should complete Phase B1 in the second quarter of 2027 but will need to wait for its implementation phase to be funded by ESA’s member states. This will seemingly lead to a roughly 18-month stretch of downtime before implementation can begin. A single LightShip can carry multiple different types of single large passenger science spacecraft or up to 12 individual smallsat passengers. MedaL envisions a roadmap of missions and associated technology development. The first mission using the MEDaL technologies and architecture is due to launch in 2035. This level of ambition is in line with ESA’s new long term policy goals of gaining true autonomy and self-sufficiency in space exploration. Dr Clare Parfitt, Mars Exploration Study Lead for the European Space Agency’s Exploration Preparation Research and Technology (ExPeRT) team, for clarifying comments and explanations. Your email address will not be published. Use the weekly Newsquiz to test your knowledge of stories you saw on Space Scout."
  },
  {
    "id": 32651,
    "title": "A Decade of Global Water Cycle Monitoring: NASA Soil Moisture Active Passive Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/a-decade-of-global-water-cycle-monitoring-nasa-soil-moisture-active-passive-mission/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-feature-article-banner.png",
    "news_site": "NASA",
    "summary": "Introduction The NASA Soil Moisture Active Passive (SMAP) mission, launched in 2015, has over 10 years of global L-band radiometry observations. The low frequency [1.4 GHz frequency or 21 cm (8 in) wavelength] measurements provide information on the state of land surfaces in all weather conditions – regardless of solar illumination. A principal objective of […]",
    "published_at": "2025-08-18T16:59:47Z",
    "updated_at": "2025-08-18T17:10:05.125942Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The NASA Soil Moisture Active Passive (SMAP) mission, launched in 2015, has over 10 years of global L-band radiometry observations. A principal objective of the SMAP mission is to provide estimates of surface soil moisture and its frozen or thawed status. Data have been used to quantify the linkages of the three main metabolic cycles (e.g., carbon, water, and energy) on land. The SMAP science goal is to develop observational benchmarks of how the water, energy, and carbon cycles link together over land. Soil moisture is the variable state of the land branch of the water cycle. Photosynthesis is down-regulated by both the deficit in water availability and the lack of an adequate amount of photosynthetically active radiation. The cryosphere community has raised a call-to-action to use every observing system and model available to monitor the patterns and rates of land ice melt. Surface melt affects the ice cap mass loss in many ways. The long-term climate and mass balance models rely on accurate representation of snow, firn, and ice processes to project the future sea level. The SMAP project has worked with the NASA Earth Science Division Applied Sciences Program (now known as Earth Science to Action) The SMAP data are still used for assessment of current conditions, as well as research and development. SMAP soil moisture data have been used by the U.S. Department of Agriculture for domestic and international crop yield applications. On-orbit data demonstrate that the RFI detection and filtering performs well and improves the quality of SMAP brightness temperature measurements. The algorithms are most effective at filtering RFI that is sparse in time and frequency, with minimal impact on the noise equivalent delta temperature (NEDT) – a measure of the radiometer sensitivity. Analysis of spectral information reveal many sources are likely terrestrial radar systems. The SPL2SMAP_S merges SMAP L-band radio brightness measurements with C-band synthetic aperture radar (SAR) measurements from the ESA Copernicus Sentinel-1 mission. The data have high resolution and allow the generation of 1 and 3 km (0.62 and 1.8 mi) merged surface soil moisture estimates. The SMAP mission was launched in 2015 and has produced over 10 years of science data. The data have been widely used in the Earth system science community and also applied to natural hazards applications. CIMR is currently in development; the first version is expected to launch within this decade and the second version in the mid 2030s."
  },
  {
    "id": 32652,
    "title": "Summary of the 54th U.S.–Japan ASTER Science Team Meeting",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/summary-of-the-54th-u-s-japan-aster-science-team-meeting/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-meeting-summary-banner.png",
    "news_site": "NASA",
    "summary": "Introduction The Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) Science Team (ST) organized a three-day workshop that took place June 9–11, 2025, at the Japan Space System’s (JSS) offices in Tokyo, Japan. About 25 people from Japan and the United States participated during the in-person meeting – see Photo 1. U.S. participants included representatives […]",
    "published_at": "2025-08-18T16:50:13Z",
    "updated_at": "2025-08-18T17:10:05.157589Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) Science Team (ST) organized a three-day workshop that took place June 9–11, 2025, at the Japan Space System’s (JSS) offices in Tokyo, Japan. About 25 people from Japan and the United States participated during the in-person meeting – see Photo 1. AIST continues to distribute ASTER’s pseudo-natural color scenes in keyhole mark-up language (KML) Michael Ramsey presented work on forecasting volcanic activity with the ASTER long-term archive. Miyuki Muto reported on waste volume changes in 15 open landfills in developing countries using more than 20 years of ASTER digital surface models. Mike Abrams presented on behalf of Cole Krehbiel [LP DAAC] and reported on the assessment of geometric performance of the L1 processing software. Soushi Kato presented results from his September 2024 field campaign in Nevada and Utah. Hideyuki Tonooka discussed the status of installation of the JPL radiometer at Lake Kasumigaura. The goal of the ASTER is to have the instrument acquire at least one cloud-free image for every place on Earth. Urgent observations receive the highest priority and can be scheduled close to acquisition time. The 54th ASTER ST Meeting successfully covered all critical issues introduced during the Opening Plenary Session. The 55 th joint meeting was tentatively scheduled for May 2026."
  },
  {
    "id": 32653,
    "title": "Portable Planetarium takes Thousands of Alaskan Students on a Cosmic Adventure",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/learning-resources/for-educators/portable-planetarium-takes-thousands-of-alaskan-students-on-a-cosmic-adventure/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/learn/science-activation-stories/2025/1_28_25_(2)-Carolyn_Y._Ng.jpeg",
    "news_site": "NASA",
    "summary": "Exploring the Cosmos and Inspiring Young Minds From January through June 2025, the Education Outreach Office at the University of Alaska Fairbanks Geophysical Institute (GI) continued its mission of bringing science to life by delivering the magic of its portable planetarium to communities across Alaska. This year, they reached over 1,807 students, educators, and participants […]",
    "published_at": "2025-08-18T16:37:46Z",
    "updated_at": "2025-08-18T17:10:05.164132Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "From January through June 2025, the University of Alaska Fairbanks Geophysical Institute delivered the magic of its portable planetarium to communities across Alaska. This year, they reached over 1,807 students, educators, and participants through engaging, interactive astronomy experiences. This program is funded in part by the NASA Heliophysics Education Activation Team."
  },
  {
    "id": 32650,
    "title": "Strategy 2040: Europe’s Vision for Exploration Beyond Artemis",
    "authors": [
      {
        "name": "Beverly Casillas",
        "socials": null
      }
    ],
    "url": "https://www.spacescout.info/2025/08/strategy-2040-europes-vision-for-exploration-beyond-artemis/",
    "image_url": "https://i0.wp.com/www.spacescout.info/wp-content/uploads/2025/08/Header.png",
    "news_site": "Space Scout",
    "summary": "Amidst a changing world, space powers like ESA are forced to contend with new realities - where existing allies are no longer and the game has drastically changed.",
    "published_at": "2025-08-18T16:26:06Z",
    "updated_at": "2025-08-18T16:30:15.879714Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Four years ago, the European Space Agency laid out a vision to ride the wave. In 2025, the space landscape has continued to evolve, and political uncertainty in the United States has thrown Europe’s position as a valued partner into question. Now, the agency has refined that early vision into Strategy 2040, a roadmap for ESA to reclaim its autonomy on the world stage. ESA would also focus on lunar habitation, communications, navigation, power, and mobility. Explore 2040 characterizes these “European-led capabilities’ as a departure from Europe’s role as a dependent collaborator. The Moon to Mars Architecture attacks Mars “from the top down,” prioritizing high-level decisions about the broad shape of a Mars mission. ESA has not historically enjoyed similar funding to NASA, but must nevertheless present equivalent value on the world stage. Even if the United States scraps its prior commitments and pivots towards an aggressive Mars campaign, Europe’s pursuit of immediately transferable technology programs ensures it will have something tangible and meaningful to bring to the table."
  },
  {
    "id": 32654,
    "title": "Bone Loss Research Launches Aboard NASA’s SpaceX-33 Resupply Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/bone-loss-research-launches-aboard-nasas-spacex-33-resupply-mission/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/bps/precision-health/mesenchymal%20stem%20cells.tif",
    "news_site": "NASA",
    "summary": "The 33rd SpaceX commercial resupply services mission for NASA, scheduled to liftoff from the agency’s Kennedy Space Center in Florida in late August, is heading to the International Space Station with an important investigation for the future of bone health. The experiment will test how microgravity affects bone-forming and bone-degrading cells and explore potential ways […]",
    "published_at": "2025-08-18T16:12:28Z",
    "updated_at": "2025-08-18T17:10:05.183222Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The 33rd SpaceX commercial resupply services mission for NASA is scheduled to liftoff from the Kennedy Space Center in Florida in late August. The experiment will test how microgravity affects bone-forming and bone-degrading cells and explore potential ways to prevent bone loss. This research could help protect astronauts on future long-duration missions to the Moon and Mars."
  },
  {
    "id": 32647,
    "title": "NASA, Army National Guard Partner on Flight Training for Moon Landing",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/nasa-army-national-guard-partner-on-flight-training-for-moon-landing/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/screenshot-2025-08-04-at-2-44-45%E2%80%AFpm.png",
    "news_site": "NASA",
    "summary": "By Corinne BeckingerWhen Artemis astronauts land on the Moon’s South Pole in a commercial human landing system, they will encounter a landscape pockmarked with deep craters, sloped connecting ridges, and harsh lighting conditions. The Moon’s lack of contrast, combined with its rolling terrain, will also pose a challenge, making it difficult for astronauts to overcome […]",
    "published_at": "2025-08-18T16:00:03Z",
    "updated_at": "2025-08-18T16:00:08.398967Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and the U.S. Army National Guard are using military helicopters to develop a foundational lunar landersimulated flight training course. The Moon’s lack of contrast, combined with its rolling terrain, will also pose a challenge, making it difficult for astronauts to overcome visual illusions on the lunar surface. The Artemis campaign will send astronauts to explore the Moon for scientific discovery, economic benefits, and to build the foundation for the first crewed missions to Mars. “Our Colorado Army National Guard pilots may not fly around the Moon, but we wear our motto, de monitbus ad astra — from the mountains to the stars — with pride”"
  },
  {
    "id": 32649,
    "title": "NASA, Army National Guard Partner on Flight Training for Moon Landing",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/esdmd/artemis-campaign-development-division/human-landing-system-program/human-lander-challenge/nasa-army-national-guard-partner-on-flight-training-for-moon-landing/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/screenshot-2025-08-04-at-2-44-45%E2%80%AFpm.png",
    "news_site": "NASA",
    "summary": "By Corinne BeckingerWhen Artemis astronauts land on the Moon’s South Pole in a commercial human landing system, they will encounter a landscape pockmarked with deep craters, sloped connecting ridges, and harsh lighting conditions. The Moon’s lack of contrast, combined with its rolling terrain, will also pose a challenge, making it difficult for astronauts to overcome […]",
    "published_at": "2025-08-18T16:00:03Z",
    "updated_at": "2025-08-18T16:10:05.322523Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA and the U.S. Army National Guard are using military helicopters to develop a foundational lunar landersimulated flight training course. The Moon’s lack of contrast, combined with its rolling terrain, will also pose a challenge, making it difficult for astronauts to overcome visual illusions on the lunar surface. The Artemis campaign will send astronauts to explore the Moon for scientific discovery, economic benefits, and to build the foundation for the first crewed missions to Mars. “Our Colorado Army National Guard pilots may not fly around the Moon, but we wear our motto, de monitbus ad astra — from the mountains to the stars — with pride”"
  },
  {
    "id": 32648,
    "title": "Artemis II Crew Practices Night Launch Scenario",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/artemis-ii-crew-practices-night-launch-scenario/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/ksc-20250812-ph-kls01-0106orig.jpg",
    "news_site": "NASA",
    "summary": "NASA astronauts Christina Koch, Artemis II mission specialist, and Victor Glover, Artemis II pilot, walk on the crew access arm of the mobile launcher in the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on Tuesday, Aug. 12, 2025. On Aug. 11 and 12, teams with the agency’s Exploration Ground Systems Program along with NASA […]",
    "published_at": "2025-08-18T15:52:14Z",
    "updated_at": "2025-08-18T16:00:08.418755Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Artemis campaign will send astronauts to explore the Moon for scientific discovery, economic benefits, and to build the foundation for the first crewed missions to Mars. On Aug. 11 and 12, NASA astronauts Reid Wiseman, Victor Glover, and Christina Koch, and CSA (Canadian Space Agency) astronaut Jeremy Hansen, practiced launch day operations if launch occurs at night."
  },
  {
    "id": 32646,
    "title": "Evaluating Blue Origin’s Mars Telecom Orbiter Proposal",
    "authors": [
      {
        "name": "Ryan Caton",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/blue-origin-mto-proposal/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-14-05-28-08-413.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Blue Origin has revealed its concept for a Mars Telecommunications Orbiter (MTO), entering a burgeoning…\nThe post Evaluating Blue Origin’s Mars Telecom Orbiter Proposal appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-18T14:58:25Z",
    "updated_at": "2025-08-18T15:00:14.793383Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Blue Origin has revealed its concept for a Mars Telecommunications Orbiter (MTO) The proposal includes multiple steerable high-rate links, bolstered by deployable Ultra-High Frequency satellites in low Mars orbit. With over one metric ton of additional payload capacity, Blue Origin asserts orbiter could be ready by 2028. Rocket Lab’s entry draws from its earlier Mars Sample Return (MSR) architecture. The company emphasizes its efficient in-house supply chain and proven track record. Lockheed Martin, a veteran in the field, bases its proposal on a fixed-price MSR mission concept."
  },
  {
    "id": 32645,
    "title": "NASA Invites Media to Northrop Grumman CRS-23 Station Resupply Launch",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-northrop-grumman-crs-23-station-resupply-launch/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/53903856291-669a22d3a7-k.jpg",
    "news_site": "NASA",
    "summary": "Media accreditation is open for the next launch to deliver NASA science investigations, supplies, and equipment to the International Space Station. A Northrop Grumman Cygnus spacecraft will launch to the orbital laboratory on a SpaceX Falcon 9 rocket for NASA. The mission is known as NASA’s Northrop Grumman Commercial Resupply Services 23, or Northrop Grumman […]",
    "published_at": "2025-08-18T14:51:11Z",
    "updated_at": "2025-08-18T15:01:09.983962Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "3bfed6d5-d65e-4133-b51a-b664bbd9d006",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Media accreditation is open for the next launch to deliver NASA science investigations, supplies, and equipment to the International Space Station. A Northrop Grumman Cygnus spacecraft will launch to the orbital laboratory on a SpaceX Falcon 9 rocket for NASA. The spacecraft will remain at the space station for more than two months."
  },
  {
    "id": 32644,
    "title": "New ESA Business Incubator in Spain Opens First Call for Proposals",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/new-esa-business-incubator-in-spain-opens-first-call-for-proposals/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/New-ESA-Business-Incubator-in-Spain-Opens-First-Call-for-Proposals.webp",
    "news_site": "European Spaceflight",
    "summary": "The European Space Agency’s new Business Incubation Centre in Andalusia, southern Spain, has opened its first call for proposals, offering up to €60,000 to space startups in the region. Launched in 2003, the ESA Business Incubation Centres initiative is part of the agency’s efforts to commercialise national investments in its space programmes. The initiative targets […]\nThe post New ESA Business Incubator in Spain Opens First Call for Proposals appeared first on European Spaceflight.",
    "published_at": "2025-08-18T13:50:21Z",
    "updated_at": "2025-08-18T14:00:15.013901Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency’s new Business Incubation Centre in Andalusia, southern Spain, has opened its first call for proposals. The initiative targets newly formed companies as well as startups that have been in business for no longer than five years. There are currently more than 30 BICs across Europe, which have supported approximately 1,500 startups."
  },
  {
    "id": 32643,
    "title": "NASA Challenge Winners Cook Up New Industry Developments",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/prizes-challenges-crowdsourcing-program/nasa-challenge-winners-cook/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/il-nucleus-3.jpg",
    "news_site": "NASA",
    "summary": "NASA invests in technologies that have the potential to revolutionize space exploration, including the way astronauts live in space. Through the Deep Space Food Challenge, NASA, in partnership with CSA (Canadian Space Agency), sought novel food production systems that could provide long-duration human space exploration missions with safe, nutritious, and tasty food. Three winners selected […]",
    "published_at": "2025-08-18T13:22:24Z",
    "updated_at": "2025-08-18T13:30:06.569217Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA sought novel food production systems that could provide long-duration human space exploration missions with safe, nutritious, and tasty food. Interstellar Lab of Merritt Island, Florida, won the challenge’s $750,000 grand prize for its food production system NuCLEUS. Team Nolux, formed from faculty members, graduate, and undergraduate students from the University of California, Riverside, won a $250,000 second prize. NASA is celebrating its centennial with a series of challenges. Stay tuned for more information: http://www.nasa.gov/prizes-challenge-and-crowdsourcing/centennial-challenges. NASA explores the unknown in air and space, innovates for the benefit of humanity."
  },
  {
    "id": 32642,
    "title": "ESA’s Arctic Weather Satellite adds power to forecasts",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Meteorological_missions/Arctic_Weather_Satellite/ESA_s_Arctic_Weather_Satellite_adds_power_to_forecasts",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/07/arctic_weather_satellite_small_but_perfectly_formed/26216370-1-eng-GB/Arctic_Weather_Satellite_small_but_perfectly_formed_card_full.png",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-18T11:34:00Z",
    "updated_at": "2025-08-18T15:00:19.328774Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "d61c53c4-669a-44cd-a905-cea38e8e21d6",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "The European Centre for Medium-Range Weather Forecasts (ECMWF) is the first centre to use these new observations operationally, which are leading to a robust improvement in forecasts. The data, along with numerous other observations, are merged with a short-range forecast that is guided by earlier measurements to produce the most accurate possible snapshot of the Earth’s current state. The proposed constellation would comprise six satellites for higher temporal coverage. Each satellite would be replenished three times to ensure data is delivered for years to come. It is envisaged that ESA would build the EPS-Sterna constellation in cooperation with Eumetsat, following the established model for Europe's other meteorological missions."
  },
  {
    "id": 32641,
    "title": "Curiosity Blog, Sols 4629-4630: Feeling Hollow",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4629-4630-feeling-hollow/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04628_opgs_edr_ncam_NLB_808343280EDR_F1180924NCAM00353M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Elena Amador-French, Science Operations Coordinator at NASA’s Jet Propulsion Laboratory Earth planning date: Wednesday, Aug. 13, 2025 Today’s team investigated the texture and chemistry of the bedrock within a topographic low, or hollow, found within the greater boxwork area. We will place our APXS instrument on the “Asiruqucha” target, some light-toned, small-scale nodular […]",
    "published_at": "2025-08-18T07:03:09Z",
    "updated_at": "2025-08-18T07:56:52.160504Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "df8d4fdb-9add-4ce9-9f0e-aae1c61df212",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Today’s team investigated the texture and chemistry of the bedrock within a topographic low, or hollow, found within the greater boxwork area. We will also observe a small crescent-shaped rock named “Wedge Tailed Hillstar” with MAHLI. Once these observations are completed Curiosity will set off on a 30-meter drive (about 98 feet) to an interesting ridge feature."
  },
  {
    "id": 32640,
    "title": "Countdown To Launch : What to Expect From Starship Flight 10",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/countdown-to-launch-what-to-expect-from-starship-flight-10",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755474284234.jpeg",
    "news_site": "The Launch Pad",
    "summary": "Countdown To Launch : What to Expect From Starship Flight 10",
    "published_at": "2025-08-17T22:58:00Z",
    "updated_at": "2025-08-18T00:00:56.536466Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is targeting Sunday, August 24, 2025, for the tenth flight test of Starship. The launch window opens at 6:30 p.m. CT (23:30 UTC) Starship will carry eight Starlink simulators sized to match next-generation Starlink V3 satellites. SpaceX is steadily moving closer to its operational goal: a rapidly reusable super-heavy launch system. Every test generates terabytes of telemetry and video data, feeding directly into next-generation Starship designs. The company has stated that only two more flights remain with the current generation of Starship/Super Heavy."
  },
  {
    "id": 32638,
    "title": "Launch Roundup: Falcon 9, Starship, and Russia flying this week",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/launch-roundup-falcon-9-starship-and-russia-flying-this-week/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2024/10/A-Falcon-9-sits-on-the-pad-at-SLC-4E-at-the-Vandenberg-Space-Force-Base-Credit-SpaceX-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "A pair of Russian space missions, a trio of Falcon 9 launches, and the long-awaited…\nThe post Launch Roundup: Falcon 9, Starship, and Russia flying this week appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-17T22:38:42Z",
    "updated_at": "2025-08-17T22:40:22.052828Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A pair of Russian space missions, a trio of Falcon 9 launches, and the long-awaited Starship Flight 10 are scheduled to fly this week. A Soyuz rocket is to fly a modernized version of the Vostok capsule that flew crewed missions in the 1960s from Baikonur while an Angara rocket is flying from the Russian military launch site in Plesetsk. SpaceX is flying one Starlink mission, a national security mission and a cargo flight to the International Space Station. Bion-M no. 2 will fly 75 mice and study how these mice are affected by radiation. 1,000 fruit flies will also be on board along with plants and microorganisms. The mission is scheduled to last for 30 days before the spacecraft returns to Earth. U.S. Space Force national security launch scheduled to fly aboard a Falcon 9. Falcon 9|Starlink 17-6 is scheduled to fly on Friday, Aug. 22 at 8:44 AM PDT (15:44 UTC) from Space Launch Complex-4E at VSFB. The flight will carry 24 Starlink v2 Mini satellites to low-Earth orbit, while the booster, B1081-17, will perform a recovery on Of Course I Still Love You. This will be the fourth Starship flight of 2025 and the next to last flight from Pad 1 in its current configuration. On this flight, Ship 37 is carrying eight dummy Starlink satellites to be deployed. SpaceX will attempt to get valuable reentry data before a planned splashdown in the Indian Ocean. This flight would also be the first fully successful Block 2 flight if it splashes down intact."
  },
  {
    "id": 32661,
    "title": "Launch Roundup: SpaceX, Chinese, and Russian missions make up busy week",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/launch-roundup-081825/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/07/IMG_2367-scaled.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "A Chinese rocket, a pair of Russian missions, a trio of Falcon 9 launches, and…\nThe post Launch Roundup: SpaceX, Chinese, and Russian missions make up busy week appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-17T22:38:42Z",
    "updated_at": "2025-08-18T21:20:10.278531Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A Chinese rocket, a pair of Russian missions, a trio of Falcon 9 launches, and the long-awaited tenth flight of Starship are scheduled to fly this week. A Soyuz rocket is to fly a modernized version of the Vostok capsule that flew crewed missions in the 1960s from Baikonur, while an Angara rocket is flying from the Russian military launch site in Plesetsk. Soyuz 2.1a rocket will loft Bion-M spacecraft to a 300-370 km altitude. The 6,300 kg spacecraft is derived from the Vostok spacecraft that launched Yuri Gagarin to space on April 12, 1961. The mission is scheduled to last for 30 days before the spacecraft returns to Earth. U.S. Space Force’s USSF-36 mission will fly aboard a Falcon 9 from Kennedy Space Center. A X-37B Orbital Test Vehicle (OTV) is flying the program’s eighth mission since the OTV-1 mission in 2010 aboard an Atlas V. This flight will be the 101st Falcon 9 launch of 2025, as SpaceX works to fly up to 160 missions this year. CRS-33 mission is scheduled for Sunday, Aug. 24, at 2:45 AM EDT (06:45 UTC) from SLC-40 at the Cape Canaveral Space Force Station. Ship 36 exploded on the test stand at Masseys just before it was supposed to perform a six-engine static fire, forcing SpaceX to reassign Ship 37 to Flight 10. The explosion knocked the Massey’s Test Facility out of service for at least several months for static fire testing. To work around the lack of testing infrastructure, SpaceX designed a mount to static fire Ship 37 on the orbital launch mount at Pad 1."
  },
  {
    "id": 32639,
    "title": "President Trump Signs Executive Order to Streamline U.S. Commercial Space Regulations",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/policy-and-finance/trump-signs-executive-order-to-streamline-us-commercial-space-regulations",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755470409656.jpeg",
    "news_site": "The Launch Pad",
    "summary": "President Trump Signs Executive Order to Streamline U.S. Commercial Space Regulations",
    "published_at": "2025-08-17T22:36:00Z",
    "updated_at": "2025-08-17T22:50:16.243387Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Donald Trump has signed a sweeping new Executive Order aimed at transforming the regulatory landscape for America’s commercial space sector. The order seeks to cut through longstanding bureaucratic hurdles, accelerate launch licensing, and position the United States as the premier hub for space exploration and industry by 2030. The Executive Order builds on previous efforts under Trump’s first term. Analysts suggest the changes could sharply increase the cadence of commercial launches from U.S. soil. The proposals may also trigger legal battles with environmental groups and state governments concerned about fast-tracked reviews. While official industry responses are still emerging, early signals suggest strong support."
  },
  {
    "id": 32637,
    "title": "Starlink Doubles Up, ISS Gets A New Booster, X-37B Returns, and Starship is GO For Launch This Week",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/weekly-pre-launch-preview-august-18-24-2025",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755462812829.png",
    "news_site": "The Launch Pad",
    "summary": "Starlink Doubles Up, ISS Gets A New Booster, X-37B Returns, and Starship is GO For Launch This Week",
    "published_at": "2025-08-17T19:46:00Z",
    "updated_at": "2025-08-17T20:50:20.247576Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The week begins on the U.S. West Coast, where a Falcon 9 Block 5 rocket will lift off from Vandenberg Space Force Base’s SLC-4E at 11:44 EDT (15:44 UTC) The mission, Starlink 17-5, will deploy 24 Starlink V2 Mini satellites into a Sun-synchronous orbit at approximately 97.6° inclination. On the same day, Russia plans to launch an Angara 1.2 rocket from Plesetsk Cosmodrome at 04:30 EDT (08:30 UTC) Attention then turns to Florida, as SpaceX prepares to launch the USSF-36 mission, carrying the Boeing X-37B Orbital Test Vehicle. This week's lineup illustrates the expanding global scope of space operations. From Russia’s scientific return capsule to U.S. classified military spaceplanes, each mission underscores the diversity of modern spaceflight. Stay tuned to The Launch Pad for live coverage and mission updates throughout the week."
  },
  {
    "id": 32636,
    "title": "What’s Happening in Space Policy August 17-24, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-august-17-24-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/X37B-in-FH-fairing-Aug-25-USSF.avif",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week plus a day of August 17-24, 2025 and any insight we can offer about them. The House and Senate […]",
    "published_at": "2025-08-17T19:07:06Z",
    "updated_at": "2025-08-17T19:10:35.436690Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpacePolicyOnline.com’s list of space policy events for the week plus a day of August 17-24, 2025. The House and Senate are in recess until September 2 except for pro forma sessions. The 8th launch of the X-37B spaceplane for the U.S. Space Force (USSF) is scheduled for Thursday. John Wisniewski will give a NASA HQ update at 10:15 am ET including “internal changes, impact on the community” Shawn Domagal-Goldman, Acting Astrophysics Division Director on a 1-year detail from Goddard Space Flight Center, will provide an update on the Science Mission Directorate later in the day. Finding exoplanets that might support life ties into NASA’s astrobiology program in the Planetary Sciences Division."
  },
  {
    "id": 32635,
    "title": "Live coverage: 24 Starlink satellites to launch from California on 100th Falcon 9 rocket of the year",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/17/live-coverage-24-starlink-satellites-to-launch-from-california-on-100th-falcon-9-rocket-of-the-year/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 17-5 mission will add another 24 broadband satellites to the company’s constellation of more than 8,100 currently in orbit. SpaceX is targeting liftoff from pad 4E at 9:23 a.m. PDT (12:23 p.m. EDT / 1623 UTC). ",
    "published_at": "2025-08-17T17:22:06Z",
    "updated_at": "2025-08-17T17:30:15.109907Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is set to launch its 100th Falcon 9 rocket of the year on Monday morning. The flight from Vandenberg Space Force Base will carry another batch of Starlink V2 Mini satellites into low Earth orbit. The Starlink 17-5 mission will also be the 72nd SpaceX launch ofStarlink satellites so far in 2025."
  },
  {
    "id": 32634,
    "title": "Hurricane Erin sets early season intensification record, becomes Category 5 storm",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/science/2025/08/hurricane-erin-sets-early-season-intensification-record-becomes-category-5-storm/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20252281710_GOES19-ABI-taw-GEOCOLOR-1800x1080-1.jpg",
    "news_site": "Arstechnica",
    "summary": "The good news is that, for now, Erin appears unlikely to directly strike land.",
    "published_at": "2025-08-16T17:50:31Z",
    "updated_at": "2025-08-16T18:00:06.939856Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Hurricane Erin has reached Category 5 status, the most powerful kind of hurricane. Erin is expected to pass close to several landmasses between now and next Thursday. Storms like Erin are predicted to become more common due to climate change, scientists say. Erin only became a hurricane at 11 am ET on Friday as it tracked north of the Leeward Islands. The Atlantic season typically peaks in early September, with the majority of storms forming between early August and early October. But with Erin's longevity and intensity this season should soon reach and surpass normal levels of Accumulated Cyclone Energy. Forecast models indicate the likely development of more hurricanes within the next two weeks, but there is no clear consensus on whether they will impact land."
  },
  {
    "id": 32633,
    "title": "SpaceX schedules 10th test flight for Starship, details recent setbacks",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/16/spacex-schedules-starship-flight-10-details-recent-setbacks/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250815_Starship_Flight_10_Raptor_static_fire.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The next launch of SpaceX’s super heavy lift rocket would come nearly three months after the last test flight. Liftoff from Starbase, Texas, is planned during a one-hour window that opens at 6:30 p.m. CDT (7:30 p.m. EDT / 2330 UTC). ",
    "published_at": "2025-08-16T13:03:58Z",
    "updated_at": "2025-08-16T13:10:15.822228Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is gearing up for a launch of its massive Starship rocket from southern Texas. On Friday, it announced plans for the tenth flight of the fully integrated, two-stage rocket. The test flight is tentatively scheduled during an hour-long window that opens at 6:30 p.m. CDT. Starship reentered Earth’s atmosphere in an off-nominal attitude and communication was lost during entry. SpaceX used the reaction control thrusters on Ship 35 to help off-set the attitude problem and allow the nosecone venting to continue. If Ship 37 is able to make it through its planned milestones and to a controlled, atmospheric reentry it would be the first of the Block 2 version of Starship to do so. B14 flew for a second time, utilizing 29 out of the 33 Raptor engines from its previous flight. An explosion in the aft end of the booster not long after the landing burn began caused a loss of telemetry. “The most probable cause for the failure at landing burn was higher than predicted forces on the booster structure,” SpaceX said. Acting NASA Administrator Sean Duffy spoke with social media influencers about why he wasn’t concerned with the recent setbacks experienced by SpaceX. “It seems like this is a similar process to what they’ve done in the past. They learn from their mistakes and then they quickly get to the finish,” Duffy said."
  },
  {
    "id": 32632,
    "title": "FAA approves Starship Flight 10 after mishap probe, eyes August 24 launch",
    "authors": [
      {
        "name": "Alejandro Alcantarilla Romera",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/faa-flight-10-mishap-probe-august-24/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-16-04-06-46-239.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX has received clearance from the Federal Aviation Administration (FAA) to conduct the 10th test…\nThe post FAA approves Starship Flight 10 after mishap probe, eyes August 24 launch appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-16T03:36:42Z",
    "updated_at": "2025-08-16T03:40:09.714497Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has received clearance from the Federal Aviation Administration (FAA) to conduct the 10th test flight of its Starship rocket, with a targeted launch date of August 24. The FAA announced on Friday morning that it had concluded its review of the mishap from Starship’s Flight 9, which occurred earlier this year. SpaceX revealed that the probable root cause was a failure in the diffuser component of the main fuel tank pressurization system. SpaceX will launch its Starship rocket on August 24. The launch window opens at 6:30 p.m. Central Time and will feature Booster 16 and Ship 37. Ship 36, originally slated for Flight 10, exploded during ground testing in June. SpaceX is enhancing inspections, proof tests, and handling protections for COPVs."
  },
  {
    "id": 32631,
    "title": "NASA-Developed Printable Metal Can Take the Heat",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/technology/tech-transfer-spinoffs/nasa-developed-printable-metal-can-take-the-heat/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/672516046c5be-image.jpg",
    "news_site": "NASA",
    "summary": "Until now, additive manufacturing, commonly known as 3D printing, of engine components was limited by the lack of affordable metal alloys that could withstand the extreme temperatures of spaceflight. Expensive metal alloys were the only option for 3D printing engine parts until NASA’s Glenn Research Center in Cleveland, Ohio, developed the GRX-810 alloy. The primary […]",
    "published_at": "2025-08-15T20:13:43Z",
    "updated_at": "2025-08-15T20:20:05.584112Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Until now, expensive metal alloys were the only option for 3D printing engine parts. NASA’s Glenn Research Center in Cleveland, Ohio, developed the GRX-810 alloy. A ceramic oxide coating on the powdered metal particles increases its heat resistance and improves performance."
  },
  {
    "id": 32629,
    "title": "Human Rating and NASA-STD-3001",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/human-rating-and-nasa-std-3001/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/human-rating-pyramid-static-v1.png",
    "news_site": "NASA",
    "summary": "Human-rating is a critical certification process that validates the safety, reliability, and suitability of space systems—including orbiters, launch vehicles, rovers, spacesuits, habitats, and other crewed elements—for human use and interaction. This process ensures that systems are designed not only to protect human life but also to accommodate human needs and effectively integrate human capabilities. Human-rating requires […]",
    "published_at": "2025-08-15T18:34:58Z",
    "updated_at": "2025-08-15T18:40:06.260939Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Human-rating validates the safety, reliability, and suitability of space systems. Standards reflect NASA’s commitment to minimizing risk in human spaceflight. Early efforts focused on basic crew survival and redundancy in critical systems. Today, human-rating is an interdisciplinary effort that integrates engineering, medical, operational expertise."
  },
  {
    "id": 32630,
    "title": "NASA Astronauts to Answer Questions from Students in Minnesota",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-astronauts-to-answer-questions-from-students-in-minnesota/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/crew11-7c4516.jpg",
    "news_site": "NASA",
    "summary": "NASA astronauts Michael Finke and Zena Cardman will connect with students in Minnesota as they answer prerecorded science, technology, engineering, and mathematics (STEM) questions aboard the International Space Station. The Earth-to-space call will begin at 11 a.m. EDT on Wednesday, Aug. 20, and will stream live on the agency’s Learn With NASA YouTube channel. Media […]",
    "published_at": "2025-08-15T18:32:05Z",
    "updated_at": "2025-08-15T18:40:06.305922Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronauts Michael Fincke and Zena Cardman will answer prerecorded science, technology, engineering, and mathematics (STEM) questions. The Earth-to-space call will begin at 11 a.m. EDT on Wednesday, Aug. 20, and will stream live on the agency’s Learn With NASA YouTube channel. Media interested in covering the event must RSVP by 5 p.m., Aug. 19, to Elizabeth Ross at: 952-838-1340."
  },
  {
    "id": 32628,
    "title": "Countdown to Space Station’s Silver Jubilee with Silver Research",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/iss-research/countdown-to-space-stations-silver-jubilee-with-silver-research/",
    "image_url": "https://images-assets.nasa.gov/image/iss064e020688/iss064e020688~large.jpg",
    "news_site": "NASA",
    "summary": "This November marks a quarter century of continuous human presence aboard the International Space Station, which has served as a springboard for developing a low Earth economy and NASA’s next great leaps in exploration, including human missions to the Moon and Mars. To kick off the orbiting laboratory’s silver 25th anniversary countdown, here are a […]",
    "published_at": "2025-08-15T16:00:00Z",
    "updated_at": "2025-08-15T16:00:10.067662Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "November marks a quarter century of continuous human presence aboard the International Space Station. Silver has been used for centuries to fight infection, and researchers use its unique properties to mitigate microbial growth aboard the space station. In microgravity, there is no up or down, and weightlessness does not allow particles to settle, which impacts physical and chemical processes."
  },
  {
    "id": 32627,
    "title": "NASA’s acting chief calls for the end of Earth science at the space agency",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/nasas-acting-chief-calls-for-the-end-of-earth-science-at-the-space-agency/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/news-080625d-lg.jpg",
    "news_site": "Arstechnica",
    "summary": "NASA's charter clearly states the agency should study planet Earth, however.",
    "published_at": "2025-08-15T15:55:13Z",
    "updated_at": "2025-08-15T16:00:08.930967Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Sean Duffy, the acting administrator of NASA, has vowed to make the United States great in space. Duffy is seeking to emphasize the agency's human exploration plans, including the development of a lunar base. He also emphasized his desire to end NASA's focus on studying the Earth and understanding how the planet's surface and atmosphere are changing. Duffy is carrying out the priorities for NASA established in the President's Budget Request for fiscal year 2026. It is unclear how long Duffy will remain as \"acting\" administrator. One source indicated that the Trump administration may be closing in on a new nominee to lead the space agency full-time."
  },
  {
    "id": 32626,
    "title": "Spacewalk Pop-Up",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/spacewalk-pop-up/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/31581057184-7fc34ef213-o.jpg",
    "news_site": "NASA",
    "summary": "Former NASA astronaut Shane Kimbrough is photographed as he left the airlock hatch during a spacewalk on Jan. 13, 2017. Kimbrough performed nine spacewalks during his three spaceflights. He retired in July 2022. Astronauts conduct spacewalks to perform maintenance on the space station, install new equipment, or deploy science experiments. These activities also inform future missions […]",
    "published_at": "2025-08-15T15:03:31Z",
    "updated_at": "2025-08-15T15:10:12.572283Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Shane Kimbrough performed nine spacewalks during his three spaceflights. Astronauts conduct spacewalk to perform maintenance on the space station, install new equipment, or deploy science experiments. These activities also inform future missions like the Artemis campaign and exploring Mars; through NASA’s Extravehicular Activity and Human Surface Mobility Program."
  },
  {
    "id": 32625,
    "title": "East Coast sees major progress for future operations at the Cape",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/major-progress-future-operations-cape/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-15-14-11-24-209.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Amid recent Falcon 9 and Vulcan launches, a considerable amount of important construction work in…\nThe post East Coast sees major progress for future operations at the Cape appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-15T14:33:32Z",
    "updated_at": "2025-08-15T14:40:09.840897Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NSF conducted a flyover this week near the Kennedy Space Center (KSC) and the Cape Canaveral Space Force Station (CCSFS) NSF’s latest photos show assembly tents and a number of cranes and construction equipment surrounding the launch tower. Rebar work is still going on in the flame trench, with bucket halves and trench wall sections being delivered. Draft environmental impact statement for SpaceX’s latest Starship operations plans at LC-39A shows that the company plans to conduct up to 44 launches per year from the complex. The company is also now building the Giga Bay and planning a future Starfactory next to its current operation at Roberts Road. A new tower section has also been spotted at the Roberts Road facility, along with hardware for additional tower sections and pieces for a framework of a new set of Mechazilla arms. Stoke Space plans to field a fully reusable launch vehicle known as Nova. Relativity is still working on its Terran R partially reusable launch vehicles. NASA’s Artemis program is continuing to work on ML2 despite budget uncertainty in Washington. Blue Origin will be tasked with supporting the recovery of GS1 on the second flight of New Glenn."
  },
  {
    "id": 32623,
    "title": "NASA Seeks Proposals for 2026 Human Exploration Rover Challenge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/marshall/nasa-seeks-proposals-for-2026-human-exploration-rover-challenge/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/herc-handbook-cover-2026.png",
    "news_site": "NASA",
    "summary": "NASA now is accepting proposals from student teams for a contest to design, build, and test rovers for Moon and Mars exploration through Sept. 15. Known as the Human Exploration Rover Challenge, student rovers should be capable of traversing a course while completing mission tasks. The challenge handbook has guidelines for remote-controlled and human-powered divisions. “Last year, we saw […]",
    "published_at": "2025-08-15T14:00:00Z",
    "updated_at": "2025-08-15T14:00:07.864311Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is accepting proposals from student teams for a contest to design, build, and test rovers for Moon and Mars exploration. Known as the Human Exploration Rover Challenge, student rovers should be capable of traversing a course while completing mission tasks. This year’s mission mimics future Artemis missions to the lunar surface."
  },
  {
    "id": 32622,
    "title": "Spartan Space and Airbus Complete CNES Lunar Surface Airlock Study",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/spartan-space-and-airbus-complete-cnes-lunar-surface-airlock-study/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Spartan-Space-and-Airbus-Complete-CNES-Lunar-Surface-Airlock-Study.webp",
    "news_site": "European Spaceflight",
    "summary": "Spartan Space and Airbus Defence and Space have completed a feasibility study for a lunar habitat airlock, commissioned by the French aerospace agency CNES. In September 2021, CNES launched its Lunar Integrated Shelter for Exploration (LISE) initiative. LISE is part of the agency’s Spaceship France programme, which focuses on developing core technologies for future crewed […]\nThe post Spartan Space and Airbus Complete CNES Lunar Surface Airlock Study appeared first on European Spaceflight.",
    "published_at": "2025-08-15T13:41:50Z",
    "updated_at": "2025-08-15T13:50:10.172216Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Spartan Space and Airbus Defence and Space have completed a feasibility study for a lunar habitat airlock, commissioned by the French aerospace agency CNES. In September 2021, CNES launched its Lunar Integrated Shelter for Exploration (LISE) initiative. LISE is part of the agency’s Spaceship France programme, which focuses on developing technologies for future crewed missions to the Moon and Mars."
  },
  {
    "id": 32621,
    "title": "Week in images: 11-15 August 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_11-15_August_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/ariane_6_lofts_metop-sg-a1_and_sentinel-5_into_orbit/26835610-3-eng-GB/Ariane_6_lofts_MetOp-SG-A1_and_Sentinel-5_into_orbit_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 11-15 August 2025",
    "published_at": "2025-08-15T13:10:00Z",
    "updated_at": "2025-08-15T13:00:12.718441Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 32620,
    "title": "Hubble Examines Low Brightness, High Interest Galaxy",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-examines-low-brightness-high-interest-galaxy/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/Hubble_NGC45_potw2532a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image zooms in on the feathery spiral arms of the galaxy NGC 45, which lies just 22 million light-years away in the constellation Cetus (the Whale). The portrait uses data drawn from two complementary observing programs. The first took a broad view of 50 nearby galaxies, leveraging Hubble’s ability to […]",
    "published_at": "2025-08-15T11:00:00Z",
    "updated_at": "2025-08-15T11:10:12.846219Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NGC 45 lies just 22 million light-years away in the constellation Cetus (the Whale) NGC 45 is a remarkable type called a low surface brightness galaxy. Low surface brightness galaxies are fainter than the night sky itself. Studying these hard-to-detect galaxies is key to understanding how galaxies form and evolve."
  },
  {
    "id": 32624,
    "title": "Summer Triangle Corner: Altair",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/solar-system/skywatching/night-sky-network/summer-triangle-corner-altair/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/nightsky/articles/Summer%20Triangle%20005.jpeg",
    "news_site": "NASA",
    "summary": "Altair is the last stop on our trip around the Summer Triangle! The last star in the asterism to rise for Northern Hemisphere observers before summer begins, brilliant Altair is high overhead at sunset at the end of the season in September. Altair might be the most unusual of the three stars of the Triangle, […]",
    "published_at": "2025-08-15T10:00:00Z",
    "updated_at": "2025-08-15T14:10:05.524493Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " Altair is the brightest star in the constellation of Aquila, the Eagle. Altair represents the cowherd in the ancient tale “Cowherd and the Weaver Girl’ Altair’s rapid spinning was first detected in the 1960s. As summer winds down, you can still take a Trip Around the Summer Triangle."
  },
  {
    "id": 32619,
    "title": "Curiosity Blog, Sols 4627-4628: A Ridge Stop in the Boxworks",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4627-4628-a-ridge-stop-in-the-boxworks/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_msss_04625_mhli_4625MH0001710001700780R00_DXXX.jpg",
    "news_site": "NASA",
    "summary": "Earth planning date: Monday Aug. 11, 2025 Written by Lucy Lim, Planetary Scientist at NASA’s Goddard Space Flight Center On the Curiosity team, we’re continuing our exploration of the boxwork-forming region in Gale Crater. A successful 25-meter drive (about 82 feet) brought the rover from the “peace sign” ridge intersection to a new ridge site. […]",
    "published_at": "2025-08-15T00:39:14Z",
    "updated_at": "2025-08-15T01:10:05.702521Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A successful 25-meter drive brought the rover from the “peace sign” ridge intersection to a new ridge site. Mastcam observations of a potential incipient hollow (“Laguna Miniques”) APXS and MAHLI measurements were planned to explore the local bedrock at two points."
  },
  {
    "id": 32618,
    "title": "NASA Seeks Industry Feedback on Fission Surface Power",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/nasa-seeks-industry-feedback-on-fission-surface-power/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/04/nasa_meatball_4.png",
    "news_site": "NASA",
    "summary": "As part of the agency’s initiative to return humanity to the Moon and eventually send the first astronaut – an American – to Mars, NASA is surveying industry for interest and feedback on a fission surface power system, through a Request for Information issued Thursday. Earlier this month, NASA declared its intent to put a […]",
    "published_at": "2025-08-14T22:34:13Z",
    "updated_at": "2025-08-14T22:40:04.690741Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is surveying industry for interest and feedback on a fission surface power system. Earlier this month, NASA declared its intent to put a nuclear reactor on the Moon by the mid-2030s. Nuclear power is a key element for NASA’s Artemis missions and supporting a robust lunar economy."
  },
  {
    "id": 32617,
    "title": "Astronauts Plant Seed Pillows in New Space Agriculture Study",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/astronauts-plant-seed-pillows-in-new-space-agriculture-study/",
    "image_url": "https://images-assets.nasa.gov/image/KSC-20250529-PH-CSH01_0070/KSC-20250529-PH-CSH01_0070~large.jpg",
    "news_site": "NASA",
    "summary": "When the Crew-11 astronauts launched to the International Space Station on August 1, 2025, they carried with them another chapter in space farming: the latest VEG-03 experiments, complete with seed pillows ready for planting. Growing plants provides nutrition for astronauts, as well as psychological benefits that help maintain crew morale during missions. During VEG-03 MNO, […]",
    "published_at": "2025-08-14T18:40:40Z",
    "updated_at": "2025-08-14T19:10:04.531235Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronauts will plant Wasabi mustard greens, Red Russian Kale, and Dragoon lettuce. The experiment takes place inside Veggie, a chamber about the size of carry-on luggage. Fresh food will become critical as astronauts venture farther from Earth on missions to the Moon and Mars."
  },
  {
    "id": 32615,
    "title": "Skyrora weighs options on the path to the UK’s first vertical launch",
    "authors": [
      {
        "name": "Martin Smith",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/skyrora-efis/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Render-of-Skyrora-XL-and-its-launch-tower-Skyrora.webp",
    "news_site": "NASASpaceflight",
    "summary": "Edinburgh-based Skyrora was granted its Spaceflight Operator Licence from the UK Civil Aviation Authority (CAA)…\nThe post Skyrora weighs options on the path to the UK’s first vertical launch appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-14T17:52:08Z",
    "updated_at": "2025-08-14T18:00:15.534911Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Edinburgh-based Skyrora was granted its Spaceflight Operator Licence from the UK Civil Aviation Authority (CAA) on August 5. The license authorizes one initial launch, and covers up to 16 flights per year from the SaxaVord spaceport situated 80 km to the northeast of mainland Scotland on the northernmost of the Shetland Islands. Despite being awarded the long-awaited UK license, the company might yet decide to conduct a second launch of Skylark L from another site. Skyrora has developed a containerized ‘spaceport in a box’ concept, which means that it doesn’t especially need a pad to launch from. The company’s first vehicle, the Skylark Nano, launched from the Kildermorie Estate in Ross-shire in August 2018. The relationship with the Langanes Peninsula of Iceland began with the launch of the two-stage Skylarks. Skylark L is the company’s second rocket, following the Skylark Micro. The vehicle stands 11.6 m tall and 0.7 m wide. It is powered by a combination of High-Test Peroxide (HTP) and kerosene. Skyrora uses in-house distillation processes to reach the strength needed. In 2019, Skyrora located and returned parts of this rocket’s first stage to the UK, marking its 48th anniversary. Although it offers a little less performance than when using cryogenics for oxidizers, HTP can be stored at room temperature."
  },
  {
    "id": 32616,
    "title": "After Storied 34 Year Career, Steve Platnick Retires from NASA",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/after-storied-34-year-career-steve-platnick-retires-from-nasa/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/earth-observer/2025/2025-summer/platnick/steve-p-image.jpg",
    "news_site": "NASA",
    "summary": "Dr. Steven “Steve” Platnick stepped down from his role at NASA on August 8, 2025, after more than three decades of public service. Steve began his career at NASA as a physical scientist at Goddard Space Flight Center in 2002. He moved to the Earth Science Division in 2009, where he has served in various […]",
    "published_at": "2025-08-14T17:14:54Z",
    "updated_at": "2025-08-14T18:10:13.958912Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Dr. Steven “Steve” Platnick stepped down from his role at NASA on August 8, 2025. Steve began his career at NASA as a physical scientist at Goddard Space Flight Center in 2002. He moved to the Earth Science Division in 2009, where he has served in various senior management roles. Steve has been supportive of the activities of NASA’s Science Support Office (SSO) He has participated in many NASA Science exhibits at both national and international scientific conferences. Steve has been a champion of continuing to retain a historical record of NASA meetings to maintain a chronology of advances made by different groups within the NASA Earth Science community. Steve has received numerous NASA Group Achievement Awards, including for the Cloud, Aerosol and Monsoon Processes Philippines Experiment (CAMP2Ex) Steve has published more than 150 scholarly articles. He began his career at the Joint Center for Earth Systems Technology (JCET) at University of Maryland Baltimore County in 1996."
  },
  {
    "id": 32613,
    "title": "Small Companies Win Big in NASA’s TechLeap Challenge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/small-companies-win-big-in-nasas-techleap-challenge/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/bps/bps-general/TechLeapsLogo.png",
    "news_site": "NASA",
    "summary": "NASA announced 10 winning teams for its latest TechLeap Prize — the Space Technology Payload Challenge — on June 26. The winners emerged from a record-breaking field of more than 200 applicants to earn cash prizes worth up to $500,000, if they have a flight-ready unit. Recipients may also have the opportunity to flight test […]",
    "published_at": "2025-08-14T16:29:21Z",
    "updated_at": "2025-08-14T17:10:06.288505Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA announced 10 winning teams for its latest TechLeap Prize on June 26. The winners emerged from a record-breaking field of more than 200 applicants. Recipients may have the opportunity to flight test their technologies. The projects receive funding through the Commercially Enabled Rapid Space Science initiative."
  }
]