[
  {
    "id": 32640,
    "title": "Countdown To Launch : What to Expect From Starship Flight 10",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/countdown-to-launch-what-to-expect-from-starship-flight-10",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755474284234.jpeg",
    "news_site": "The Launch Pad",
    "summary": "Countdown To Launch : What to Expect From Starship Flight 10",
    "published_at": "2025-08-17T22:58:00Z",
    "updated_at": "2025-08-18T00:00:56.536466Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is targeting Sunday, August 24, 2025, for the tenth flight test of Starship. The launch window opens at 6:30 p.m. CT (23:30 UTC) Starship will carry eight Starlink simulators sized to match next-generation Starlink V3 satellites. SpaceX is steadily moving closer to its operational goal: a rapidly reusable super-heavy launch system. Every test generates terabytes of telemetry and video data, feeding directly into next-generation Starship designs. The company has stated that only two more flights remain with the current generation of Starship/Super Heavy."
  },
  {
    "id": 32638,
    "title": "Launch Roundup: Falcon 9, Starship, and Russia flying this week",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/launch-roundup-falcon-9-starship-and-russia-flying-this-week/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2024/10/A-Falcon-9-sits-on-the-pad-at-SLC-4E-at-the-Vandenberg-Space-Force-Base-Credit-SpaceX-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "A pair of Russian space missions, a trio of Falcon 9 launches, and the long-awaited…\nThe post Launch Roundup: Falcon 9, Starship, and Russia flying this week appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-17T22:38:42Z",
    "updated_at": "2025-08-17T22:40:22.052828Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A pair of Russian space missions, a trio of Falcon 9 launches, and the long-awaited Starship Flight 10 are scheduled to fly this week. A Soyuz rocket is to fly a modernized version of the Vostok capsule that flew crewed missions in the 1960s from Baikonur while an Angara rocket is flying from the Russian military launch site in Plesetsk. SpaceX is flying one Starlink mission, a national security mission and a cargo flight to the International Space Station. Bion-M no. 2 will fly 75 mice and study how these mice are affected by radiation. 1,000 fruit flies will also be on board along with plants and microorganisms. The mission is scheduled to last for 30 days before the spacecraft returns to Earth. U.S. Space Force national security launch scheduled to fly aboard a Falcon 9. Falcon 9|Starlink 17-6 is scheduled to fly on Friday, Aug. 22 at 8:44 AM PDT (15:44 UTC) from Space Launch Complex-4E at VSFB. The flight will carry 24 Starlink v2 Mini satellites to low-Earth orbit, while the booster, B1081-17, will perform a recovery on Of Course I Still Love You. This will be the fourth Starship flight of 2025 and the next to last flight from Pad 1 in its current configuration. On this flight, Ship 37 is carrying eight dummy Starlink satellites to be deployed. SpaceX will attempt to get valuable reentry data before a planned splashdown in the Indian Ocean. This flight would also be the first fully successful Block 2 flight if it splashes down intact."
  },
  {
    "id": 32639,
    "title": "President Trump Signs Executive Order to Streamline U.S. Commercial Space Regulations",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/policy-and-finance/trump-signs-executive-order-to-streamline-us-commercial-space-regulations",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755470409656.jpeg",
    "news_site": "The Launch Pad",
    "summary": "President Trump Signs Executive Order to Streamline U.S. Commercial Space Regulations",
    "published_at": "2025-08-17T22:36:00Z",
    "updated_at": "2025-08-17T22:50:16.243387Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Donald Trump has signed a sweeping new Executive Order aimed at transforming the regulatory landscape for America’s commercial space sector. The order seeks to cut through longstanding bureaucratic hurdles, accelerate launch licensing, and position the United States as the premier hub for space exploration and industry by 2030. The Executive Order builds on previous efforts under Trump’s first term. Analysts suggest the changes could sharply increase the cadence of commercial launches from U.S. soil. The proposals may also trigger legal battles with environmental groups and state governments concerned about fast-tracked reviews. While official industry responses are still emerging, early signals suggest strong support."
  },
  {
    "id": 32637,
    "title": "Starlink Doubles Up, ISS Gets A New Booster, X-37B Returns, and Starship is GO For Launch This Week",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/weekly-pre-launch-preview-august-18-24-2025",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755462812829.png",
    "news_site": "The Launch Pad",
    "summary": "Starlink Doubles Up, ISS Gets A New Booster, X-37B Returns, and Starship is GO For Launch This Week",
    "published_at": "2025-08-17T19:46:00Z",
    "updated_at": "2025-08-17T20:50:20.247576Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The week begins on the U.S. West Coast, where a Falcon 9 Block 5 rocket will lift off from Vandenberg Space Force Base’s SLC-4E at 11:44 EDT (15:44 UTC) The mission, Starlink 17-5, will deploy 24 Starlink V2 Mini satellites into a Sun-synchronous orbit at approximately 97.6° inclination. On the same day, Russia plans to launch an Angara 1.2 rocket from Plesetsk Cosmodrome at 04:30 EDT (08:30 UTC) Attention then turns to Florida, as SpaceX prepares to launch the USSF-36 mission, carrying the Boeing X-37B Orbital Test Vehicle. This week's lineup illustrates the expanding global scope of space operations. From Russia’s scientific return capsule to U.S. classified military spaceplanes, each mission underscores the diversity of modern spaceflight. Stay tuned to The Launch Pad for live coverage and mission updates throughout the week."
  },
  {
    "id": 32636,
    "title": "What’s Happening in Space Policy August 17-24, 2025",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/whats-happening-in-space-policy-august-17-24-2025/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/X37B-in-FH-fairing-Aug-25-USSF.avif",
    "news_site": "SpacePolicyOnline.com",
    "summary": "Here is SpacePolicyOnline.com’s list of space policy events for the week plus a day of August 17-24, 2025 and any insight we can offer about them. The House and Senate […]",
    "published_at": "2025-08-17T19:07:06Z",
    "updated_at": "2025-08-17T19:10:35.436690Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpacePolicyOnline.com’s list of space policy events for the week plus a day of August 17-24, 2025. The House and Senate are in recess until September 2 except for pro forma sessions. The 8th launch of the X-37B spaceplane for the U.S. Space Force (USSF) is scheduled for Thursday. John Wisniewski will give a NASA HQ update at 10:15 am ET including “internal changes, impact on the community” Shawn Domagal-Goldman, Acting Astrophysics Division Director on a 1-year detail from Goddard Space Flight Center, will provide an update on the Science Mission Directorate later in the day. Finding exoplanets that might support life ties into NASA’s astrobiology program in the Planetary Sciences Division."
  },
  {
    "id": 32635,
    "title": "Live coverage: 24 Starlink satellites to launch from California on 100th Falcon 9 rocket of the year",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/17/live-coverage-24-starlink-satellites-to-launch-from-california-on-100th-falcon-9-rocket-of-the-year/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2024/02/20240214_Starlink_7-14_prelaunch_small.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 17-5 mission will add another 24 broadband satellites to the company’s constellation of more than 8,100 currently in orbit. SpaceX is targeting liftoff from pad 4E at 9:23 a.m. PDT (12:23 p.m. EDT / 1623 UTC). ",
    "published_at": "2025-08-17T17:22:06Z",
    "updated_at": "2025-08-17T17:30:15.109907Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is set to launch its 100th Falcon 9 rocket of the year on Monday morning. The flight from Vandenberg Space Force Base will carry another batch of Starlink V2 Mini satellites into low Earth orbit. The Starlink 17-5 mission will also be the 72nd SpaceX launch ofStarlink satellites so far in 2025."
  },
  {
    "id": 32634,
    "title": "Hurricane Erin sets early season intensification record, becomes Category 5 storm",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/science/2025/08/hurricane-erin-sets-early-season-intensification-record-becomes-category-5-storm/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/20252281710_GOES19-ABI-taw-GEOCOLOR-1800x1080-1.jpg",
    "news_site": "Arstechnica",
    "summary": "The good news is that, for now, Erin appears unlikely to directly strike land.",
    "published_at": "2025-08-16T17:50:31Z",
    "updated_at": "2025-08-16T18:00:06.939856Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Hurricane Erin has reached Category 5 status, the most powerful kind of hurricane. Erin is expected to pass close to several landmasses between now and next Thursday. Storms like Erin are predicted to become more common due to climate change, scientists say. Erin only became a hurricane at 11 am ET on Friday as it tracked north of the Leeward Islands. The Atlantic season typically peaks in early September, with the majority of storms forming between early August and early October. But with Erin's longevity and intensity this season should soon reach and surpass normal levels of Accumulated Cyclone Energy. Forecast models indicate the likely development of more hurricanes within the next two weeks, but there is no clear consensus on whether they will impact land."
  },
  {
    "id": 32633,
    "title": "SpaceX schedules 10th test flight for Starship, details recent setbacks",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/16/spacex-schedules-starship-flight-10-details-recent-setbacks/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250815_Starship_Flight_10_Raptor_static_fire.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The next launch of SpaceX’s super heavy lift rocket would come nearly three months after the last test flight. Liftoff from Starbase, Texas, is planned during a one-hour window that opens at 6:30 p.m. CDT (7:30 p.m. EDT / 2330 UTC). ",
    "published_at": "2025-08-16T13:03:58Z",
    "updated_at": "2025-08-16T13:10:15.822228Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is gearing up for a launch of its massive Starship rocket from southern Texas. On Friday, it announced plans for the tenth flight of the fully integrated, two-stage rocket. The test flight is tentatively scheduled during an hour-long window that opens at 6:30 p.m. CDT. Starship reentered Earth’s atmosphere in an off-nominal attitude and communication was lost during entry. SpaceX used the reaction control thrusters on Ship 35 to help off-set the attitude problem and allow the nosecone venting to continue. If Ship 37 is able to make it through its planned milestones and to a controlled, atmospheric reentry it would be the first of the Block 2 version of Starship to do so. B14 flew for a second time, utilizing 29 out of the 33 Raptor engines from its previous flight. An explosion in the aft end of the booster not long after the landing burn began caused a loss of telemetry. “The most probable cause for the failure at landing burn was higher than predicted forces on the booster structure,” SpaceX said. Acting NASA Administrator Sean Duffy spoke with social media influencers about why he wasn’t concerned with the recent setbacks experienced by SpaceX. “It seems like this is a similar process to what they’ve done in the past. They learn from their mistakes and then they quickly get to the finish,” Duffy said."
  },
  {
    "id": 32632,
    "title": "FAA approves Starship Flight 10 after mishap probe, eyes August 24 launch",
    "authors": [
      {
        "name": "Alejandro Alcantarilla Romera",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/faa-flight-10-mishap-probe-august-24/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-16-04-06-46-239.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX has received clearance from the Federal Aviation Administration (FAA) to conduct the 10th test…\nThe post FAA approves Starship Flight 10 after mishap probe, eyes August 24 launch appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-16T03:36:42Z",
    "updated_at": "2025-08-16T03:40:09.714497Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has received clearance from the Federal Aviation Administration (FAA) to conduct the 10th test flight of its Starship rocket, with a targeted launch date of August 24. The FAA announced on Friday morning that it had concluded its review of the mishap from Starship’s Flight 9, which occurred earlier this year. SpaceX revealed that the probable root cause was a failure in the diffuser component of the main fuel tank pressurization system. SpaceX will launch its Starship rocket on August 24. The launch window opens at 6:30 p.m. Central Time and will feature Booster 16 and Ship 37. Ship 36, originally slated for Flight 10, exploded during ground testing in June. SpaceX is enhancing inspections, proof tests, and handling protections for COPVs."
  },
  {
    "id": 32631,
    "title": "NASA-Developed Printable Metal Can Take the Heat",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/technology/tech-transfer-spinoffs/nasa-developed-printable-metal-can-take-the-heat/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/672516046c5be-image.jpg",
    "news_site": "NASA",
    "summary": "Until now, additive manufacturing, commonly known as 3D printing, of engine components was limited by the lack of affordable metal alloys that could withstand the extreme temperatures of spaceflight. Expensive metal alloys were the only option for 3D printing engine parts until NASA’s Glenn Research Center in Cleveland, Ohio, developed the GRX-810 alloy. The primary […]",
    "published_at": "2025-08-15T20:13:43Z",
    "updated_at": "2025-08-15T20:20:05.584112Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Until now, expensive metal alloys were the only option for 3D printing engine parts. NASA’s Glenn Research Center in Cleveland, Ohio, developed the GRX-810 alloy. A ceramic oxide coating on the powdered metal particles increases its heat resistance and improves performance."
  },
  {
    "id": 32629,
    "title": "Human Rating and NASA-STD-3001",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/general/human-rating-and-nasa-std-3001/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/human-rating-pyramid-static-v1.png",
    "news_site": "NASA",
    "summary": "Human-rating is a critical certification process that validates the safety, reliability, and suitability of space systems—including orbiters, launch vehicles, rovers, spacesuits, habitats, and other crewed elements—for human use and interaction. This process ensures that systems are designed not only to protect human life but also to accommodate human needs and effectively integrate human capabilities. Human-rating requires […]",
    "published_at": "2025-08-15T18:34:58Z",
    "updated_at": "2025-08-15T18:40:06.260939Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Human-rating validates the safety, reliability, and suitability of space systems. Standards reflect NASA’s commitment to minimizing risk in human spaceflight. Early efforts focused on basic crew survival and redundancy in critical systems. Today, human-rating is an interdisciplinary effort that integrates engineering, medical, operational expertise."
  },
  {
    "id": 32630,
    "title": "NASA Astronauts to Answer Questions from Students in Minnesota",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-astronauts-to-answer-questions-from-students-in-minnesota/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/crew11-7c4516.jpg",
    "news_site": "NASA",
    "summary": "NASA astronauts Michael Finke and Zena Cardman will connect with students in Minnesota as they answer prerecorded science, technology, engineering, and mathematics (STEM) questions aboard the International Space Station. The Earth-to-space call will begin at 11 a.m. EDT on Wednesday, Aug. 20, and will stream live on the agency’s Learn With NASA YouTube channel. Media […]",
    "published_at": "2025-08-15T18:32:05Z",
    "updated_at": "2025-08-15T18:40:06.305922Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronauts Michael Fincke and Zena Cardman will answer prerecorded science, technology, engineering, and mathematics (STEM) questions. The Earth-to-space call will begin at 11 a.m. EDT on Wednesday, Aug. 20, and will stream live on the agency’s Learn With NASA YouTube channel. Media interested in covering the event must RSVP by 5 p.m., Aug. 19, to Elizabeth Ross at: 952-838-1340."
  },
  {
    "id": 32628,
    "title": "Countdown to Space Station’s Silver Jubilee with Silver Research",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/iss-research/countdown-to-space-stations-silver-jubilee-with-silver-research/",
    "image_url": "https://images-assets.nasa.gov/image/iss064e020688/iss064e020688~large.jpg",
    "news_site": "NASA",
    "summary": "This November marks a quarter century of continuous human presence aboard the International Space Station, which has served as a springboard for developing a low Earth economy and NASA’s next great leaps in exploration, including human missions to the Moon and Mars. To kick off the orbiting laboratory’s silver 25th anniversary countdown, here are a […]",
    "published_at": "2025-08-15T16:00:00Z",
    "updated_at": "2025-08-15T16:00:10.067662Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "November marks a quarter century of continuous human presence aboard the International Space Station. Silver has been used for centuries to fight infection, and researchers use its unique properties to mitigate microbial growth aboard the space station. In microgravity, there is no up or down, and weightlessness does not allow particles to settle, which impacts physical and chemical processes."
  },
  {
    "id": 32627,
    "title": "NASA’s acting chief calls for the end of Earth science at the space agency",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/nasas-acting-chief-calls-for-the-end-of-earth-science-at-the-space-agency/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/news-080625d-lg.jpg",
    "news_site": "Arstechnica",
    "summary": "NASA's charter clearly states the agency should study planet Earth, however.",
    "published_at": "2025-08-15T15:55:13Z",
    "updated_at": "2025-08-15T16:00:08.930967Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Sean Duffy, the acting administrator of NASA, has vowed to make the United States great in space. Duffy is seeking to emphasize the agency's human exploration plans, including the development of a lunar base. He also emphasized his desire to end NASA's focus on studying the Earth and understanding how the planet's surface and atmosphere are changing. Duffy is carrying out the priorities for NASA established in the President's Budget Request for fiscal year 2026. It is unclear how long Duffy will remain as \"acting\" administrator. One source indicated that the Trump administration may be closing in on a new nominee to lead the space agency full-time."
  },
  {
    "id": 32626,
    "title": "Spacewalk Pop-Up",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/spacewalk-pop-up/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/31581057184-7fc34ef213-o.jpg",
    "news_site": "NASA",
    "summary": "Former NASA astronaut Shane Kimbrough is photographed as he left the airlock hatch during a spacewalk on Jan. 13, 2017. Kimbrough performed nine spacewalks during his three spaceflights. He retired in July 2022. Astronauts conduct spacewalks to perform maintenance on the space station, install new equipment, or deploy science experiments. These activities also inform future missions […]",
    "published_at": "2025-08-15T15:03:31Z",
    "updated_at": "2025-08-15T15:10:12.572283Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Shane Kimbrough performed nine spacewalks during his three spaceflights. Astronauts conduct spacewalk to perform maintenance on the space station, install new equipment, or deploy science experiments. These activities also inform future missions like the Artemis campaign and exploring Mars; through NASA’s Extravehicular Activity and Human Surface Mobility Program."
  },
  {
    "id": 32625,
    "title": "East Coast sees major progress for future operations at the Cape",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/major-progress-future-operations-cape/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-15-14-11-24-209.jpg",
    "news_site": "NASASpaceflight",
    "summary": "Amid recent Falcon 9 and Vulcan launches, a considerable amount of important construction work in…\nThe post East Coast sees major progress for future operations at the Cape appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-15T14:33:32Z",
    "updated_at": "2025-08-15T14:40:09.840897Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NSF conducted a flyover this week near the Kennedy Space Center (KSC) and the Cape Canaveral Space Force Station (CCSFS) NSF’s latest photos show assembly tents and a number of cranes and construction equipment surrounding the launch tower. Rebar work is still going on in the flame trench, with bucket halves and trench wall sections being delivered. Draft environmental impact statement for SpaceX’s latest Starship operations plans at LC-39A shows that the company plans to conduct up to 44 launches per year from the complex. The company is also now building the Giga Bay and planning a future Starfactory next to its current operation at Roberts Road. A new tower section has also been spotted at the Roberts Road facility, along with hardware for additional tower sections and pieces for a framework of a new set of Mechazilla arms. Stoke Space plans to field a fully reusable launch vehicle known as Nova. Relativity is still working on its Terran R partially reusable launch vehicles. NASA’s Artemis program is continuing to work on ML2 despite budget uncertainty in Washington. Blue Origin will be tasked with supporting the recovery of GS1 on the second flight of New Glenn."
  },
  {
    "id": 32623,
    "title": "NASA Seeks Proposals for 2026 Human Exploration Rover Challenge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/marshall/nasa-seeks-proposals-for-2026-human-exploration-rover-challenge/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/herc-handbook-cover-2026.png",
    "news_site": "NASA",
    "summary": "NASA now is accepting proposals from student teams for a contest to design, build, and test rovers for Moon and Mars exploration through Sept. 15. Known as the Human Exploration Rover Challenge, student rovers should be capable of traversing a course while completing mission tasks. The challenge handbook has guidelines for remote-controlled and human-powered divisions. “Last year, we saw […]",
    "published_at": "2025-08-15T14:00:00Z",
    "updated_at": "2025-08-15T14:00:07.864311Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is accepting proposals from student teams for a contest to design, build, and test rovers for Moon and Mars exploration. Known as the Human Exploration Rover Challenge, student rovers should be capable of traversing a course while completing mission tasks. This year’s mission mimics future Artemis missions to the lunar surface."
  },
  {
    "id": 32622,
    "title": "Spartan Space and Airbus Complete CNES Lunar Surface Airlock Study",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/spartan-space-and-airbus-complete-cnes-lunar-surface-airlock-study/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Spartan-Space-and-Airbus-Complete-CNES-Lunar-Surface-Airlock-Study.webp",
    "news_site": "European Spaceflight",
    "summary": "Spartan Space and Airbus Defence and Space have completed a feasibility study for a lunar habitat airlock, commissioned by the French aerospace agency CNES. In September 2021, CNES launched its Lunar Integrated Shelter for Exploration (LISE) initiative. LISE is part of the agency’s Spaceship France programme, which focuses on developing core technologies for future crewed […]\nThe post Spartan Space and Airbus Complete CNES Lunar Surface Airlock Study appeared first on European Spaceflight.",
    "published_at": "2025-08-15T13:41:50Z",
    "updated_at": "2025-08-15T13:50:10.172216Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Spartan Space and Airbus Defence and Space have completed a feasibility study for a lunar habitat airlock, commissioned by the French aerospace agency CNES. In September 2021, CNES launched its Lunar Integrated Shelter for Exploration (LISE) initiative. LISE is part of the agency’s Spaceship France programme, which focuses on developing technologies for future crewed missions to the Moon and Mars."
  },
  {
    "id": 32621,
    "title": "Week in images: 11-15 August 2025",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/About_Us/Week_in_images/Week_in_images_11-15_August_2025",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/ariane_6_lofts_metop-sg-a1_and_sentinel-5_into_orbit/26835610-3-eng-GB/Ariane_6_lofts_MetOp-SG-A1_and_Sentinel-5_into_orbit_card_full.jpg",
    "news_site": "ESA",
    "summary": "Week in images: 11-15 August 2025",
    "published_at": "2025-08-15T13:10:00Z",
    "updated_at": "2025-08-15T13:00:12.718441Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "CNN.com will feature iReporter photos in a weekly Travel Snapshots gallery. Please submit your best shots for next week. Visit CNN.com/Travel next Wednesday for a new gallery of snapshots. Click here for the next gallery of iReporters' snapshots."
  },
  {
    "id": 32620,
    "title": "Hubble Examines Low Brightness, High Interest Galaxy",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/hubble-examines-low-brightness-high-interest-galaxy/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/galaxies/Hubble_NGC45_potw2532a.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image zooms in on the feathery spiral arms of the galaxy NGC 45, which lies just 22 million light-years away in the constellation Cetus (the Whale). The portrait uses data drawn from two complementary observing programs. The first took a broad view of 50 nearby galaxies, leveraging Hubble’s ability to […]",
    "published_at": "2025-08-15T11:00:00Z",
    "updated_at": "2025-08-15T11:10:12.846219Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NGC 45 lies just 22 million light-years away in the constellation Cetus (the Whale) NGC 45 is a remarkable type called a low surface brightness galaxy. Low surface brightness galaxies are fainter than the night sky itself. Studying these hard-to-detect galaxies is key to understanding how galaxies form and evolve."
  },
  {
    "id": 32624,
    "title": "Summer Triangle Corner: Altair",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/solar-system/skywatching/night-sky-network/summer-triangle-corner-altair/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/nightsky/articles/Summer%20Triangle%20005.jpeg",
    "news_site": "NASA",
    "summary": "Altair is the last stop on our trip around the Summer Triangle! The last star in the asterism to rise for Northern Hemisphere observers before summer begins, brilliant Altair is high overhead at sunset at the end of the season in September. Altair might be the most unusual of the three stars of the Triangle, […]",
    "published_at": "2025-08-15T10:00:00Z",
    "updated_at": "2025-08-15T14:10:05.524493Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": " Altair is the brightest star in the constellation of Aquila, the Eagle. Altair represents the cowherd in the ancient tale “Cowherd and the Weaver Girl’ Altair’s rapid spinning was first detected in the 1960s. As summer winds down, you can still take a Trip Around the Summer Triangle."
  },
  {
    "id": 32619,
    "title": "Curiosity Blog, Sols 4627-4628: A Ridge Stop in the Boxworks",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4627-4628-a-ridge-stop-in-the-boxworks/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_msss_04625_mhli_4625MH0001710001700780R00_DXXX.jpg",
    "news_site": "NASA",
    "summary": "Earth planning date: Monday Aug. 11, 2025 Written by Lucy Lim, Planetary Scientist at NASA’s Goddard Space Flight Center On the Curiosity team, we’re continuing our exploration of the boxwork-forming region in Gale Crater. A successful 25-meter drive (about 82 feet) brought the rover from the “peace sign” ridge intersection to a new ridge site. […]",
    "published_at": "2025-08-15T00:39:14Z",
    "updated_at": "2025-08-15T01:10:05.702521Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A successful 25-meter drive brought the rover from the “peace sign” ridge intersection to a new ridge site. Mastcam observations of a potential incipient hollow (“Laguna Miniques”) APXS and MAHLI measurements were planned to explore the local bedrock at two points."
  },
  {
    "id": 32618,
    "title": "NASA Seeks Industry Feedback on Fission Surface Power",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/nasa-seeks-industry-feedback-on-fission-surface-power/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/04/nasa_meatball_4.png",
    "news_site": "NASA",
    "summary": "As part of the agency’s initiative to return humanity to the Moon and eventually send the first astronaut – an American – to Mars, NASA is surveying industry for interest and feedback on a fission surface power system, through a Request for Information issued Thursday. Earlier this month, NASA declared its intent to put a […]",
    "published_at": "2025-08-14T22:34:13Z",
    "updated_at": "2025-08-14T22:40:04.690741Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is surveying industry for interest and feedback on a fission surface power system. Earlier this month, NASA declared its intent to put a nuclear reactor on the Moon by the mid-2030s. Nuclear power is a key element for NASA’s Artemis missions and supporting a robust lunar economy."
  },
  {
    "id": 32617,
    "title": "Astronauts Plant Seed Pillows in New Space Agriculture Study",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/astronauts-plant-seed-pillows-in-new-space-agriculture-study/",
    "image_url": "https://images-assets.nasa.gov/image/KSC-20250529-PH-CSH01_0070/KSC-20250529-PH-CSH01_0070~large.jpg",
    "news_site": "NASA",
    "summary": "When the Crew-11 astronauts launched to the International Space Station on August 1, 2025, they carried with them another chapter in space farming: the latest VEG-03 experiments, complete with seed pillows ready for planting. Growing plants provides nutrition for astronauts, as well as psychological benefits that help maintain crew morale during missions. During VEG-03 MNO, […]",
    "published_at": "2025-08-14T18:40:40Z",
    "updated_at": "2025-08-14T19:10:04.531235Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronauts will plant Wasabi mustard greens, Red Russian Kale, and Dragoon lettuce. The experiment takes place inside Veggie, a chamber about the size of carry-on luggage. Fresh food will become critical as astronauts venture farther from Earth on missions to the Moon and Mars."
  },
  {
    "id": 32615,
    "title": "Skyrora weighs options on the path to the UK’s first vertical launch",
    "authors": [
      {
        "name": "Martin Smith",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/skyrora-efis/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Render-of-Skyrora-XL-and-its-launch-tower-Skyrora.webp",
    "news_site": "NASASpaceflight",
    "summary": "Edinburgh-based Skyrora was granted its Spaceflight Operator Licence from the UK Civil Aviation Authority (CAA)…\nThe post Skyrora weighs options on the path to the UK’s first vertical launch appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-14T17:52:08Z",
    "updated_at": "2025-08-14T18:00:15.534911Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Edinburgh-based Skyrora was granted its Spaceflight Operator Licence from the UK Civil Aviation Authority (CAA) on August 5. The license authorizes one initial launch, and covers up to 16 flights per year from the SaxaVord spaceport situated 80 km to the northeast of mainland Scotland on the northernmost of the Shetland Islands. Despite being awarded the long-awaited UK license, the company might yet decide to conduct a second launch of Skylark L from another site. Skyrora has developed a containerized ‘spaceport in a box’ concept, which means that it doesn’t especially need a pad to launch from. The company’s first vehicle, the Skylark Nano, launched from the Kildermorie Estate in Ross-shire in August 2018. The relationship with the Langanes Peninsula of Iceland began with the launch of the two-stage Skylarks. Skylark L is the company’s second rocket, following the Skylark Micro. The vehicle stands 11.6 m tall and 0.7 m wide. It is powered by a combination of High-Test Peroxide (HTP) and kerosene. Skyrora uses in-house distillation processes to reach the strength needed. In 2019, Skyrora located and returned parts of this rocket’s first stage to the UK, marking its 48th anniversary. Although it offers a little less performance than when using cryogenics for oxidizers, HTP can be stored at room temperature."
  },
  {
    "id": 32616,
    "title": "After Storied 34 Year Career, Steve Platnick Retires from NASA",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/after-storied-34-year-career-steve-platnick-retires-from-nasa/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/esd/earth-observer/2025/2025-summer/platnick/steve-p-image.jpg",
    "news_site": "NASA",
    "summary": "Dr. Steven “Steve” Platnick stepped down from his role at NASA on August 8, 2025, after more than three decades of public service. Steve began his career at NASA as a physical scientist at Goddard Space Flight Center in 2002. He moved to the Earth Science Division in 2009, where he has served in various […]",
    "published_at": "2025-08-14T17:14:54Z",
    "updated_at": "2025-08-14T18:10:13.958912Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Dr. Steven “Steve” Platnick stepped down from his role at NASA on August 8, 2025. Steve began his career at NASA as a physical scientist at Goddard Space Flight Center in 2002. He moved to the Earth Science Division in 2009, where he has served in various senior management roles. Steve has been supportive of the activities of NASA’s Science Support Office (SSO) He has participated in many NASA Science exhibits at both national and international scientific conferences. Steve has been a champion of continuing to retain a historical record of NASA meetings to maintain a chronology of advances made by different groups within the NASA Earth Science community. Steve has received numerous NASA Group Achievement Awards, including for the Cloud, Aerosol and Monsoon Processes Philippines Experiment (CAMP2Ex) Steve has published more than 150 scholarly articles. He began his career at the Joint Center for Earth Systems Technology (JCET) at University of Maryland Baltimore County in 1996."
  },
  {
    "id": 32613,
    "title": "Small Companies Win Big in NASA’s TechLeap Challenge",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/directorates/smd/small-companies-win-big-in-nasas-techleap-challenge/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/bps/bps-general/TechLeapsLogo.png",
    "news_site": "NASA",
    "summary": "NASA announced 10 winning teams for its latest TechLeap Prize — the Space Technology Payload Challenge — on June 26. The winners emerged from a record-breaking field of more than 200 applicants to earn cash prizes worth up to $500,000, if they have a flight-ready unit. Recipients may also have the opportunity to flight test […]",
    "published_at": "2025-08-14T16:29:21Z",
    "updated_at": "2025-08-14T17:10:06.288505Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA announced 10 winning teams for its latest TechLeap Prize on June 26. The winners emerged from a record-breaking field of more than 200 applicants. Recipients may have the opportunity to flight test their technologies. The projects receive funding through the Commercially Enabled Rapid Space Science initiative."
  },
  {
    "id": 32614,
    "title": "New Research Connects Plant Nutrition and Astronaut Gut Health",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/new-research-connects-plant-nutrition-and-astronaut-gut-health/",
    "image_url": "https://images-assets.nasa.gov/image/iss066e008125/iss066e008125~large.jpg",
    "news_site": "NASA",
    "summary": "New research uncovers the connection between space agriculture and astronaut health. A study published in npj Microgravity shows how analyzing diverse datasets together can reveal insights that might otherwise be missed — in this case, linking space-grown food quality to astronaut nutrition and gut health. The paper reviewed previous studies of plants grown aboard the […]",
    "published_at": "2025-08-14T16:15:38Z",
    "updated_at": "2025-08-14T17:10:06.310852Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The cosmic object you were looking for has disappeared beyond the event horizon. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. The agency is based in Washington, D.C. and is funded by the U.S. taxpayer."
  },
  {
    "id": 32612,
    "title": "NASA’s Apollo Samples, LRO Help Scientists Predict Moonquakes",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/solar-system/moon/nasas-apollo-samples-lro-help-scientists-predict-moonquakes/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/psd/earths-moon/lunar-science/Taurus-Littrow%20valley.jpg",
    "news_site": "NASA",
    "summary": "Moonquakes pose little risk to astronauts during a mission lasting just a few days. But their effects on longer-term lunar surface assets could be significant.",
    "published_at": "2025-08-14T16:02:39Z",
    "updated_at": "2025-08-14T16:10:04.881617Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Scientists are working on methods to determine the frequency of moonquakes along active faults there. Moonquakes are rare, with the most powerful ones, about magnitude 5.0, occurring near the surface. Study: A magnitude 3.0 moonquake occurs along the Lee Lincoln fault about every 5.6 million years. The tracks left behind indicated that the boulders may have rolled downhill after being shaken loose during a moonquake on the Lee-Lincoln fault. The chances that a quake would have shaken the Taurus-Littrow valley on any given day while the Apollo 17 astronauts were there are 1 in 20 million. NASA also is planning to send more seismometers to the Moon."
  },
  {
    "id": 32611,
    "title": "NASA’s SpaceX Crew-10 Astronauts to Discuss Science Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasas-spacex-crew-10-astronauts-to-discuss-science-mission/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/54709009517-61ce3cf11d-k.jpg",
    "news_site": "NASA",
    "summary": "After spending almost five months in space, NASA’s SpaceX Crew-10 astronauts will discuss their science mission aboard the International Space Station during a news conference at 4:15 p.m. EDT, Wednesday, Aug. 20, from the agency’s Johnson Space Center in Houston. NASA astronauts Anne McClain and Nichole Ayers, and JAXA (Japan Aerospace Exploration Agency) astronaut Takuya Onishi […]",
    "published_at": "2025-08-14T15:53:37Z",
    "updated_at": "2025-08-14T16:00:06.448767Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA astronauts Anne McClain and Nichole Ayers, and JAXA (Japan Aerospace Exploration Agency) astronaut Takuya Onishi will answer questions about their mission. The crew spent 146 days aboard the orbiting laboratory, traveling nearly 62,795,205 million miles. While living and working aboard the station, the crew completed hundreds of science experiments and technology demonstrations."
  },
  {
    "id": 32610,
    "title": "Say Cheese!",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/say-cheese/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/iss073e0420899orig.jpg",
    "news_site": "NASA",
    "summary": "Eleven International Space Station crew members gather inside the space station’s Unity module for a portrait on Aug. 3, 2025. In the front row, from left are, Kimiya Yui of JAXA (Japan Aerospace Exploration Agency), Zena Cardman of NASA, Oleg Platonov of Roscosmos, and Mike Fincke of NASA. In the second row are, Nichole Ayers […]",
    "published_at": "2025-08-14T14:40:16Z",
    "updated_at": "2025-08-14T14:50:05.840359Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Eleven International Space Station crew members gather inside the space station’s Unity module for a portrait on Aug. 3, 2025. In the front row, from left are, Kimiya Yui of JAXA (Japan Aerospace Exploration Agency), Zena Cardman of NASA, Oleg Platonov of Roscosmos, and Mike Fincke of NASA."
  },
  {
    "id": 32609,
    "title": "MetOp-SG-A1 and Sentinel-5: from cleanroom to space",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/MetOp-SG-A1_and_Sentinel-5_from_cleanroom_to_space",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/metop-sg-a1_and_sentinel-5_from_cleanroom_to_space/26837417-2-eng-GB/MetOp-SG-A1_and_Sentinel-5_from_cleanroom_to_space_card_full.png",
    "news_site": "ESA",
    "summary": "Europe’s first MetOp Second Generation, MetOp-SG-A1, weather satellite – which hosts the Copernicus Sentinel-5 mission –  has launched aboard an Ariane 6 rocket from the European spaceport in French Guiana. The rocket lifted off on 13 August at 02:37 CEST (12 August 21:37 Kourou time).",
    "published_at": "2025-08-14T14:30:00Z",
    "updated_at": "2025-08-14T14:40:12.086689Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "MetOp-SG-A1 is the first in a series of three successive pairs of satellites. It hosts the Copernicus Sentinel-5 mission, which delivers daily global data on air pollutants and atmospheric trace gases. Ariane 6 is Europe’s heavy launcher and a key element of ESA's efforts to ensure autonomous access to space."
  },
  {
    "id": 32608,
    "title": "The Exploration Company Taps Agile Space for Nyx Earth Thrusters",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/the-exploration-company-taps-agile-space-for-nyx-earth-thrusters/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/The-Exploration-Company-Taps-Agile-Space-for-Nyx-Earth-Thrusters.webp",
    "news_site": "European Spaceflight",
    "summary": "The Exploration Company has awarded US-based Agile Space a contract to provide thrusters for its Nyx Earth spacecraft. Founded in 2021, The Exploration Company is developing a reusable spacecraft that will initially be used to transport cargo to and from the International Space Station under a European Space Agency contract. An initial mission to the […]\nThe post The Exploration Company Taps Agile Space for Nyx Earth Thrusters appeared first on European Spaceflight.",
    "published_at": "2025-08-14T13:45:22Z",
    "updated_at": "2025-08-14T13:50:13.490608Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Exploration Company has awarded a contract to Agile Space for thrusters for its Nyx Earth spacecraft. The company is developing a reusable spacecraft that will initially be used to transport cargo to and from the International Space Station. An initial mission to the orbiting laboratory is expected to take place no later than 2028."
  },
  {
    "id": 32607,
    "title": "NASA’s Stennis Space Center Employees Receive NASA Honor Awards",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/stennis/stennis-employees-receive-honor-awards/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/s25-019-2-employees-receive-nasa-honor-awards.jpg",
    "news_site": "NASA",
    "summary": "NASA Stennis Space Center Director John Bailey and Deputy Director Christine Powell presented NASA Honor Awards to employees during an onsite ceremony Aug. 13. One NASA Stennis employee received NASA’s Outstanding Leadership Medal. The medal is awarded to government employees for notable leadership accomplishments that have significantly influenced the NASA mission. Marvin Horne of Fulton, […]",
    "published_at": "2025-08-14T13:40:40Z",
    "updated_at": "2025-08-14T13:50:10.082170Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Three NASA Stennis employees received NASA’s Exceptional Service Medal. Marvin Horne of Fulton, Maryland, received the NASA Outstanding Leadership Medal. Barry Robinson of Slidell, Louisiana, was awarded the medal in absentia. Jared Grover of Diamondhead, Mississippi, led various testing and facility preparation efforts. Eight NASA Stennis employees received NASA’s Exceptional Achievement Medal. Medal is awarded to any government employee for a significant specific achievement or substantial improvement in operations, efficiency, service, financial savings, science, or technology which contributes to the mission of NASA. Leslie Anderson of Picayune, Mississippi received the NASA Exceptional achievement Medal in absentia. Four NASA Stennis employees received NASA’s Early Career Achievement Medal. Dale Woolridge of Slidell, Louisiana received the NASA Exceptional Achievement Medal in absentia. Briou Bourgeois played a key role in modifying the liquid oxygen tanking process during the SLS core stage series. Andrew Bracey of Picayune, Mississippi, received the NASA Silver Achievement Medal for contributions. He has provided critical design support for work related to Green Run testing of the new SLS (Space Launch System) exploration upper stage. Bracey also has been crucial to the NASA Stennis vision of supporting commercial aerospace testing."
  },
  {
    "id": 32605,
    "title": "NASA Glenn Earns Commercial Invention of the Year Award",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/nasa-glenn-earns-commercial-invention-of-the-year-award/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/grc-2023-c-02304.jpg",
    "news_site": "NASA",
    "summary": "NASA’s Inventions and Contributions Board (ICB) has awarded Commercial Invention of the Year to NASA Glenn Research Center’s GRX-810: A 3D Printable Alloy Designed for Extreme Environments.   NASA Alloy GRX–810, an oxide dispersion strengthened (ODS) alloy, can endure temperatures over 2,000 degrees Fahrenheit. It is more malleable and can survive more than 1,000 times longer […]",
    "published_at": "2025-08-14T11:56:06Z",
    "updated_at": "2025-08-14T12:00:10.535502Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA Glenn Research Center’s GRX-810: A 3D Printable Alloy Designed for Extreme Environments. GRX–810, an oxide dispersion strengthened (ODS) alloy, can endure temperatures over 2,000 degrees Fahrenheit. It is more malleable and can survive more than 1,000 times longer than existing state-of-the-art alloys."
  },
  {
    "id": 32604,
    "title": "NASA Tests Research Aircraft to Improve Air Taxi Flight Controls",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/aeronautics/air-taxi-flight-controls/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/raven-first-flight-april-2025-straight-angle.jpg",
    "news_site": "NASA",
    "summary": "Flying the friendly skies may one day include time-saving trips in air taxis to get from point A to point B – and NASA researchers are currently working to make that future a reality. They are using wind tunnel and flight tests to gather data on an electric Vertical takeoff and landing (eVTOL) scaled-down small […]",
    "published_at": "2025-08-14T10:00:00Z",
    "updated_at": "2025-08-14T10:00:15.956459Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA researchers are using wind tunnel and flight tests to gather data on an electric Vertical takeoff and landing (eVTOL) small aircraft. The small aircraft weighs 38 pounds with a wingspan of six feet and has 24 independently moving components. The testing is ongoing at NASA’s Langley Research Center in Hampton, Virginia. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. missions Artemis Aeronautics STEM Explore NASA’s History NASA: The Journey Through Space and Beyond. Artemis: The journey through space and beyond."
  },
  {
    "id": 32606,
    "title": "FLEX instrument meets its satellite",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/FLEX_instrument_meets_its_satellite",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/flex_instrument_meets_its_satellite/26839439-1-eng-GB/FLEX_instrument_meets_its_satellite_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-14T09:05:00Z",
    "updated_at": "2025-08-14T13:10:18.446216Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "FLEX’s fluorescence imaging spectrometer is called FLORIS for short. It is designed to map vegetation fluorescence around the globe and quantify photosynthetic activity and plant stress. The next step is to carry out a final series of tests ahead of the launch scheduled in 2026."
  },
  {
    "id": 32603,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/14/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-9/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/06/20250605_Falcon-9_night_pad_file.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-20 mission will add another 28 broadband internet satellites to SpaceX’s megaconstellation. Liftoff from pad 40 at Cape Canaveral Space Force Station is scheduled at 6:47 a.m. EDT (1047 UTC). ",
    "published_at": "2025-08-14T02:59:27Z",
    "updated_at": "2025-08-14T03:10:18.486305Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing to launch a batch of 28 of its Starlink V2 Mini satellites into low Earth orbit minutes before sunrise on Thursday morning. It’s targeting the liftoff of its Falcon 9 rocket on the Starlink 10-20 mission from pad 40 at Cape Canaveral Space Force Station at 6:47 a.m. EDT. This will be the 69th orbital launch from Florida so far this year."
  },
  {
    "id": 32602,
    "title": "Trump Issues Executive Order on Commercial Space",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/trump-issues-executive-order-on-commercial-space/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Trump-EO-policy-300x59.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "President Trump issued a broad Executive Order this afternoon addressing commercial space activities overseen by the Department of Transportation and the Department of Commerce.  Among the provisions, DOT must reform […]",
    "published_at": "2025-08-13T23:17:04Z",
    "updated_at": "2025-08-13T23:20:14.865999Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Trump issued a broad Executive Order this afternoon addressing commercial space activities. DOT must reform regulations for commercial space launch and reentry and several agencies working together to advance development of spaceport infrastructure. The Executive Order, “ Enabling Competition in the Commercial Space Industry, ” is reminiscent of Trump’s Space Policy Directive-3."
  },
  {
    "id": 32601,
    "title": "U.S. Transportation Secretary & Acting NASA Administrator Sean P. Duffy Joins President Trump Executive Order Signing to Boost U.S. Space Competitiveness",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/u-s-transportation-secretary-acting-nasa-administrator-sean-p-duffy-joins-president-trump-executive-order-signing-to-boost-u-s-space-competitiveness/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/04/meatball.png",
    "news_site": "NASA",
    "summary": "U.S. Transportation Secretary and acting NASA Administrator Sean Duffy joined President Donald J. Trump at the White House Wednesday for the historic signing of the Executive Order (EO), “Enabling Competition in the Commercial Space Industry.” “People think the Department of Transportation (DOT) is just planes, trains, and automobiles – but we have a critical role […]",
    "published_at": "2025-08-13T23:07:45Z",
    "updated_at": "2025-08-13T23:10:08.318436Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "U.S. Transportation Secretary and acting NASA Administrator Sean Duffy joined President Donald J. Trump at the White House Wednesday for the historic signing of the Executive Order. “People think the Department of Transportation (DOT) is just planes, trains, and automobiles – but we have a critical role to play in unlocking the final frontier,” said Duffy."
  },
  {
    "id": 32600,
    "title": "Ship 37 completes a Spin Prime test following Engine Swap",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/ship-37-spin-prime-engine-swap/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Ship-37-mounted-on-Pad-1-A-Again-for-engine-testing-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "The target launch date for Flight 10 is one step closer after the retest of…\nThe post Ship 37 completes a Spin Prime test following Engine Swap appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-13T22:01:41Z",
    "updated_at": "2025-08-13T22:10:21.430791Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has completed a pair of static fires on Pad 1 (A) and returned Ship 37 to Mega Bay 2 for more engine testing. The target launch date for Flight 10 is one step closer after the retest of Ship 37, which followed an engine change. The launch pad teams quickly uninstalled all of the modifications and re-installing 16 out of 20 booster hold-down clamps. Ship 37 completed a six engine spin prime during the second closure of Mega Bay 1. With this testing completed, Ship 37 will likely roll back to Mega Bay 2 for final launch preparations and checkouts. SpaceX will likely load the dummy Starlinks for the fourth time on a ship, in an attempt to test the pez deploy system in space."
  },
  {
    "id": 32599,
    "title": "The NASA RASC-AL 2026 Competition",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/prizes-challenges-crowdsourcing-program/center-of-excellence-for-collaborative-innovation-coeci/the-nasa-rasc-al-2026-competition/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/rascal.png",
    "news_site": "NASA",
    "summary": "NASA is calling on the next generation of collegiate innovators to imagine bold new concepts pushing the boundaries of human exploration on the Moon, Mars, and beyond through the 2026 NASA Revolutionary Aerospace Systems Concepts – Academic Linkage (RASC-AL) competition. The RASC-AL challenge fuels innovation for aerospace systems concepts, analogs, and technology prototyping by bridging […]",
    "published_at": "2025-08-13T20:01:00Z",
    "updated_at": "2025-08-13T20:10:11.024954Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "2026 NASA Revolutionary Aerospace Systems Concepts – Academic Linkage (RASC-AL) competition. Challenge fuels innovation for aerospace systems concepts, analogs, and technology prototyping. Award: $112,000 in total prizes. Open Date: August 13, 2025 Close Date: February 23, 2026"
  },
  {
    "id": 32597,
    "title": "Alligator Goes for a Swim",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/alligator-goes-for-a-swim/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/ksc-20170508-ph-sww01-0018orig.jpg",
    "news_site": "NASA",
    "summary": "An alligator moves through a brackish waterway at NASA’s Kennedy Space Center in Florida in this May 8, 2017, photo. The center shares space with the Merritt Island National Wildlife Refuge. More than 330 native and migratory bird species, 25 mammals, 117 fishes and 65 amphibians and reptiles call NASA Kennedy and the wildlife refuge […]",
    "published_at": "2025-08-13T15:24:11Z",
    "updated_at": "2025-08-13T15:30:10.612460Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The center shares space with the Merritt Island National Wildlife Refuge. More than 330 native and migratory bird species, 25 mammals, 117 fishes and 65 amphibians and reptiles call NASA Kennedy and the wildlife refuge home. The refuge is also home to over 1,000 known plant species."
  },
  {
    "id": 32594,
    "title": "Portugal’s ASC Granted Licence for Santa Maria Launch Centre",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/portugals-asc-granted-licence-for-santa-maria-launch-centre/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Portugals-ASC-Granted-Licence-for-Santa-Maria-Launch-Centre.webp",
    "news_site": "European Spaceflight",
    "summary": "Portugal has granted the Atlantic Spaceport Consortium a licence to build and operate a rocket launch facility on the island of Santa Maria. The Atlantic Spaceport Consortium (ASC) was founded in 2019 with the goal of developing a commercial spaceport on the island of Santa Maria, 1,500 kilometres off the Portuguese mainland. In September 2024, […]\nThe post Portugal’s ASC Granted Licence for Santa Maria Launch Centre appeared first on European Spaceflight.",
    "published_at": "2025-08-13T14:36:10Z",
    "updated_at": "2025-08-13T14:40:13.709618Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Atlantic Spaceport Consortium (ASC) was founded in 2019 with the goal of developing a commercial spaceport on the island of Santa Maria. In September 2024, the company showcased the island’s suitability as a launch site by launching two small solid-fuel rockets that it had developed in-house. In July, ASC signed an agreement with Poland-based rocket builder SpaceForest to launch its 11.5-metre Perun rocket from the island."
  },
  {
    "id": 32596,
    "title": "Tracking the climate-driven shift in Antarctic plankton from space",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Space_for_our_climate/Tracking_the_climate-driven_shift_in_Antarctic_plankton_from_space",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/penguins_resting_on_antarctic_sea_ice/26837587-2-eng-GB/Penguins_resting_on_Antarctic_sea_ice_card_full.jpg",
    "news_site": "ESA",
    "summary": "Combining 25 years of space-based data with ocean sampling, scientists have uncovered a change in the microscopic organisms that underpin the Southern Ocean’s food chain and carbon storage.",
    "published_at": "2025-08-13T14:30:00Z",
    "updated_at": "2025-08-13T15:20:14.404617Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Study uses satellite observations to study phytoplankton in the Southern Ocean. Findings could have effects on the marine food web and role as a carbon sink. Researchers analysed marker pigments in more than 14 000 in-situ samples to investigate changes in species composition over a 25-year period. Phytoplankton biomass and pigment diversity have been designated an essential climate variable. Long-term satellite records are needed to understand the cycles of these organisms. ESA’s climate initiative is establishing a project called Phyto-CCI. It aims to generate global records of phytop lankton types from space."
  },
  {
    "id": 32593,
    "title": "International Space Station undergoes crew handover, change of command",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/iss-crew-handover-command/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/IMG_9685.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "Expedition 73 aboard the International Space Station (ISS) continues to perform its scheduled science and…\nThe post International Space Station undergoes crew handover, change of command appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-13T14:07:08Z",
    "updated_at": "2025-08-13T14:10:16.157424Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Crew Dragon Endeavour set a new record for the shortest time from launch to docking. The Station has a new commander and a new set of crew members on the U.S. side of the complex. Crew-11’s astronauts settled into life aboard the orbiting outpost. Four astronauts departed this week to conclude their tour of duty on ISS. Crew-11 may be tasked with a spacewalk on the U.S. segment that Crew-10 did not do. Japan’s HTV-X is scheduled to make its first flight to ISS no earlier than this October. CRS-33, using Cargo Dragon C211 on its third flight, is currently set to launch on Thursday. While Expedition 73 continues, decisions are being made on the ground about the coming budget for the Station. VAST’s Haven Demo, designed to test key systems aboard its coming space station, is scheduled to fly later this year. Thales Alenia in Europe has completed the shell of Axiom Space's first space station module."
  },
  {
    "id": 32592,
    "title": "NASA’s Hubble Uncovers Rare White Dwarf Merger Remnant",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/nasas-hubble-uncovers-rare-white-dwarf-merger-remnant/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/releases/2025/08/STScI-01K1TXEFK7AAF8H2AJ37BPG1FD.tif",
    "news_site": "NASA",
    "summary": "An international team of astronomers has discovered a cosmic rarity: an ultra-massive white dwarf star resulting from a white dwarf merging with another star, rather than through the evolution of a single star. This discovery, made by NASA’s Hubble Space Telescope’s sensitive ultraviolet observations, suggests these rare white dwarfs may be more common than previously […]",
    "published_at": "2025-08-13T14:00:10Z",
    "updated_at": "2025-08-13T14:10:11.716738Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronomers used Hubble’s Cosmic Origins Spectrograph to investigate a white dwarf called WD 0525+526. Located 128 light-years away, it is 20% more massive than the Sun. In visible light, the spectrum of the white dwarf's atmosphere resembled that of a typical white dwarf. But Hubble's ultraviolet vision revealed that it had a very different history from what we would have guessed. The high temperature and low carbon abundance mean that identifying this white dwarf as the product of a merger would have been impossible without Hubble’s sensitivity to ultraviolet light. Because WD 0525+526's origin was revealed only once astronomers glimpsed its ultraviolet spectrum, it's likely that other seemingly “normal” white dwarfs are actually the result of cosmic collisions."
  },
  {
    "id": 32595,
    "title": "NASA’s SpaceX-33 Resupply Mission Launches Research to Station",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/iss-research/nasas-spacex-33-resupply-mission-launches-research-to-station/",
    "image_url": "https://images-assets.nasa.gov/image/jsc2025e064331/jsc2025e064331~orig.jpg",
    "news_site": "NASA",
    "summary": "Research traveling to the International Space Station aboard NASA’s SpaceX 33rd commercial resupply mission includes testing 3D bioprinting of an implantable medical device, observing behavior of engineered liver tissues, examining microgravity’s effects on bone-forming cells, and additional 3D printing of metal in space. The SpaceX Dragon spacecraft is scheduled to launch to the orbiting laboratory […]",
    "published_at": "2025-08-13T14:00:00Z",
    "updated_at": "2025-08-13T15:10:09.217493Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The SpaceX Dragon spacecraft is scheduled to launch to the orbiting laboratory in late August. For nearly 25 years, the International Space Station has provided research capabilities used by scientists from over 110 countries to conduct more than 4,000 groundbreaking experiments in microgravity. Research conducted aboard the space station advances future space exploration. This investigation is a continuation of ESA’s efforts to develop in-space manufacturing and materials recycling capabilities. The ESA investigation team includes Airbus Defence and Space SAS and the User Support Centre CADMOS in France. Learn more about the research aboard the International Space Station at: www.nasa.gov/iss-science."
  }
]