[
  {
    "id": 32603,
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/14/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-9/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/06/20250605_Falcon-9_night_pad_file.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The Starlink 10-20 mission will add another 28 broadband internet satellites to SpaceX’s megaconstellation. Liftoff from pad 40 at Cape Canaveral Space Force Station is scheduled at 6:47 a.m. EDT (1047 UTC). ",
    "published_at": "2025-08-14T02:59:27Z",
    "updated_at": "2025-08-14T03:10:18.486305Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX is preparing to launch a batch of 28 of its Starlink V2 Mini satellites into low Earth orbit minutes before sunrise on Thursday morning. It’s targeting the liftoff of its Falcon 9 rocket on the Starlink 10-20 mission from pad 40 at Cape Canaveral Space Force Station at 6:47 a.m. EDT. This will be the 69th orbital launch from Florida so far this year."
  },
  {
    "id": 32602,
    "title": "Trump Issues Executive Order on Commercial Space",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/trump-issues-executive-order-on-commercial-space/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/Trump-EO-policy-300x59.png",
    "news_site": "SpacePolicyOnline.com",
    "summary": "President Trump issued a broad Executive Order this afternoon addressing commercial space activities overseen by the Department of Transportation and the Department of Commerce.  Among the provisions, DOT must reform […]",
    "published_at": "2025-08-13T23:17:04Z",
    "updated_at": "2025-08-13T23:20:14.865999Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "President Trump issued a broad Executive Order this afternoon addressing commercial space activities. DOT must reform regulations for commercial space launch and reentry and several agencies working together to advance development of spaceport infrastructure. The Executive Order, “ Enabling Competition in the Commercial Space Industry, ” is reminiscent of Trump’s Space Policy Directive-3."
  },
  {
    "id": 32601,
    "title": "U.S. Transportation Secretary & Acting NASA Administrator Sean P. Duffy Joins President Trump Executive Order Signing to Boost U.S. Space Competitiveness",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/u-s-transportation-secretary-acting-nasa-administrator-sean-p-duffy-joins-president-trump-executive-order-signing-to-boost-u-s-space-competitiveness/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/04/meatball.png",
    "news_site": "NASA",
    "summary": "U.S. Transportation Secretary and acting NASA Administrator Sean Duffy joined President Donald J. Trump at the White House Wednesday for the historic signing of the Executive Order (EO), “Enabling Competition in the Commercial Space Industry.” “People think the Department of Transportation (DOT) is just planes, trains, and automobiles – but we have a critical role […]",
    "published_at": "2025-08-13T23:07:45Z",
    "updated_at": "2025-08-13T23:10:08.318436Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "U.S. Transportation Secretary and acting NASA Administrator Sean Duffy joined President Donald J. Trump at the White House Wednesday for the historic signing of the Executive Order. “People think the Department of Transportation (DOT) is just planes, trains, and automobiles – but we have a critical role to play in unlocking the final frontier,” said Duffy."
  },
  {
    "id": 32600,
    "title": "Ship 37 completes a Spin Prime test following Engine Swap",
    "authors": [
      {
        "name": "Ryan Weber",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/ship-37-spin-prime-engine-swap/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/Ship-37-mounted-on-Pad-1-A-Again-for-engine-testing-scaled.jpg",
    "news_site": "NASASpaceflight",
    "summary": "The target launch date for Flight 10 is one step closer after the retest of…\nThe post Ship 37 completes a Spin Prime test following Engine Swap appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-13T22:01:41Z",
    "updated_at": "2025-08-13T22:10:21.430791Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX has completed a pair of static fires on Pad 1 (A) and returned Ship 37 to Mega Bay 2 for more engine testing. The target launch date for Flight 10 is one step closer after the retest of Ship 37, which followed an engine change. The launch pad teams quickly uninstalled all of the modifications and re-installing 16 out of 20 booster hold-down clamps. Ship 37 completed a six engine spin prime during the second closure of Mega Bay 1. With this testing completed, Ship 37 will likely roll back to Mega Bay 2 for final launch preparations and checkouts. SpaceX will likely load the dummy Starlinks for the fourth time on a ship, in an attempt to test the pez deploy system in space."
  },
  {
    "id": 32599,
    "title": "The NASA RASC-AL 2026 Competition",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/directorates/stmd/prizes-challenges-crowdsourcing-program/center-of-excellence-for-collaborative-innovation-coeci/the-nasa-rasc-al-2026-competition/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/rascal.png",
    "news_site": "NASA",
    "summary": "NASA is calling on the next generation of collegiate innovators to imagine bold new concepts pushing the boundaries of human exploration on the Moon, Mars, and beyond through the 2026 NASA Revolutionary Aerospace Systems Concepts – Academic Linkage (RASC-AL) competition. The RASC-AL challenge fuels innovation for aerospace systems concepts, analogs, and technology prototyping by bridging […]",
    "published_at": "2025-08-13T20:01:00Z",
    "updated_at": "2025-08-13T20:10:11.024954Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "2026 NASA Revolutionary Aerospace Systems Concepts – Academic Linkage (RASC-AL) competition. Challenge fuels innovation for aerospace systems concepts, analogs, and technology prototyping. Award: $112,000 in total prizes. Open Date: August 13, 2025 Close Date: February 23, 2026"
  },
  {
    "id": 32597,
    "title": "Alligator Goes for a Swim",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/alligator-goes-for-a-swim/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/ksc-20170508-ph-sww01-0018orig.jpg",
    "news_site": "NASA",
    "summary": "An alligator moves through a brackish waterway at NASA’s Kennedy Space Center in Florida in this May 8, 2017, photo. The center shares space with the Merritt Island National Wildlife Refuge. More than 330 native and migratory bird species, 25 mammals, 117 fishes and 65 amphibians and reptiles call NASA Kennedy and the wildlife refuge […]",
    "published_at": "2025-08-13T15:24:11Z",
    "updated_at": "2025-08-13T15:30:10.612460Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The center shares space with the Merritt Island National Wildlife Refuge. More than 330 native and migratory bird species, 25 mammals, 117 fishes and 65 amphibians and reptiles call NASA Kennedy and the wildlife refuge home. The refuge is also home to over 1,000 known plant species."
  },
  {
    "id": 32594,
    "title": "Portugal’s ASC Granted Licence for Santa Maria Launch Centre",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/portugals-asc-granted-licence-for-santa-maria-launch-centre/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Portugals-ASC-Granted-Licence-for-Santa-Maria-Launch-Centre.webp",
    "news_site": "European Spaceflight",
    "summary": "Portugal has granted the Atlantic Spaceport Consortium a licence to build and operate a rocket launch facility on the island of Santa Maria. The Atlantic Spaceport Consortium (ASC) was founded in 2019 with the goal of developing a commercial spaceport on the island of Santa Maria, 1,500 kilometres off the Portuguese mainland. In September 2024, […]\nThe post Portugal’s ASC Granted Licence for Santa Maria Launch Centre appeared first on European Spaceflight.",
    "published_at": "2025-08-13T14:36:10Z",
    "updated_at": "2025-08-13T14:40:13.709618Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Atlantic Spaceport Consortium (ASC) was founded in 2019 with the goal of developing a commercial spaceport on the island of Santa Maria. In September 2024, the company showcased the island’s suitability as a launch site by launching two small solid-fuel rockets that it had developed in-house. In July, ASC signed an agreement with Poland-based rocket builder SpaceForest to launch its 11.5-metre Perun rocket from the island."
  },
  {
    "id": 32596,
    "title": "Tracking the climate-driven shift in Antarctic plankton from space",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Space_for_our_climate/Tracking_the_climate-driven_shift_in_Antarctic_plankton_from_space",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/penguins_resting_on_antarctic_sea_ice/26837587-2-eng-GB/Penguins_resting_on_Antarctic_sea_ice_card_full.jpg",
    "news_site": "ESA",
    "summary": "Combining 25 years of space-based data with ocean sampling, scientists have uncovered a change in the microscopic organisms that underpin the Southern Ocean’s food chain and carbon storage.",
    "published_at": "2025-08-13T14:30:00Z",
    "updated_at": "2025-08-13T15:20:14.404617Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Study uses satellite observations to study phytoplankton in the Southern Ocean. Findings could have effects on the marine food web and role as a carbon sink. Researchers analysed marker pigments in more than 14 000 in-situ samples to investigate changes in species composition over a 25-year period. Phytoplankton biomass and pigment diversity have been designated an essential climate variable. Long-term satellite records are needed to understand the cycles of these organisms. ESA’s climate initiative is establishing a project called Phyto-CCI. It aims to generate global records of phytop lankton types from space."
  },
  {
    "id": 32593,
    "title": "International Space Station undergoes crew handover, change of command",
    "authors": [
      {
        "name": "Justin Davenport",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/iss-crew-handover-command/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/IMG_9685.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "Expedition 73 aboard the International Space Station (ISS) continues to perform its scheduled science and…\nThe post International Space Station undergoes crew handover, change of command appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-13T14:07:08Z",
    "updated_at": "2025-08-13T14:10:16.157424Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Crew Dragon Endeavour set a new record for the shortest time from launch to docking. The Station has a new commander and a new set of crew members on the U.S. side of the complex. Crew-11’s astronauts settled into life aboard the orbiting outpost. Four astronauts departed this week to conclude their tour of duty on ISS. Crew-11 may be tasked with a spacewalk on the U.S. segment that Crew-10 did not do. Japan’s HTV-X is scheduled to make its first flight to ISS no earlier than this October. CRS-33, using Cargo Dragon C211 on its third flight, is currently set to launch on Thursday. While Expedition 73 continues, decisions are being made on the ground about the coming budget for the Station. VAST’s Haven Demo, designed to test key systems aboard its coming space station, is scheduled to fly later this year. Thales Alenia in Europe has completed the shell of Axiom Space's first space station module."
  },
  {
    "id": 32592,
    "title": "NASA’s Hubble Uncovers Rare White Dwarf Merger Remnant",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/hubble/nasas-hubble-uncovers-rare-white-dwarf-merger-remnant/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/hubble/releases/2025/08/STScI-01K1TXEFK7AAF8H2AJ37BPG1FD.tif",
    "news_site": "NASA",
    "summary": "An international team of astronomers has discovered a cosmic rarity: an ultra-massive white dwarf star resulting from a white dwarf merging with another star, rather than through the evolution of a single star. This discovery, made by NASA’s Hubble Space Telescope’s sensitive ultraviolet observations, suggests these rare white dwarfs may be more common than previously […]",
    "published_at": "2025-08-13T14:00:10Z",
    "updated_at": "2025-08-13T14:10:11.716738Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronomers used Hubble’s Cosmic Origins Spectrograph to investigate a white dwarf called WD 0525+526. Located 128 light-years away, it is 20% more massive than the Sun. In visible light, the spectrum of the white dwarf's atmosphere resembled that of a typical white dwarf. But Hubble's ultraviolet vision revealed that it had a very different history from what we would have guessed. The high temperature and low carbon abundance mean that identifying this white dwarf as the product of a merger would have been impossible without Hubble’s sensitivity to ultraviolet light. Because WD 0525+526's origin was revealed only once astronomers glimpsed its ultraviolet spectrum, it's likely that other seemingly “normal” white dwarfs are actually the result of cosmic collisions."
  },
  {
    "id": 32595,
    "title": "NASA’s SpaceX-33 Resupply Mission Launches Research to Station",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/iss-research/nasas-spacex-33-resupply-mission-launches-research-to-station/",
    "image_url": "https://images-assets.nasa.gov/image/jsc2025e064331/jsc2025e064331~orig.jpg",
    "news_site": "NASA",
    "summary": "Research traveling to the International Space Station aboard NASA’s SpaceX 33rd commercial resupply mission includes testing 3D bioprinting of an implantable medical device, observing behavior of engineered liver tissues, examining microgravity’s effects on bone-forming cells, and additional 3D printing of metal in space. The SpaceX Dragon spacecraft is scheduled to launch to the orbiting laboratory […]",
    "published_at": "2025-08-13T14:00:00Z",
    "updated_at": "2025-08-13T15:10:09.217493Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The SpaceX Dragon spacecraft is scheduled to launch to the orbiting laboratory in late August. For nearly 25 years, the International Space Station has provided research capabilities used by scientists from over 110 countries to conduct more than 4,000 groundbreaking experiments in microgravity. Research conducted aboard the space station advances future space exploration. This investigation is a continuation of ESA’s efforts to develop in-space manufacturing and materials recycling capabilities. The ESA investigation team includes Airbus Defence and Space SAS and the User Support Centre CADMOS in France. Learn more about the research aboard the International Space Station at: www.nasa.gov/iss-science."
  },
  {
    "id": 32598,
    "title": "Webb Narrows Atmospheric Possibilities for Earth-sized Exoplanet TRAPPIST-1 d",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/missions/webb/webb-narrows-atmospheric-possibilities-for-earth-sized-exoplanet-trappist-1-d/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/webb-STScI-01K0FMNPBZFCKFBF8Z5KZG17JR-4K.tif",
    "news_site": "NASA",
    "summary": "The exoplanet TRAPPIST-1 d intrigues astronomers looking for possibly habitable worlds beyond our solar system because it is similar in size to Earth, rocky, and resides in an area around its star where liquid water on its surface is theoretically possible. But according to a new study using data from NASA’s James Webb Space Telescope, […]",
    "published_at": "2025-08-13T14:00:00Z",
    "updated_at": "2025-08-13T16:10:08.566608Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The TRAPPIST-1 system is located 40 light-years away and was revealed as the record-holder for most Earth-sized rocky planets around a single star in 2017. Scientists are motivated to seek signs of atmospheres because red dwarf stars are the most common stars in our galaxy. If planets can hold on to an atmosphere, under waves of harsh stellar radiation, they could, as the saying goes, make it anywhere. The James Webb Space Telescope is the world’s premier space science observatory. Webb is solving mysteries in our solar system, looking beyond to distant worlds around other stars. It studies every phase in the… Exoplanets Stars Universe NASA explores the unknown in air and space, innovates for the benefit of humanity."
  },
  {
    "id": 32591,
    "title": "No Earth-like atmosphere on TRAPPIST-1 d",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/No_Earth-like_atmosphere_on_TRAPPIST-1_d",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/artist_impression_of_trappist-1_d/26837028-1-eng-GB/Artist_impression_of_TRAPPIST-1_d_card_full.jpg",
    "news_site": "ESA",
    "summary": "The exoplanet TRAPPIST-1 d intrigues astronomers looking for possibly habitable worlds beyond our solar system because it is similar in size to Earth, rocky, and resides in an area around its star where liquid water on its surface is theoretically possible. But according to a new study using data from the NASA/ESA/CSA James Webb Space Telescope, it does not have an Earth-like atmosphere.",
    "published_at": "2025-08-13T14:00:00Z",
    "updated_at": "2025-08-13T14:00:18.810838Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The TRAPPIST-1 system contains seven Earth-sized worlds orbiting the most common type of star in the galaxy: a red dwarf. Webb’s NIRSpec (Near-Infrared Spectrograph) instrument did not detect molecules that are common in Earth's atmosphere, like water, methane, or carbon dioxide. Webb observations of the outer TRAPPIST-1 planets are ongoing, which hold both potential and peril. On the one hand, planets e, f, g, and h may have better chances of having atmospheres because they are further away from the energetic eruptions of their host star. But their distance and colder environment will make atmospheric signatures more difficult to detect."
  },
  {
    "id": 32588,
    "title": "NASA Glenn Offers Students Work-Based Learning Through Engineering Institute",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/newsletters/aerospace-frontiers/nasa-glenn-offers-students-work-based-learning-through-engineering-institute/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/grc-2025-c-05566.jpg",
    "news_site": "NASA",
    "summary": "This summer, NASA’s Glenn Research Center in Cleveland hosted the NASA Glenn High School Engineering Institute, a free, work-based learning experience designed to prepare rising high school juniors and seniors for careers in the aerospace workforce.  “The institute immerses students in NASA’s work, providing essential career readiness tools for future science, technology, engineering, and mathematics-focused […]",
    "published_at": "2025-08-13T12:02:39Z",
    "updated_at": "2025-08-13T12:10:18.717344Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA Glenn Research Center in Cleveland hosted the NASA Glenn High School Engineering Institute. The free, work-based learning experience prepares rising high school juniors and seniors for careers in the aerospace workforce. Students used authentic NASA mission content and collaborated with Glenn’s technical experts. They gained a deeper understanding of the engineering design process."
  },
  {
    "id": 32589,
    "title": "NASA Glenn Shoots for the Stars During WNBA All-Star Weekend",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/glenn/nasa-glenn-shoots-for-the-stars-during-wnba-all-star-weekend/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/grc-2025-cn-00022.jpg",
    "news_site": "NASA",
    "summary": "From astronauts to athletes, researchers to referees, and communicators to coaches, NASA is much like basketball – we all train to reach the top of our game. Staff from NASA’s Glenn Research Center in Cleveland drove home this point during the “All-Star Shoot for the Stars” event at The Children’s Museum of Indianapolis, July 17-19. […]",
    "published_at": "2025-08-13T12:02:06Z",
    "updated_at": "2025-08-13T12:10:18.771280Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "“All-Star Shoot for the Stars’ event at The Children’s Museum of Indianapolis, July 17-19. Event highlighted NASA technology while illuminating the intersection of sports and STEM. Highlights included a detailed Orion exhibit, a new spacesuit display featuring five full-scale spacesuits and virtual reality demonstrations."
  },
  {
    "id": 32590,
    "title": "NASA Glenn Names University Student Design Challenge Winner",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/newsletters/aerospace-frontiers/nasa-glenn-names-university-student-design-challenge-winner/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/grc-2025-c-04852.jpg",
    "news_site": "NASA",
    "summary": "A student team from The Ohio State University secured first place in NASA Glenn Research Center’s 2025-2026 University Student Design Challenge for their innovative design aimed at managing fluids in space. The team will develop a working prototype as part of their senior capstone project during the upcoming academic year.  On June 23, the team […]",
    "published_at": "2025-08-13T12:01:52Z",
    "updated_at": "2025-08-13T12:10:18.780064Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Ohio State University team secured first place in NASA Glenn Research Center’s 2025-2026 University Student Design Challenge. The team will develop a working prototype as part of their senior capstone project during the upcoming academic year. NASA Glenn engineers Nancy Hall and John McQuillan served as student mentors and technical advisors."
  },
  {
    "id": 32587,
    "title": "MetOp-SG-A1 and Sentinel-5 launch highlights",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/MetOp-SG-A1_and_Sentinel-5_launch_highlights",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/metop-sg-a1_and_sentinel-5_launch_highlights/26830736-2-eng-GB/MetOp-SG-A1_and_Sentinel-5_launch_highlights_card_full.jpg",
    "news_site": "ESA",
    "summary": "Europe’s first MetOp Second Generation, MetOp-SG-A1, weather satellite – which hosts the Copernicus Sentinel-5 mission –  has launched aboard an Ariane 6 rocket from Europe’s Spaceport in French Guiana. The rocket lifted off on 13 August at 02:37 CEST (12 August 21:37 Kourou time).",
    "published_at": "2025-08-13T10:00:00Z",
    "updated_at": "2025-08-13T10:05:45.963306Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "1b9bed2f-7e00-4d95-b5d1-7b71c36a4ab1",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Europe’s first MetOp Second Generation, MetOp-SG-A1, weather satellite – which hosts the Copernicus Sentinel-5 mission – has launched aboard an Ariane 6 rocket. The rocket lifted off on 13 August at 02:37 CEST (12 August 21:37 Kourou time) It is the first in a series of three successive pairs of satellites."
  },
  {
    "id": 32586,
    "title": "EDGX Secures €2.3M to Build AI In-Orbit Data Processing System",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/edgx-secures-e2-3m-to-build-ai-in-orbit-data-processing-system/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/Screenshot-2025-08-13-at-11.20.38.png",
    "news_site": "European Spaceflight",
    "summary": "Belgium-based startup EDGX announced on 11 August that it had secured €2.3 million in seed funding to develop a high-performance, AI-capable on-board computer that will process data collected by a satellite’s sensors directly in orbit. Founded in 2023, EDGX is developing its Sterna on-board computer and the SpaceFeather software that will power it. It aims […]\nThe post EDGX Secures €2.3M to Build AI In-Orbit Data Processing System appeared first on European Spaceflight.",
    "published_at": "2025-08-13T09:25:35Z",
    "updated_at": "2025-08-13T09:30:12.236942Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Belgium-based startup EDGX announced on 11 August that it had secured €2.3 million in seed funding to develop a high-performance, AI-capable on-board computer. The company is currently preparing for its initial demonstration mission, dubbed Early Bird, which is scheduled to launch in February 2026 aboard a SpaceX Falcon 9. According to the company, it has already secured a €1.1 million commercial contract with an undisclosed satellite operator."
  },
  {
    "id": 32585,
    "title": "MetOp-SG-A1 and Sentinel-5 launch on Ariane 6",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/MetOp-SG-A1_and_Sentinel-5_launch_on_Ariane_6",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/metop-sg-a1_and_sentinel-5_launch_on_ariane_6/26830646-3-eng-GB/MetOp-SG-A1_and_Sentinel-5_launch_on_Ariane_6_card_full.jpg",
    "news_site": "ESA",
    "summary": "Europe’s first MetOp Second Generation, MetOp-SG-A1, weather satellite – which hosts the Copernicus Sentinel-5 mission –  has launched aboard an Ariane 6 rocket from Europe’s Spaceport in French Guiana. The rocket lifted off on 13 August at 02:37 CEST (12 August 21:37 Kourou time).",
    "published_at": "2025-08-13T06:00:00Z",
    "updated_at": "2025-08-13T06:50:20.569523Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "1b9bed2f-7e00-4d95-b5d1-7b71c36a4ab1",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "Europe’s first MetOp Second Generation, MetOp-SG-A1, weather satellite – which hosts the Copernicus Sentinel-5 mission – has launched aboard an Ariane 6 rocket. The rocket lifted off on 13 August at 02:37 CEST (12 August 21:37 Kourou time) It is the first in a series of three successive pairs of satellites."
  },
  {
    "id": 32584,
    "title": "First MetOp-SG and Sentinel-5 launched",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Applications/Observing_the_Earth/Meteorological_missions/MetOp_Second_Generation/First_MetOp-SG_and_Sentinel-5_launched",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/metop-sg-a1_and_sentinel-5_take_to_the_skies/26834648-5-eng-GB/MetOp-SG-A1_and_Sentinel-5_take_to_the_skies_card_full.jpg",
    "news_site": "ESA",
    "summary": "Ushering in a new era of weather and climate monitoring from polar orbit, the first in a new series of satellites, MetOp Second Generation, has been lofted into orbit aboard an Ariane 6 rocket from the European spaceport in Kourou, French Guiana. As part of this new satellite’s sophisticated instrument package is the new Copernicus Sentinel-5 instrument, which is designed to deliver critical data on air pollutants, ozone and climate-related gases.",
    "published_at": "2025-08-13T02:50:00Z",
    "updated_at": "2025-08-13T03:10:13.142231Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "First in a new series of satellites, MetOp Second Generation, has been lofted into orbit aboard an Ariane 6 rocket from the European spaceport in Kourou, French Guiana. As part of this new satellite’s sophisticated instrument package is the new Copernicus Sentinel-5 instrument, which is designed to deliver critical data on air pollutants. Each of the three pairs consists of an A-type and B-type satellite. They carry complementary state-of-the-art instruments to provide high-resolution measurements of temperature, precipitation, clouds and winds for weather forecasting and climate analysis. Each MetOp-SG satellite is fitted with an extra thruster, enabling it to self-destruct in Earth’s atmosphere when the mission is complete. Main stage and solid rocket boosters are responsible for the first phase of flight. The stage is powered by the Vulcain 2.1 engine (fuelled by liquid oxygen and hydrogen), with the main thrust at liftoff provided by the P120C boosters. The upper stage will fire two times to reach the required orbit for this mission."
  },
  {
    "id": 32583,
    "title": "ULA launches Vulcan rocket on first Space Force mission",
    "authors": [
      {
        "name": "William Harwood",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/13/ula-launches-vulcan-rocket-on-first-space-force-mission/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250812_Vulcan_USSF-106_liftoff_AB-1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "Equipped with four solid-fuel strap-on boosters for additional takeoff power, the 198-foot-tall Vulcan's two methane-fueled BE-4 engines thundered to life at 8:56p.m. EDT, instantly propelling the rocket away from pad 41 at the Cape Canaveral Space Force Station. ",
    "published_at": "2025-08-13T02:48:45Z",
    "updated_at": "2025-08-13T03:00:20.551010Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "United Launch Alliance fired off it’s first fully operational Vulcan rocket Tuesday. The rocket put on a spectacular sky-lighting show as it roared aloft atop nearly 3 million pounds of thrust. At least two satellites were believed to be on board: one classified spacecraft and an experimental satellite. United Launch Alliance chief executive Tory Bruno spoke with Spaceflight Now’s Stephen Clark at the 32nd Space Symposium in Colorado Springs. ULA President and CEO Tory Bruno said the Vulcan's first stage, using high-performance BE-4 engines, is particularly well suited for launching heavy military payloads into hard-to-reach orbits."
  },
  {
    "id": 32582,
    "title": "ULA’s Vulcan Centaur Lifts Off on First National Security Mission",
    "authors": [
      {
        "name": "Marcia Smith",
        "socials": null
      }
    ],
    "url": "https://spacepolicyonline.com/news/ulas-vulcan-centaur-lifts-off-on-first-national-security-mission/",
    "image_url": "https://spacepolicyonline.com/wp-content/uploads/2025/08/USSF106-on-pad-ULA-on-X-300x169.jpg",
    "news_site": "SpacePolicyOnline.com",
    "summary": "ULA’s new Vulcan Centaur rocket lifted off on a national security mission for the first time this evening. One payload aboard the U.S. Space Force’s USSF-106 mission is the Navigation […]",
    "published_at": "2025-08-13T02:35:14Z",
    "updated_at": "2025-08-13T02:40:14.188618Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The U.S. Space Force’s USSF-106 mission is the Navigation Technology Satellite-3 that is testing new technologies for future satellite navigation systems like GPS. NTS-3 is a small spacecraft on a very big rocket being launched in one of its most capable configurations. The USSF is not saying what else is aboard. ULA ended live coverage of the launch before reaching orbit. After intense debate in the Senate, then-Senator Bill Nelson brokered a deal in 2016 setting limits on the number of RD-180s ULA could buy and how long they could be used for military missions. ULA had already begun working on a new rocket by then, reaching agreement in 2014 with Jeff Bezos’s Blue Origin to build the engines."
  },
  {
    "id": 32581,
    "title": "B1091 “A Heavy Core in Falcon 9 Clothing”",
    "authors": [
      {
        "name": "Ryan Caton",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/b1091-heavy-core-falcon-9-clothing/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-12-22-08-46-758.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX’s recent launch involved another successful landing of its Falcon 9 booster, but this time…\nThe post B1091 “A Heavy Core in Falcon 9 Clothing” appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-12T21:42:48Z",
    "updated_at": "2025-08-12T21:50:13.557688Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX’s recent launch involved another successful landing of its Falcon 9 booster, but this time marked a Falcon Heavy center core booster launching and landing as a single-stick Falcon 9 rocket. The booster, designated B1091, powered the KF-02 mission, deploying 24 satellites for Amazon's Project Kuiper broadband constellation into low Earth orbit. The launch occurred on August 11, 2025, at 8:35 a.m. ET from Space Launch Complex 40. SpaceX has repurposed Falcon Heavy side boosters for Falcon 9 missions in the past, including the inaugural Falcon Heavy flight in 2018. The primary deterrent has been the added mass from reinforcements, estimated at 10-20% more than a standard Falcon 9 booster. During its return, observers noticed evidence of the booster’s heavier build during the KF-02 landing."
  },
  {
    "id": 32580,
    "title": "Curiosity Blog, Sols 4624-4626: A Busy Weekend at the Boxwork",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4624-4626-a-busy-weekend-at-the-boxwork/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/msl/2025/curiosity-rover-updates/august/https___mars.nasa.gov_msl-raw-images_proj_msl_redops_ods_surface_sol_04623_opgs_edr_ncam_NLB_807902036EDR_F1180534NCAM00286M_.jpg",
    "news_site": "NASA",
    "summary": "Written by Alex Innanen, Atmospheric Scientist at York University Earth planning date: Friday, Aug. 8, 2025 We continue to progress through the boxwork structures, arriving today at the “peace sign” ridges we were aiming for in our last drive. We’re spending the first two sols of the weekend at this location, learning everything we can […]",
    "published_at": "2025-08-12T20:51:47Z",
    "updated_at": "2025-08-12T21:10:06.807257Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Curiosity has arrived at the “peace sign” ridges we were aiming for in our last drive. The environmental science group (ENV) is also taking a dust-devil movie and a surpahorizon cloud movie. ChemCam will use AEGIS to autonomously pick a LIBS target, we’ll have a 360-degree survey to try to catch dust devils."
  },
  {
    "id": 32579,
    "title": "NASA IXPE’s ‘Heartbeat Black Hole’ Measurements Challenge Current Theories",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/ixpe/nasa-ixpes-heartbeat-black-hole-measurements-challenge-current-theories/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/10/black-hole-corona.jpg",
    "news_site": "NASA",
    "summary": "Written by Michael Allen An international team of astronomers using NASA’s IXPE (Imaging X-ray Polarimetry Explorer), has challenged our understanding of what happens to matter in the direct vicinity of a black hole. With IXPE, astronomers can study incoming X-rays and measure the polarization, a property of light that describes the direction of its electric […]",
    "published_at": "2025-08-12T20:31:55Z",
    "updated_at": "2025-08-12T20:40:08.018590Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Astronomers used NASA’s IXPE to measure a 9.1% polarization degree for black hole IGR J17091-3624. The polarization degree is a measurement of how aligned those vibrations are to each other. Despite how bright the corona is, at some 28,000 light-years from Earth, it remains far too small and distant to capture an image of it. IXPE is led by NASA’s Marshall Space Flight Center in Huntsville, Alabama. BAE Systems, Inc., headquartered in Falls Church, Virginia, manages spacecraft operations. The Imaging X-ray Polarimetry Explorer (IXPE) is a space observatory built to discover the secrets of some of the most…"
  },
  {
    "id": 32578,
    "title": "A Tapestry of Tales: 10th Anniversary Reflections from NASA’s OCO-2 Mission",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/earth-science/a-tapestry-of-tales-10th-anniversary-reflections-from-nasas-oco-2-mission/",
    "image_url": "https://science.nasa.gov/wp-content/uploads/2024/05/eo-feature-article-banner.png",
    "news_site": "NASA",
    "summary": "When woven together, the tapestry of experiences of staff and scientists provide the complete picture of OCO-2. Breathe in… Breathe out. This simple rhythm sets the foundation of life on Earth – and it’s a pattern that a NASA satellite has been watching from space for over a decade. On July 2, 2024, NASA’s Orbiting […]",
    "published_at": "2025-08-12T20:01:18Z",
    "updated_at": "2025-08-12T20:10:23.426654Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "On July 2, 2024, NASA’s Orbiting Carbon Observatory-2 (OCO-2) celebrated 10 years since its launch. OCO-2 is now viewed as the gold standard for carbon dioxide (CO 2 ) measurements from space. Scientists from around the world have come together to bring the important data from this satellite to the broader community. The first launch in 2009 ended in failure – when a faulty launch vehicle doomed the first OCO to a watery grave. In the aftermath, the OCO community were left in limbo, unsure if the project would survive. OCO-2 can detect the faint glow given off by plants during photosynthesis. This glow offers a fast, sensitive indicator of plant health – see Figure 2 . OCO-2 and MODIS provide a global dataset of plant photosynthesis far beyond what either satellite could produce on its own. OCO-2’s synergy with its A-Train counterpart, the Moderate Resolution Imaging Spectroradiometer (MODIS) on NASA’S Aqua platform, makes the data even more powerful. OCO-2 and OCO-3 provide complementary perspectives on Earth’s carbon cycle and plant health at space and time resolutions that have not been possible from space before. The satellite's high-precision measurements can now detect CO 2 linked not just to countries, but large cities, industrial zones, and even individual power plants – all while researchers continue perfecting efforts to identify contributions from city sectors. The Total Carbon Column Observing Network (TCCON) of Fourier Transform Spectrometers (FTS) measure CO 2 over snow-covered ground. OCO-2 was being used to develop early drought forecasts. The “ground truth” data collected at these field sites help to ensure that the satellite is accurately measuring “Earth’s breathing” During the 2015–2016 El Niño, large tropical forests temporarily transformed into net carbon sources. OCO-2 captured the increase in atmospheric CO 2 and scientists used this data to refine estimates of how these events contribute to the global carbon budget. Scientists are combining the satellite data with wind models and urban maps to trace CO 2 to its sources."
  },
  {
    "id": 32577,
    "title": "A Gigantic Jet Caught on Camera: A Spritacular Moment for NASA Astronaut Nicole Ayers!",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://science.nasa.gov/science-research/heliophysics/a-gigantic-jet-caught-on-camera-a-spritacular-moment-for-nasa-astronaut-nicole-ayers/",
    "image_url": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/citizen-science/highlights/2025/gigantic-jet-event.png",
    "news_site": "NASA",
    "summary": "Astronaut Captures Rare Gigantic Jet from Space On July 3, 2025, NASA astronaut Nichole Ayers photographed an extraordinary sight from the International Space Station — a rare gigantic jet, a powerful electrical discharge shooting from the top of a thunderstorm into the upper atmosphere. Often mistaken for sprites, these towering lightning events bridge clouds and space, depositing massive electrical charges. Learn how gigantic jets differ from other Transient Luminous Events and how you can submit your own sightings to Spritacular.org.",
    "published_at": "2025-08-12T18:58:36Z",
    "updated_at": "2025-08-12T19:10:09.483125Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA astronaut Nichole Ayers captured a rare form of a Transient Luminous Events (TLEs) — a gigantic jet. Gigantic jets are a powerful type of electrical discharge that extends from the top of a thunderstorm into the upper atmosphere. Sprites, on the other hand, are one of the most commonly observed types of TLEs."
  },
  {
    "id": 32576,
    "title": "LIVE COVERAGE! Vulcan Set To Launch First U.S. National Security Mission",
    "authors": [
      {
        "name": "Zac Aubert",
        "socials": {
          "x": "https://x.com/Astro_Aubert",
          "youtube": "",
          "instagram": "",
          "linkedin": "https://www.linkedin.com/in/zachary-aubert-43853b22/",
          "mastodon": "",
          "bluesky": ""
        }
      }
    ],
    "url": "https://tlpnetwork.com/news/america/vulcan-set-to-launch-first-us-national-security-mission",
    "image_url": "https://cdn.tlpnetwork.com/articles/2025/1755015722251.jpg",
    "news_site": "The Launch Pad",
    "summary": "LIVE COVERAGE! Vulcan Set To Launch First U.S. National Security Mission",
    "published_at": "2025-08-12T16:15:00Z",
    "updated_at": "2025-08-12T16:40:19.376158Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The USSF-106 mission, flying for the U.S. Space Force’s Space Systems Command, is scheduled to lift off tonight from Space Launch Complex-41 at Cape Canaveral Space Force Station, Florida. The launch window runs from 7:59 to 8:59 p.m. EDT (2359–0059 UTC), with liftoff targeted within that one-hour period."
  },
  {
    "id": 32573,
    "title": "Hubble Captures a Tarantula",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/hubble-captures-a-tarantula/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/hubble-30dor-potw2531a-1.jpg",
    "news_site": "NASA",
    "summary": "This NASA/ESA Hubble Space Telescope image captures incredible details in the dusty clouds of a star-forming factory called the Tarantula Nebula. Most of the nebulae Hubble images are in our galaxy, but this nebula is in the Large Magellanic Cloud, a dwarf galaxy located about 160,000 light-years away in the constellations Dorado and Mensa. The Large Magellanic […]",
    "published_at": "2025-08-12T15:35:27Z",
    "updated_at": "2025-08-12T15:40:08.255632Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Tarantula Nebula is in the Large Magellanic Cloud, a dwarf galaxy located about 160,000 light-years away in the constellations Dorado and Mensa. This image is very close to a rare type of star called a Wolf–Rayet star . Wolf– Rayet stars are massive stars that have lost their outer shell of hydrogen."
  },
  {
    "id": 32572,
    "title": "NASA Roman Core Survey Will Trace Cosmic Expansion Over Time",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/roman-space-telescope/nasa-roman-core-survey-will-trace-cosmic-expansion-over-time/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/snsn.jpg",
    "news_site": "NASA",
    "summary": "NASA’s Nancy Grace Roman Space Telescope will be a discovery machine, thanks to its wide field of view and resulting torrent of data. Scheduled to launch no later than May 2027, with the team working toward launch as early as fall 2026, its near-infrared Wide Field Instrument will capture an area 200 times larger than […]",
    "published_at": "2025-08-12T14:00:00Z",
    "updated_at": "2025-08-12T14:50:07.721488Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The Nancy Grace Roman Space Telescope will be a discovery machine. Its near-infrared Wide Field Instrument will capture an area 200 times larger than the Hubble Space Telescope’s infrared camera. Roman will devote about 75% of its science observing time over its five-year primary mission. High-Latitude Time-Domain Survey will be split into two imaging “tiers” — a wide tier that covers more area and a deep tier that will focus on a smaller area for a longer time to detect fainter objects. The observations will take place in two areas, one in the northern sky and another in the southern sky. There will also be a spectroscopic component to this survey, which will be limited to the southern night sky."
  },
  {
    "id": 32571,
    "title": "Ariane 6: preparing flight VA264 for liftoff",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/Ariane_6_preparing_flight_VA264_for_liftoff",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/ariane_6_preparing_flight_va264_for_liftoff/26837507-2-eng-GB/Ariane_6_preparing_flight_VA264_for_liftoff_card_full.jpg",
    "news_site": "ESA",
    "summary": "MetOp-SG-A1 travelled onboard the Canopée ship. Our teams at the European spaceport in French Guiana have been quite busy making sure both the rocket and the payloads are ready for flight VA264.",
    "published_at": "2025-08-12T13:30:00Z",
    "updated_at": "2025-08-12T13:50:13.679114Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "MetOp-SG-A1 is the first in a series of three successive pairs of satellites. Will provide global observations from polar orbit for weather forecasting and climate analysis for more than 20 years. Will launch on an Ariane 6 rocket from Europe’s Spaceport in Kourou, French Guiana on August 2025."
  },
  {
    "id": 32570,
    "title": "Live coverage: ULA to launch first national security mission on a Vulcan rocket",
    "authors": [
      {
        "name": "Will Robinson-Smith",
        "socials": null
      }
    ],
    "url": "https://spaceflightnow.com/2025/08/12/live-coverage-ula-to-launch-first-national-security-mission-on-a-vulcan-rocket/",
    "image_url": "http://spaceflightnow.com/wp-content/uploads/2025/08/20250811_Vulcan_USSF-106_prelaunch_MC-1.jpg",
    "news_site": "Spaceflight Now",
    "summary": "The mission, dubbed USSF-106, will be the first Vulcan rocket launch since the vehicle was certified by the United States Space Force in late March. Liftoff from pad 41 at Cape Canaveral Space Force Station is schedule for 7:59 p.m. EDT (2359 UTC). ",
    "published_at": "2025-08-12T11:34:19Z",
    "updated_at": "2025-08-12T11:40:19.455761Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The United States Space Force (USSF)-106 mission is scheduled to launch from Cape Canaveral on Tuesday. The rocket will carry a pair of satellites to geoscynchronous orbit. The launch marks ULA's return to launching payloads as part of the National Security Space Launch (NSSL) program. The USSF-106 mission is comprised of two satellites. One of those remains a mystery with Space Force officials unwilling to provide any details. The other, which is described as the primary payload onboard the Vulcan rocket is the brainchild of the Air Force Research Laboratory. The mission and launch together come with a $250 million price tag. NTS-3 is being tested in the laboratory as well as out in the field. Some of the learns from this, like calibrating a spot beam antenna, can be applied to the next generation of GPS satellites, called GPS 3-F. The prime contractor that manufactured the satellite is L3Harris Technologies."
  },
  {
    "id": 32569,
    "title": "DGA Selects Infinite Orbits for €50M PALADIN Satellite-Inspection Service",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/dga-selects-infinite-orbits-for-e50m-paladin-satellite-inspection-service/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/DGA-Selects-Infinite-Orbits-for-50M-Euro-PALADIN-Satellite-Inspection-Spacecraft.webp",
    "news_site": "European Spaceflight",
    "summary": "France’s Directorate General of Armament has awarded the €50M PALADIN framework agreement to Infinite Orbits to deliver a geostationary orbit inspection and monitoring service for the nation’s Space Command. The PALADIN project is part of France’s Action et Résilience Spatiale (ARES – Space Action and Resilience) initiative, which aims to monitor and counter direct threats […]\nThe post DGA Selects Infinite Orbits for €50M PALADIN Satellite-Inspection Service appeared first on European Spaceflight.",
    "published_at": "2025-08-12T08:29:33Z",
    "updated_at": "2025-08-12T08:30:13.722605Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "PALADIN project is part of France’s Action et Résilience Spatiale (ARES – Space Action and Resilience) initiative. Infinite Orbits will develop a dedicated spacecraft capable of delivering the geostationary orbit inspection and monitoring service. The spacecraft is expected to be ready for launch by 2027."
  },
  {
    "id": 32568,
    "title": "CREAM: avoiding collisions in space through automation",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/Space_Safety/Space_Debris/CREAM_avoiding_collisions_in_space_through_automation",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/04/model_of_the_distribution_of_space_debris_around_earth/26641745-1-eng-GB/Model_of_the_distribution_of_space_debris_around_Earth_card_full.jpg",
    "news_site": "ESA",
    "summary": "Earth orbit is becoming increasingly crowded. With over 11 000 active satellites and many thousands more expected in the coming years as well as over 1.2 million pieces of space debris greater than 1 cm, the risk of in-orbit collisions has turned into a daily operational concern. ESA is investing in automation technologies that can help satellite operators respond more effectively to collision risks.",
    "published_at": "2025-08-12T08:00:00Z",
    "updated_at": "2025-08-12T08:10:12.725254Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Collision Risk Estimation and Automated Mitigation (CREAM) project is a key element of ESA’s Space Safety Programme. It aims to reduce the workload of operators, the number of false alerts and the response time of collision avoidance measures. Started in 2020, the project has now entered a critical phase of ground systems test operations and in-orbit demonstrations. Europe must have the ambition to have a space programme and a space agency that is world-class. Agenda 2025 will bring European space to the next level. To meet our ambitions we need to accelerate the use of space in Europe. The Zero Debris Community is a collaborative effort for a sustainable future in orbit."
  },
  {
    "id": 32565,
    "title": "Raptor 3 testing ramps up at SpaceX McGregor",
    "authors": [
      {
        "name": "Alejandro Alcantarilla Romera",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/raptor-3-ramps-spacex-mcgregor/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/NSF-2025-08-12-00-07-16-499.jpg",
    "news_site": "NASASpaceflight",
    "summary": "SpaceX has ramped up its engine testing efforts at the McGregor test facility this past…\nThe post Raptor 3 testing ramps up at SpaceX McGregor appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-12T01:53:59Z",
    "updated_at": "2025-08-12T02:00:20.488937Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The SpaceX McGregor test site, situated in the small town of McGregor, Texas, serves as the company’s primary rocket development and test facility for propulsion systems. SpaceX has ramped up its engine testing efforts at the McGregor test facility this past week, conducting a total of 24 Raptor engine firings and achieving multiple milestones in engine performance and durability. SpaceX performed a rigorous “torture test” on the vertical stand, firing a single Raptor engine 13 times in succession. In addition to the firings, observers noted increased engine traffic around the site. A Raptor 2 Vacuum engine bearing serial number 580 was seen multiple times between August 4 and 7."
  },
  {
    "id": 32563,
    "title": "NASA Invites Media to View Artemis II Orion Stage Adapter at Marshall",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-view-artemis-ii-orion-stage-adapter-at-marshall/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/artemis-ii-osa-crop.jpg",
    "news_site": "NASA",
    "summary": "Media are invited to NASA’s Marshall Space Flight Center in Huntsville, Alabama, at 2 p.m. CDT Thursday, Aug. 14 to view the final piece of space flight hardware for the agency’s SLS (Space Launch System) rocket for the Artemis II mission before it is delivered to NASA’s Kennedy Space Center in Florida. All other elements […]",
    "published_at": "2025-08-11T21:08:05Z",
    "updated_at": "2025-08-11T21:10:15.919068Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Media are invited to NASA’s Marshall Space Flight Center in Huntsville, Alabama, at 2 p.m. CDT Thursday, Aug. 14. Media will have the opportunity to capture images and video and speak to subject matter experts. This event is open to U.S. media, who must confirm their attendance with Jonathan Deal in Marshall’S Office of Communications at jonathan.e.deal@nasa.gov."
  },
  {
    "id": 32562,
    "title": "NASA Awards Second Human Health, Performance Contract",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-awards-second-human-health-performance-contract/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2024/08/meatball-w-black-background.webp",
    "news_site": "NASA",
    "summary": "NASA has selected KBR Wyle Services, LLC of Fulton, Maryland, to provide services to the Human Health and Performance Directorate at the agency’s Johnson Space Center in Houston, which focuses on astronaut health, occupational health, and research that could help mitigate health risks for future human spaceflight missions. The Human Health and Performance Contract 2 […]",
    "published_at": "2025-08-11T20:21:06Z",
    "updated_at": "2025-08-11T20:30:08.833134Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "KBR Wyle Services, LLC of Fulton, Maryland, will provide services to the Human Health and Performance Directorate. The contract will acquire support services for several programs, primarily at NASA Johnson. The total estimated value of the base period plus the optional periods is $3.6 billion."
  },
  {
    "id": 32561,
    "title": "NASA Explores Industry Possibilities to Raise Swift Mission’s Orbit",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/swift/nasa-explores-industry-possibilities-to-raise-swift-missions-orbit/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2023/06/swift-view-01-comp-small.png",
    "news_site": "NASA",
    "summary": "To drive the development of key space-based capabilities for the United States, NASA is exploring an opportunity to demonstrate technology to raise a spacecraft’s orbit to a higher altitude. Two American companies – Cambrian Works of Reston, Virginia, and Katalyst Space Technologies of Flagstaff, Arizona – will develop concept design studies for a possible orbit […]",
    "published_at": "2025-08-11T19:55:09Z",
    "updated_at": "2025-08-11T20:00:11.096007Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is exploring an opportunity to demonstrate technology to raise a spacecraft’s orbit to a higher altitude. Two American companies – Cambrian Works of Reston, Virginia, and Katalyst Space Technologies of Flagstaff, Arizona – will develop concept design studies. The Neil Gehrels Swift Observatory was designed to observe gamma-ray bursts, the universe's most powerful explosions. Cambrian and Katalyst have each been awarded $150,000 under Phase III SBIR contracts for concept design studies. NASA’s Goddard Space Flight Center in Greenbelt, Maryland, manages the Swift mission in collaboration with Penn State, the Los Alamos National Laboratory in New Mexico, and Northrop Grumman Space Systems."
  },
  {
    "id": 32564,
    "title": "Launch Roundup: Vulcan and Ariane to launch ahead of Starlink missions",
    "authors": [
      {
        "name": "John Sharp",
        "socials": null
      }
    ],
    "url": "https://www.nasaspaceflight.com/2025/08/vulcan-ariane-starlink-missions/",
    "image_url": "https://www.nasaspaceflight.com/wp-content/uploads/2025/08/IMG_3119.jpeg",
    "news_site": "NASASpaceflight",
    "summary": "After a week of weather delays across the U.S, launch cadence increases as providers strive…\nThe post Launch Roundup: Vulcan and Ariane to launch ahead of Starlink missions appeared first on NASASpaceFlight.com.",
    "published_at": "2025-08-11T19:09:59Z",
    "updated_at": "2025-08-11T23:30:11.781329Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "A SpaceX Falcon 9 is now scheduled to launch on Tuesday, Aug. 12, at 8:44 PM PDT (Wednesday, 03:44 UTC) from Space Launch Complex 4 East (SLC-4E) at Vandenberg Space Force Base (VSFB) in California. The Ariane 6 flying this mission is of the ‘62’ variant, meaning two strap-on solid rocket boosters will be attached to the 5.4 m diameter core stage. The payload for this mission will be the MetOp-SG-A1 satellite, operated by the European Organisation for the Exploitation of Meteorological Satellites. Starlink Group 10-20 will launch atop booster B1085 and will fly northwest, carrying a payload of 28 satellites for insertion into LEO. After launch, the booster will land on the SpaceX droneship Just Read the Instructions. Another Falcon 9 launch is scheduled for Friday, Aug. 15 is Starlink Group 17-5."
  },
  {
    "id": 32559,
    "title": "Space Station Cell Studies",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/missions/station/iss-research/space-station-cell-studies/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/04/image-15868f.jpeg",
    "news_site": "NASA",
    "summary": "Science in Space August 2025 Cells are the basic building blocks of all living things, from single-celled bacteria to plants and animals containing vast numbers of them. Cells have adapted for a wide variety of settings and functions. Nerve cells in humans and animals, for example, have long, thin extensions that rapidly transmit signals, while […]",
    "published_at": "2025-08-11T19:00:00Z",
    "updated_at": "2025-08-11T19:10:08.052896Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Cell biology is the study of cell structure, function, and behavior. For humans, scientists in this field explore the mechanisms of diseases from bone loss to cancer and work on developing treatments. Cell-based experiments on The International Space Station help identify how spaceflight affects people and other living systems. NASA explores the unknown in air and space, innovates for the benefit of humanity, and inspires the world through discovery. Latest News from Space Station Research Space Station research and technology tools and information. Space Stationresearch.com: http://www.nasa.gov/space-station/news-and-information."
  },
  {
    "id": 32558,
    "title": "NASA Continues Search for Moon-Focused Sustainability Solutions",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/news-release/nasa-continues-search-for-moon-focused-sustainability-solutions/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/moon-sustainability-release-aug-11.webp",
    "news_site": "NASA",
    "summary": "NASA is accepting U.S. submissions for the second phase of the agency’s LunaRecycle Challenge, a Moon-focused recycling competition. The challenge aims to develop solutions for recycling common trash materials – like fabrics, plastics, foam, and metals – that could accumulate from activities such as system operations, industrial activities, and building habitats in deep space. Phase […]",
    "published_at": "2025-08-11T18:40:05Z",
    "updated_at": "2025-08-11T18:40:08.029894Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "NASA is accepting U.S. submissions for the second phase of the agency’s LunaRecycle Challenge. The challenge aims to develop solutions for recycling common trash materials. Cash prizes totaling $2 million are available for successful solutions. Estimates indicate a crew of four astronauts could generate more than 2,100 kilograms (4,600 pounds) of single-use waste."
  },
  {
    "id": 32557,
    "title": "Why Amazon is letting its rival launch its satellites",
    "authors": [
      {
        "name": "Eric Berger",
        "socials": null
      }
    ],
    "url": "https://arstechnica.com/space/2025/08/why-amazon-is-letting-its-rival-launch-its-satellites/",
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GkLx4V-bUAIwEGZ.jpg",
    "news_site": "Arstechnica",
    "summary": "Satellite companies find themselves between a rocket and a hard place.",
    "published_at": "2025-08-11T17:30:59Z",
    "updated_at": "2025-08-11T17:40:07.028438Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "SpaceX launched a direct competitor to its Starlink network into orbit. Jeff Bezos, founder of Amazon, owns a rocket company of his own in Blue Origin. SpaceX sells launch services to all comers and typically offers the lowest price per kilogram to orbit. For SpaceX, this is great business. SpaceX asked companies seeking launch services to share spectrum rights as a condition of flying on Falcon 9. The term spectrum rights refers to using part of the radio frequency spectrum for transmitting data to and from space. Other companies, including AST SpaceMobile and EchoStar will need to decide whether to buy from SpaceX or pay more for slower access to space from other launch companies."
  },
  {
    "id": 32556,
    "title": "NASA’s SpaceX Crew-10 Splashes Down in Pacific Ocean",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/image-article/nasas-spacex-crew-10-splashes-down-in-pacific-ocean/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/08/54709009517-0c71126a06-o.jpg",
    "news_site": "NASA",
    "summary": "The members of NASA’s SpaceX Crew-10 mission – Roscosmos cosmonaut Kirill Peskov, left, NASA astronauts Nichole Ayers and Anne McClain, and JAXA (Japan Aerospace Exploration Agency) astronaut Takuya Onishi – are all smiles after having landed in the Pacific Ocean off the coast of San Diego, Calif., Saturday, Aug. 9, 2025. The crew spent seven […]",
    "published_at": "2025-08-11T17:09:28Z",
    "updated_at": "2025-08-11T17:10:15.123928Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The crew spent seven months aboard the International Space Station. Crew-10 contributed hundreds of hours to scientific research, maintenance activities, and technology demonstrations. McClain, Ayers, and Onishi completed investigations on plant and microalgae growth, examined how space radiation affects DNA sequences in plants."
  },
  {
    "id": 32554,
    "title": "ESA to Develop Hummingbird-Inspired Flying Mars Explorer",
    "authors": [
      {
        "name": "European Spaceflight",
        "socials": null
      }
    ],
    "url": "https://europeanspaceflight.com/esa-to-develop-hummingbird-inspired-flying-mars-explorer/",
    "image_url": "https://europeanspaceflight.com/wp-content/uploads/2025/08/ESA-to-Develop-Hummingbird-Inspired-Flying-Mars-Explorer.webp",
    "news_site": "European Spaceflight",
    "summary": "The European Space Agency has published a call to tender for the development of “flapping wing technology” for a Mars surface explorer. In the 8 August call, the agency states that on Mars, a flapping-wing propulsion system could offer greater energy efficiency, manoeuvrability, structural robustness, and adaptability than conventional helicopter or fixed-wing alternatives. As a […]\nThe post ESA to Develop Hummingbird-Inspired Flying Mars Explorer appeared first on European Spaceflight.",
    "published_at": "2025-08-11T12:09:52Z",
    "updated_at": "2025-08-11T12:10:13.130013Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "The European Space Agency has published a call to tender for the development of ‘flapping wing technology’ for a Mars surface explorer. The agency states that on Mars, a flapping-wing propulsion system could offer greater energy efficiency, manoeuvrability, structural robustness, and adaptability than conventional helicopter or fixed-wing alternatives."
  },
  {
    "id": 32555,
    "title": "Behind the scenes with MetOp-SG and Sentinel-5",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Videos/2025/08/Behind_the_scenes_with_MetOp-SG_and_Sentinel-5",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2025/08/behind_the_scenes_with_metop-sg_and_sentinel-5/26834752-1-eng-GB/Behind_the_scenes_with_MetOp-SG_and_Sentinel-5_card_full.png",
    "news_site": "ESA",
    "summary": "Experience the preparation of the MetOp-SG-A1 satellite, hosting Copernicus Sentinel-5, scheduled for liftoff on an Ariane 6 rocket from Europe’s Spaceport in Kourou, French Guiana, on 13 August 2025 at 02:37 CEST (12 August 21:37 Kourou time). This timelapse video captures key stages from the encapsulation within the Ariane 6 fairing to the installation in the launch tower.",
    "published_at": "2025-08-11T12:00:00Z",
    "updated_at": "2025-08-11T16:14:31.898254Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "1b9bed2f-7e00-4d95-b5d1-7b71c36a4ab1",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "MetOp-SG-A1 is the first in a series of three successive pairs of satellites. It will carry the Copernicus Sentinel-5 mission to deliver daily global data on air pollutants and atmospheric trace gases. This timelapse video captures key stages from the encapsulation within the Ariane 6 fairing to the installation in the launch tower."
  },
  {
    "id": 32566,
    "title": "Ariane 6 with MetOp-SG-A1 in its mobile hangar",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/Ariane_6_with_MetOp-SG-A1_in_its_mobile_hangar",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/ariane_6_with_metop-sg-a1_in_its_mobile_hangar/26836259-2-eng-GB/Ariane_6_with_MetOp-SG-A1_in_its_mobile_hangar_card_full.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-11T11:55:00Z",
    "updated_at": "2025-08-12T07:36:51.998182Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "1b9bed2f-7e00-4d95-b5d1-7b71c36a4ab1",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "MetOp-SG-A1 is the first in a series of three successive pairs of satellites. It carries six instruments: a next-generation infrared atmospheric sounder, a microwave sounder and a multispectral imaging radiometer. The European Commission’s Copernicus Sentinel-5 spectrometer is also onboard."
  },
  {
    "id": 32567,
    "title": "The top of Ariane 6 with MetOp-SG-A1",
    "authors": [
      {
        "name": "ESA",
        "socials": null
      }
    ],
    "url": "https://www.esa.int/ESA_Multimedia/Images/2025/08/The_top_of_Ariane_6_with_MetOp-SG-A1",
    "image_url": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/08/the_top_of_ariane_6_with_metop-sg-a1/26836306-2-eng-GB/The_top_of_Ariane_6_with_MetOp-SG-A1_pillars.jpg",
    "news_site": "ESA",
    "summary": "From the ESA Blogs.",
    "published_at": "2025-08-11T11:55:00Z",
    "updated_at": "2025-08-12T07:36:58.690656Z",
    "featured": false,
    "launches": [
      {
        "launch_id": "1b9bed2f-7e00-4d95-b5d1-7b71c36a4ab1",
        "provider": "Launch Library 2"
      }
    ],
    "events": [],
    "detailed_news": "MetOp-SG-A1 is the first in a series of three successive pairs of satellites. The mission as a whole ensures the continued delivery of global observations from polar orbit for weather forecasting and climate analysis for more than 20 years. The missions will launch on an Ariane 6 with two boosters."
  },
  {
    "id": 32552,
    "title": "Juliana Barajas: Supporting NASA’s Mission, One Task at a Time",
    "authors": [
      {
        "name": "NASA",
        "socials": null
      }
    ],
    "url": "https://www.nasa.gov/centers-and-facilities/white-sands/juliana-barajas-supporting-nasas-mission-one-task-at-a-time/",
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/07/image000000-e1751903895730.jpg",
    "news_site": "NASA",
    "summary": "As an administrative assistant in the Safety and Mission Assurance Office at NASA’s White Sands Test Facility in Las Cruces, New Mexico, Juliana Barajas approaches her work with one clear mission: to help others succeed.   For over two decades, she has supported NASA’s mission with a career grounded in service, perseverance, and gratitude. Whether coordinating […]",
    "published_at": "2025-08-11T10:00:00Z",
    "updated_at": "2025-08-11T10:10:07.543566Z",
    "featured": false,
    "launches": [],
    "events": [],
    "detailed_news": "Juliana Barajas is an administrative assistant in the Safety and Mission Assurance Office at NASA’s White Sands Test Facility in Las Cruces, New Mexico. “If I can help those around me succeed, then I have fulfilled my duty,” she said. She hopes to pass on courage, resilience, and the determination to persevere."
  }
]